{"tench": ["Tench have a large, rounded head with a protruding lower jaw and a small, upturned mouth.", "Tench have a large, flat, and slightly rounded tail fin. They also have two dorsal fins, the first being short and the second being longer and more pointed."], "goldfish": ["Goldfish have a distinct body shape, with a deep, rounded body and a long, flowing tail.", "Goldfish often have a single dorsal fin, located on the back of the fish, and two pectoral fins located on either side of the body."], "great white shark": ["The coloration of great white sharks is usually a grayish-white on top and white on the bottom, with a white underside and black tips on the dorsal fin and tail.", "Great white sharks have a unique pattern of black spots on their sides, which can be used to identify individual sharks."], "tiger shark": ["Tiger sharks have a wide, blunt snout, which is often the most prominent feature in a photo.", "Tiger sharks have a large, triangular dorsal fin, which is usually visible when the shark is swimming."], "hammerhead shark": ["Hammerhead sharks have two dorsal fins, one on the back of the head and one on the back of the body.", "Hammerhead sharks have a unique eye placement, with eyes located on the sides of the head. This gives them a wide field of vision.", "Hammerhead sharks have a grayish-brown coloration, with a lighter underside."], "electric ray": ["They have two large, disc-like pectoral fins that are used for propulsion and maneuvering.", "Electric rays have two large, electric organs located on either side of their head. These organs are used to generate electric fields for hunting and defense.", "Electric rays have a dark brown or black coloration with white spots or stripes."], "stingray": ["The underside of the stingray is usually white or light-colored, while the top is darker.", "Stingrays often have a pattern of spots or stripes on their backs, which can be used to distinguish them from other species.", "Stingrays also have a pair of barbels near their mouths, which are used to detect prey."], "rooster": ["Roosters have a long, pointed tail and a large, curved beak.", "Roosters have brightly colored feathers, often with a metallic sheen. The most common colors are red, black, and white."], "hen": ["Hens have a distinctive coloration, with a range of colors from white to black, and often with speckles or stripes.", "Hens have a distinctive comb on the top of their head, which is usually red or pink.", "Hens have a distinctive wattle, which is a fleshy growth on the side of their head."], "ostrich": ["They have two toes on each foot, unlike other birds which have three or four.", "Ostriches have a distinctive black and white pattern on their feathers, with a white head and neck and black wings and tail.", "They also have a long, curved bill and a tuft of feathers on the back of their head."], "brambling": ["They have a brown back and wings, with white patches on the wings and tail.", "Bramblings have a bright yellow bill and legs, and a white rump.", "They have a long, forked tail, which is often held in a distinctive V-shape."], "goldfinch": ["They have a black cap on their head and a black face with white cheeks.", "Goldfinches have a short, conical bill and a forked tail.", "They often have a white patch on their wings and a white bar on their tail."], "house finch": ["They have a short, conical bill and a short, notched tail.", "House finches often have a black line running from the bill to the eye, and a black line running from the eye to the back of the head."], "junco": ["Juncos have a white belly and a gray back, with a white outer tail feather.", "Juncos have a short, conical bill and a short, rounded tail."], "indigo bunting": ["The females are more muted in color, with a brownish-gray head and wings, and a white belly.", "Both sexes have a white patch on the wings, which is visible when the bird is in flight."], "American robin": ["They have a white belly and a black head with a white eye-ring.", "They have a long, pointed beak and long legs.", "They have a white eye-ring and a black tail with white outer feathers."], "bulbul": ["They have a short, thick bill and a long tail.", "Bulbuls are usually brightly colored, with a combination of yellow, green, and black feathers.", "They have a distinctive call, which is a loud, melodious whistle."], "jay": ["Jays often have a distinctive crest of feathers on their head, which can be raised or lowered depending on the bird's mood.", "Jays have a long, pointed beak, which is used for cracking open nuts and seeds. They also have strong feet and claws, which they use to climb trees and branches."], "magpie": ["Magpies have long, pointed tails that are often held in a fan-like shape.", "Magpies have a distinctive call that is often described as a “chattering” sound."], "chickadee": ["Chickadees have a short, stubby bill and a round head.", "Chickadees have a white stripe above their eyes and a white line below their eyes.", "Chickadees have a white-edged tail that is often held upright when perched."], "American dipper": ["They have a short, stubby bill, and a short tail.", "American dippers are often seen bobbing up and down in the water, as they search for food."], "kite (bird of prey)": ["Kites have a hooked beak and sharp talons, which they use to catch their prey.", "Kites have a distinctive head shape, with a large, rounded crown and a small, hooked bill. They also have bright eyes, which can be seen from a distance."], "bald eagle": ["Bald eagles have a large, hooked beak and sharp talons.", "Bald eagles have a wingspan of up to 8 feet, making them one of the largest birds of prey."], "vulture": ["Vultures have long, curved beaks, which are well-suited for tearing apart carrion.", "Vultures have a distinctive hunched posture when perched, with their wings held outstretched and their heads tucked in."], "great grey owl": ["Great grey owls have a long, thick body with a large wingspan. They are usually a mottled grey or brown color, with lighter feathers on the underside.", "Great grey owls have a distinctive call, which is a deep, low-pitched hoot. This call is often"], "fire salamander": ["Fire salamanders have a flattened body shape, with a wide head and a long tail.", "Fire salamanders have four toes on each foot, and their toes are webbed. They also have a pair of external gills on either side of their head."], "smooth newt": ["They have a distinct color pattern, usually featuring a yellow or orange stripe running down the back and sides of the body.", "Smooth newts have a smooth, slimy skin, which is often a darker color than the rest of the body.", "They have small, black eyes and a pointed snout."], "eft": ["Efts have a flattened body shape, with a wide head and a long, slender tail.", "Efts have four legs, each with five toes, and two antennae on their heads."], "spotted salamander": ["Spotted salamanders have a long, slender body with four short legs and a long tail.", "Spotted salamanders have a wide, flat head with small eyes and a pointed snout."], "axolotl": ["They have a long, slender body with four legs and a long tail.", "Axolotls have a unique coloration, ranging from shades of brown, green, and black, to bright pink and yellow. They also have a pattern of spots or stripes on their body.", "Axolotls have feathery external gills that protrude from the sides of their head."], "American bullfrog": ["They have a distinctive green or brown coloration with dark spots or blotches on their back and sides.", "They have a large, wide mouth with a yellow or orange underside.", "They have webbed feet and long hind legs, which are used for jumping."], "tree frog": ["Tree frogs have large, bulging eyes and a wide, flat head.", "Tree frogs have long, slender legs and webbed feet, which they use to climb and cling to surfaces.", "Tree frogs often have a distinctive pattern of spots or stripes on their backs."], "tailed frog": ["Tailed frogs have a slim body shape and smooth skin, which is usually green or brown in color.", "Tailed frogs have large eyes and a wide mouth, which is used for catching prey. They also have webbed feet, which helps them swim."], "loggerhead sea turtle": ["They have a reddish-brown carapace (shell) with a yellowish-brown plastron (underside).", "The carapace is typically marked with five pairs of costal scutes (plates) and four pairs of marginal scutes (plates).", "The flippers are large and paddle-shaped, and the tail is long and pointed."], "leatherback sea turtle": ["The carapace is often marked with white or pink spots or streaks.", "Leatherback sea turtles have a long, pointed snout and paddle-like flippers.", "They also have a long, thick tail that is usually longer than the rest of their body."], "mud turtle": ["The underside of the shell is often lighter in color, ranging from yellow to orange.", "Mud turtles have short, webbed feet and a long, pointed tail. They also have a long neck and a small head with a hooked upper jaw."], "terrapin": ["Terrapins have webbed feet and long claws, which they use to climb and swim.", "Terrapins have a long neck and a pointed snout, which is often used to search for food."], "box turtle": ["Box turtles have a high-domed carapace (top shell) with a smooth texture. The carapace is usually brown or black in color, with yellow or orange markings.", "Box turtles have short, thick legs and a short tail. They also have a distinctive head shape, with a hooked upper jaw"], "banded gecko": ["Banded geckos have large, bulging eyes with vertical pupils.", "Banded geckos have a short, stubby tail that is usually the same color as the bands on their body."], "green iguana": ["They have a long, spiny tail, which can be used for defense and balance.", "They have a row of spines running down their back, which can be raised when threatened.", "They have a long, pointed snout and a row of sharp teeth.", "They have long, powerful legs and claws, which they use"], "Carolina anole": ["They have long, slender tails that are usually darker in color than the body.", "Carolina anoles have long, slender legs and toes that are adapted for climbing. They also have a long snout and large eyes."], "desert grassland whiptail lizard": ["They have a distinctive pattern of stripes or spots on their back, which can vary in color from yellow to brown.", "They have a pointed snout and large eyes, which are often bright yellow or orange.", "They have long, thin legs and toes, which help them move quickly across the desert terrain."], "agama": ["Agamas often have bright, colorful scales, ranging from shades of blue, green, yellow, and red.", "Agamas have a distinctive crest of spines running along their back and tail, which can be used to distinguish them from other lizards."], "frilled-necked lizard": ["They have a long, slender body with a long tail and short legs.", "They have a mottled pattern of brown, black, and yellow scales, which helps them blend in with their environment.", "They have a long, pointed snout and large eyes."], "alligator lizard": ["They have a distinctive pattern of dark spots and stripes on their back, which can be used to identify them.", "Alligator lizards have a row of spines running down their back, which can be seen when they are viewed from above.", "They have short legs and a long tail, which they use to help them move quickly and climb trees."], "Gila monster": ["Gila monsters have a thick, bulky body and short legs, making them appear slow and sluggish.", "Gila monsters have a long, forked tongue, which they use to detect scents in the air."], "European green lizard": ["They have a long, slender body with a pointed snout and a long tail.", "They have a row of spines running down their back, and a row of scales along their sides.", "They have a distinctive pattern of dark spots and stripes on their back and sides."], "chameleon": ["Chameleons have large, protruding eyes that can move independently of each other.", "Chameleons have a prehensile tail, which they use to grip onto branches and other surfaces.", "Chameleons are known for their ability to change color, which can be used to identify them in a photo."], "Komodo dragon": ["Komodo dragons have a long, forked tongue and a large, powerful head with a sharp, curved snout.", "They have short, strong legs with sharp claws, and a long, muscular tail. They also have a row of spines running down their back."], "Nile crocodile": ["They have a distinctive pattern of yellowish-green scales with darker cross-bands along their back and tail.", "They have webbed feet and long, powerful tails that are used for swimming and propelling themselves through the water."], "American alligator": ["The back of an American alligator is typically dark olive-brown or black, while the underside is lighter in color.", "American alligators have a row of large, sharp teeth along the upper jaw, which are visible when the mouth is closed."], "triceratops": ["They have a large frill on the back of their head, which is often decorated with spikes or ridges.", "Triceratops have a distinctive beak-like mouth and a large, bulky body with four short legs."], "worm snake": ["Worm snakes have small eyes and lack the vertical pupils of other snakes.", "Worm snakes have a single row of scales on their bellies, which distinguishes them from other snakes."], "ring-necked snake": ["The body of a ring-necked snake is usually slender and smooth, with a glossy sheen.", "The scales of a ring-necked snake are usually small and smooth, and the underside is usually yellow or orange."], "eastern hog-nosed snake": ["They have a distinctive pattern of dark blotches on a light background, which can be used to identify them.", "Eastern hog-nosed snakes have a unique defensive behavior of flattening their necks and hissing when threatened."], "smooth green snake": ["They are typically bright green in color, with a yellow or white underside.", "Smooth green snakes have smooth scales, which are usually arranged in a single row along the length of the body.", "They have a distinct head shape, with a pointed snout and large eyes."], "kingsnake": ["Kingsnakes have a distinct head shape, with a pointed snout and a narrow neck.", "Kingsnakes have a long, slender body, with a smooth, glossy texture. They are usually between 2-4 feet in length."], "garter snake": ["Garter snakes have a distinct head shape, with a pointed snout and a triangular-shaped head.", "Garter snakes have a forked tongue, which they use to sense their environment. This can be seen when the snake is flicking its tongue."], "water snake": ["They often have a pattern of dark spots or stripes along their back, which can be used to distinguish them from other types of snakes.", "Water snakes have a flattened head and a pointed snout, which is useful for burrowing into mud or sand.", "They also have a single row of scales on the underside of their body, which helps them move quickly through the water."], "vine snake": ["They often have a bright, colorful pattern along their body, usually consisting of alternating bands of black, yellow, and green.", "Vine snakes have a distinctive eye shape, with a vertical pupil and a round iris."], "night snake": ["They have a distinctive pattern of white or yellow spots along their back, which can be used to identify them.", "Night snakes have a small head and a long, thin tail, which can be used to distinguish them from other snakes."], "boa constrictor": ["Boa constrictors have a large, triangular head with a pointed snout.", "Boa constrictors have a long, thick body that can reach up to 13 feet in length."], "African rock python": ["They have a large head with a triangular shape and a long, thick body.", "African rock pythons have a yellowish-brown belly with dark spots.", "They have a long tail with a pointed tip."], "Indian cobra": ["Indian cobras have a yellow-brown or olive-brown coloration, with darker bands running along the length of their body.", "Indian cobras have a distinctively shaped head, with a narrow snout and large eyes."], "green mamba": ["They have a slender body and a long, thin tail.", "They have a narrow, triangular head with a black line running from the eye to the corner of the mouth.", "They have a yellow or white underside, which can be seen when they are in motion."], "sea snake": ["Sea snakes often have bright, vibrant colors, such as yellow, green, and blue.", "Sea snakes have paddle-like tails, which are used to propel them through the water.", "Sea snakes have small, narrow heads with short snouts, and their eyes are usually located on the top of their heads."], "Saharan horned viper": ["The body of the viper is usually a sandy brown color with darker brown or black markings.", "The viper has a distinctive diamond pattern along its back, with a light-colored center and darker edges.", "The viper has a long, thin tail that is usually coiled up."], "eastern diamondback rattlesnake": ["They have a large rattle at the end of their tail, which is used to make a loud buzzing sound when threatened.", "Eastern diamondback rattlesnakes have a wide triangular head, with two large eyes and a black line running from the eye to the corner of the mouth."], "sidewinder rattlesnake": ["They have a unique locomotion style, which involves moving in a sideways motion, hence the name.", "Sidewinder rattlesnakes have a rattle at the end of their tail, which is used to warn predators."], "trilobite": ["Trilobites have a segmented exoskeleton, which can be seen in the form of ridges and grooves along the body.", "Trilobites have two antennae protruding from the head, and two compound eyes on either side of the head."], "harvestman": ["They have two eyes located on the top of their head, and two antennae-like appendages that protrude from the front of their head.", "Harvestmen have a distinct body shape, with a small, round body and long, thin legs. They often have a dark coloration, with lighter spots or stripes."], "scorpion": [" Scorpions have eight legs, which are usually longer than their body.", " Scorpions have two large eyes on the front of their head, and several smaller eyes on the sides.", " Scorpions have a pair of long, curved stingers at the end of their tail."], "yellow garden spider": ["They have long, spindly legs that are usually held outstretched in a web.", "They have a bulbous abdomen with a distinct yellow and black pattern.", "They have a distinct yellow and black pattern on their cephalothorax.", "They have two large eyes on the front of their head."], "barn spider": ["They have long, spindly legs that are often held outstretched in a star-like pattern.", "Barn spiders have a unique web-building behavior, spinning large, circular webs with a zig-zag pattern in the center."], "European garden spider": ["They have long, spindly legs that are often held outstretched in a star-like pattern.", "They have a bulbous abdomen with a white or yellow stripe running down the center.", "They have a distinct pattern of white and black stripes on their cephalothorax."], "southern black widow": ["They have long, spindly legs that are usually black in color.", "Southern black widows have a glossy black body, which can sometimes appear to have a blue or purple sheen."], "tarantula": ["Tarantulas often have a hairy or fuzzy appearance, with some species exhibiting bright colors or patterns.", "Tarantulas have two large, forward-facing eyes, as well as several smaller eyes on the sides of their head."], "wolf spider": ["Wolf spiders have eight eyes arranged in three rows, with two large eyes in the center.", "Wolf spiders have long, spindly legs that are often covered in hairs. They also have two large pedipalps near their mouth, which are used to capture prey."], "tick": ["Ticks have a distinct head and body shape, with a hard, scaly outer shell.", "Ticks have a pair of long, thin antennae that protrude from the head. They also have a pair of short, curved mouthparts that they use to feed on their host."], "centipede": ["Centipedes have two antennae on their head, which they use to sense their environment.", "Centipedes have a pair of modified legs near their head, called forcipules, which they use to capture and inject venom into their prey."], "black grouse": ["They have a long, pointed tail and a short, rounded wingspan.", "The males have a bright red eye-ring and a yellowish-orange wattle on their neck.", "The females are generally browner in color, with a white throat and belly."], "ptarmigan": ["Ptarmigans have feathered feet, which helps them stay warm in cold climates.", "Ptarmigans have a short, rounded tail, which is often visible in photos.", "Ptarmigans have a distinctive red eye-ring, which is a key feature for identifying them."], "ruffed grouse": ["They have a short, rounded tail with a black band at the tip.", "Ruffed grouse have a distinctive fan-shaped crest on their head, which is usually raised when they are alarmed.", "They have a white patch on their throat and a white line on their wings."], "prairie grouse": ["Prairie grouse have a unique pattern of mottled brown and white feathers, which helps them blend in with their grassland habitat.", "Prairie grouse have a long, pointed tail with a white tip, which is often visible when they are in flight."], "peafowl": ["Peafowls have a distinctive crest of feathers on their heads. The male peacock's crest is usually more prominent and colorful than the female peahen's.", "Peafowls have long legs and necks, and their"], "quail": ["Quails have a distinctive pattern of black, brown, and white feathers.", "Quails have a short, curved bill and short legs.", "Quails have a distinctive crest of feathers on their head."], "partridge": ["They have a mottled brown and black plumage, with a white patch on their throat and chest.", "Partridges have a short, stout bill and short legs. They also have a distinctive crest of feathers on their head."], "african grey parrot": ["They have a black beak and yellow eyes.", "African grey parrots have a unique vocalization, which is often described as a “raspy” sound."], "macaw": ["Macaws have a distinct facial pattern, with a white or yellow patch around the eyes and a black or grey patch around the beak.", "Macaws have long, curved beaks, which are used for cracking nuts and seeds. They also have strong, curved claws, which they use"], "sulphur-crested cockatoo": ["They have a white body with a yellow wash on the wings and tail feathers.", "They have a black beak and black eyes, and their feet are grey.", "They have a loud, distinctive call that can be heard from a distance."], "lorikeet": ["They have a distinctive curved beak, which is usually black or dark grey.", "Lorikeets have a long, brush-tipped tongue, which they use to feed on nectar and pollen.", "They have a distinctive crest of feathers on their head, which can be raised or lowered depending on their mood."], "coucal": ["Coucals have a unique call that is often described as a “cou-cou” sound.", "They have a long, curved bill and yellow eyes. The bill is usually black or dark brown in color."], "bee eater": ["They have long, slender beaks, which they use to catch and eat bees and other insects.", "Bee eaters have long, pointed wings and a long, forked tail, which they use to maneuver in the air while hunting.", "They often have a distinctive crest of feathers on their head, which can be used to identify the species."], "hornbill": ["Hornbills have a prominent casque, or helmet-like structure, on the top of their beak. This casque can vary in size and shape depending on the species.", "Hornbills have long, curved wings and a long tail, making them easily distinguishable from other birds."], "hummingbird": ["Hummingbirds often have brightly colored feathers, ranging from iridescent blues and greens to reds and yellows.", "Hummingbirds are often seen hovering in mid-air, flapping their wings rapidly to stay in place."], "jacamar": ["Jacamars have a distinctive crest of feathers on the back of their head, which can be raised or lowered depending on their mood.", "They have long, slender wings and a short tail, and they often perch on branches or twigs with their wings slightly spread."], "toucan": ["Toucans have long, slender tails that are often brightly colored.", "Toucans have distinctive facial markings, with a black mask around the eyes and a white or yellow throat."], "duck": ["Ducks have webbed feet, which are useful for swimming and wading in water.", "Ducks have a unique feather pattern, often with a glossy sheen and a variety of colors.", "Ducks often have a distinctive tail shape, with a fan-like appearance when in flight."], "red-breasted merganser": ["They have a long, thin bill with a hooked tip.", "The males have a glossy green head and neck, with a white breast and belly.", "The females have a brown head and neck, with a white breast and belly.", "Both sexes have a black back and wings, with white stripes on the wings."], "goose": ["Geese have webbed feet, which are useful for swimming.", "Geese often have a white head and neck, with a darker body.", "Geese have a distinctive honking call, which can be heard in the background of a photo."], "black swan": ["Black swans have a long, curved neck and a distinctive red bill.", "Black swans have a long, graceful body and a large, powerful wingspan."], "tusker": ["Tuskers have large, round ears that are often held out to the sides.", "Tuskers have a thick, gray hide that is often wrinkled or creased. They also have a long, curved trunk that is used for grasping and manipulating objects."], "echidna": ["Echidnas have a long, pointed snout, which is used for digging and foraging for food.", "Echidnas have short, strong legs and long claws, which are used for digging and burrowing. They also have a long, thin tail."], "platypus": ["Platypuses have webbed feet, which are used for swimming and digging.", "Platypuses have a dense, waterproof fur coat that is usually brown or black in color.", "Platypuses have a tail that is flat and paddle-shaped, which is used for propulsion in the water."], "wallaby": ["Wallabies have a unique pattern of fur, often featuring stripes or spots.", "Wallabies have large, pointed ears and a pointed muzzle. They also have a distinctive, white stripe running down the length of their back."], "koala": ["They have a thick, grey-brown fur coat that is often lighter on the underside.", "Koalas have a large, fluffy tail that is usually white or cream in color.", "They have long, sharp claws that they use to climb trees."], "wombat": ["Wombats have a thick, coarse coat of fur that is usually gray or brown in color.", "Wombats have a short, stubby tail that is usually hidden beneath their fur.", "Wombats have a large, triangular head with small ears and a short, pointed snout."], "jellyfish": ["Jellyfish come in a variety of colors, from bright blues and purples to more muted hues.", "Jellyfish often have a transparent or semi-transparent body, allowing you to see the internal organs and structures."], "sea anemone": ["Sea anemones come in a variety of colors, ranging from bright pinks and purples to more muted browns and greens.", "Sea anemones often have a distinct pattern of concentric circles on their body, which can be used to identify them."], "brain coral": ["Brain corals are usually a bright, vibrant color, ranging from yellow to pink to purple.", "Brain corals often have a thick, fleshy texture, with a bumpy surface."], "flatworm": ["They often have a striped or mottled pattern on their bodies, which can be used to distinguish them from other worms.", "Flatworms have two eyespots on their heads, which can be used to identify them."], "nematode": ["Nematodes have a long, cylindrical body with a pointed head and tail.", "Nematodes have a distinct cuticle, or outer layer, which can be smooth or ridged.", "Nematodes have a distinct pattern of bristles, or setae, along their body. These bristles are used for locomotion and sensing the environment."], "conch": ["The exterior of the shell is often brightly colored, with patterns of stripes, spots, or swirls.", "The interior of the shell is usually white or cream-colored, and may have ridges or bumps along the surface."], "snail": ["Snails have two antennae protruding from their head, which are used for sensing their environment.", "Snails have a muscular foot which they use to move around. This foot is usually visible in photos, and is often a different color than the rest of the snail's body."], "slug": ["Slugs have two pairs of tentacles on their head, with the upper pair being longer than the lower pair.", "Slugs have a single, large foot that they use to move around. This foot is usually a darker color than the rest of the body.", "Slugs often have a distinct pattern of spots or stripes on their body."], "sea slug": ["Sea slugs have a distinct body shape, with a head and foot that tapers into a tail.", "Sea slugs often have a pair of antennae on their head, and some species have a pair of rhinophores, which are sensory organs used to detect chemicals in the water."], "chiton": ["The plates are often brightly colored and can range from shades of green, brown, and yellow.", "Chitons have a single foot that is used for locomotion and is visible when the animal is moving.", "Chitons also have a pair of tentacles near the head that are used for sensing their environment."], "chambered nautilus": ["The shell of a chambered nautilus is usually a creamy white color, with brown or black stripes radiating from the center.", "The shell of a chambered nautilus is usually quite large, with some species reaching up to 8 inches in"], "Dungeness crab": ["The carapace is usually a mottled brown color, with lighter patches on the sides.", "Dungeness crabs have five pairs of legs, with the front pair ending in large claws. The claws are usually a bright orange or red color."], "rock crab": ["Rock crabs have five pairs of legs, with the front pair ending in large claws.", "Rock crabs are usually a mottled brown or gray color, with some species exhibiting bright orange or red spots."], "fiddler crab": ["Fiddler crabs have a small, round body with a short, broad carapace.", "Fiddler crabs have two small eyes on the end of long stalks, which are usually visible in a photo.", "Fiddler crabs have four pairs of walking legs, which are usually visible in a photo."], "red king crab": ["They have five pairs of legs, with the first pair ending in large claws.", "Red king crabs have a wide, flat carapace, or shell, with a spiky texture.", "The eyes of a red king crab are located on the sides of its head, and are usually black or dark brown."], "American lobster": ["They have two large claws, one of which is typically larger than the other.", "American lobsters have five pairs of legs, with the first pair ending in claws.", "The tail of the American lobster is long and tapered, with a fan-like shape."], "spiny lobster": ["Spiny lobsters have two large antennae that are used for sensing their environment. These antennae are usually longer than the body of the lobster and can be seen protruding from the carapace.", "Spiny lobsters have five pairs of legs, with"], "crayfish": ["Crayfish have two large claws, which they use to defend themselves and capture prey.", "Crayfish have a hard exoskeleton, which is usually a mottled brown or green color.", "Crayfish have two antennae, which they use to sense their environment."], "hermit crab": ["Hermit crabs often have long, spindly legs and claws, which they use to grip onto surfaces and move around.", "Hermit crabs often have bright colors and patterns on their shells, which can help distinguish them from other crabs."], "isopod": ["Isopods have two antennae on their head and two pairs of antennae-like appendages on their abdomen.", "Isopods have two sets of eyes, one on each side of their head.", "Isopods have a hard exoskeleton that is usually brown or gray in color."], "white stork": ["They have a white body with black wings and tail feathers.", "They have long, red legs and a long neck.", "They have a distinctive black and white pattern on their heads.", "They have a large wingspan, usually around 1.5 meters."], "black stork": ["They have long, red legs and a long, curved neck.", "The black stork has a distinctive crest of feathers on its head, which can be seen when it is in flight.", "The black stork has a white patch on its wings, which can be seen when it is in flight."], "spoonbill": ["Spoonbills have long legs and a long neck, which they often stretch out when foraging in shallow water.", "Spoonbills have a white body with black wings and tail feathers, and a black crest on their head."], "flamingo": ["They have a unique pink or reddish-orange coloration, which is caused by their diet of carotenoid-rich foods.", "Flamingos have a distinctive bill shape, with a downward-curving upper mandible and a slightly upturned lower mandible.", "They often stand on one leg, with the other tucked up against their body."], "little blue heron": ["They have long, thin legs and a long, pointed bill.", "They often stand in a hunched posture, with their neck tucked in and their wings slightly raised.", "They have a white stripe running down the center of their back, and a white patch on their wings."], "great egret": ["They have a white plumage with black legs and feet.", "Great egrets have a distinctive crest of long, white feathers on the back of their head.", "They have a long, broad wingspan and a long tail."], "bittern bird": ["Bitterns have a mottled brown and black plumage, which helps them blend in with their marshy habitats.", "Bitterns have a long neck and a short tail, which is often held upright when the bird is in flight.", "Bitterns have a distinctive call, which is a loud, booming \"boom-boom\" sound."], "crane bird": [" They have a long, pointed wingspan and a V-shaped flight pattern.", " Cranes have a distinctive call, which is often loud and carries over long distances.", " They have a unique feather pattern, with a white head and neck, and a black or grey body."], "limpkin": ["They have a distinctive white stripe that runs down the center of their head and neck.", "Limpkins have a long, slender neck and a long, thin tail.", "They have a mottled brown and white plumage, with a white belly and chest."], "common gallinule": ["They have a black head and neck, with a white patch on the forehead.", "The body is grayish-brown, with white and black barring on the wings and tail.", "The legs are long and yellow, and the feet are webbed."], "American coot": ["They have a short, thick, white-tipped tail, and their wings are short and rounded.", "American coots have a white patch on the side of their body, and their legs are bright yellow."], "bustard": ["Bustards have a distinctive pattern of mottled brown and white feathers, which can be seen in a photo.", "Bustards have a large, rounded head with a short, thick bill. They also have a long, pointed tail, which is often held upright when the bird is in flight."], "ruddy turnstone": ["They have a bright orange-red head and breast, with a white belly.", "They have a short, stout bill and short legs, and they often walk with a distinctive bobbing motion.", "They have a black tail with white edges, and their wings have a white patch near the tips."], "dunlin": ["They have a short, straight bill and a short, dark tail.", "Dunlins have a distinctive pattern of black and white stripes on their wings, which can be seen when they are in flight."], "common redshank": ["They have a long, straight bill that is usually orange-red in color.", "Common redshanks have long, red legs and a white rump. They also have a white stripe running along the back of their neck."], "dowitcher": ["Dowitchers have a distinctive pattern of mottled brown and white feathers on their backs and wings.", "Dowitchers have long legs and webbed feet, which they use to probe the mud for food.", "Dowitchers have a distinctive, rapid, up-and-down feeding motion, which is often visible when they are foraging."], "oystercatcher": ["They have a long, pointed bill which is used to pry open molluscs and other shellfish.", "Oystercatchers often have a bright red eye-ring, which is a distinguishing feature.", "They have long, pink legs and webbed feet, which are useful for wading in shallow water."], "pelican": ["Pelicans have long, broad wings and a large body. They often stand with their wings slightly spread out, giving them a distinctive silhouette.", "Pelicans have a long neck and a large head with a prominent crest. They also have webbed feet, which are often visible when they are standing in water."], "king penguin": ["King penguins have a distinctive black and white pattern on their heads, with a white face and black chin.", "King penguins have a long, thin, yellow-orange beak, and a bright yellow patch on their chest. They also have a distinctive black and white pattern on their feet."], "albatross": ["Albatrosses have long, slender necks and large, hooked bills. The bill is usually yellow or orange with a black tip.", "Albatrosses have long, webbed feet that are used for swimming and walking. They also have long, pointed tails."], "grey whale": ["Grey whales have a long, slender body with a small dorsal fin near the tail.", "Grey whales have a unique head shape, with a prominent, curved jaw and a small, triangular blowhole."], "killer whale": ["They have a large, curved dorsal fin that is taller than any other species of whale.", "Killer whales have a distinct white eye patch, which is a unique feature among cetaceans.", "They have a large, pointed head and a wide, triangular-shaped fluke."], "dugong": ["Dugongs have a distinctive, rounded head with a short snout and small eyes.", "Dugongs have two pairs of flippers, which they use to move through the water.", "Dugongs have a thick, grayish-brown skin, which is often covered in algae."], "sea lion": ["They have long, thick bodies with short, flipper-like front limbs and webbed hind feet.", "Sea lions have a thick, coarse coat of fur that is usually brown or gray in color.", "Sea lions often have a distinctive, long, pointed muzzle and whiskers."], "Chihuahua": ["Chihuahuas have a distinctive apple-shaped head, with large, round eyes and a short muzzle.", "Chihuahuas have a long, silky coat that can be either short or long, and can come in a variety of colors.", "Chihuahuas have a unique, high-pitched bark that is easily recognizable."], "Japanese Chin": ["They have a long, silky coat that is usually white with black or red markings.", "They have a distinctive topknot of fur on their head, which is often black or red.", "They have a short, square body with a deep chest and a short, thick tail."], "Maltese": ["They have a black nose and dark eyes, and their ears are usually covered in long fur.", "Maltese have a unique, round face with a short muzzle and a black nose.", "They have a long, plumed tail that is usually carried over their back."], "Pekingese": ["They have a long, thick coat of fur that is usually straight and can come in a variety of colors.", "Pekingese have a distinctive mane of fur around their neck and chest, which is often more pronounced in males.", "They have short legs and a long body, giving them a low-to-the-ground appearance."], "Shih Tzu": ["They have a short muzzle and a flat face, with large, round eyes and a black nose.", "Shih Tzus have a long, flowing mane around their neck and chest, and a long, fluffy tail that curls over their back."], "King Charles Spaniel": ["They have a short muzzle and a domed head, with large, round eyes and long, floppy ears.", "King Charles Spaniels have a long, feathered tail that is usually carried over the back."], "Papillon": ["Papillons have a long, silky coat that is usually white with patches of color. The most common colors are black, tan, and sable.", "Papillons have a long, plumed tail that is usually carried over the back."], "toy terrier": ["They have a distinctive face with a short muzzle, large eyes, and erect ears.", "Toy terriers have a thick, double coat of fur that is usually white with black, tan, or brown markings."], "Rhodesian Ridgeback": ["They have a muscular, athletic build with a deep chest and strong legs.", "They have a short, dense coat that is usually red wheaten in color.", "They have a long, pointed muzzle and large, round eyes."], "Afghan Hound": ["They have a long, narrow head with a pointed muzzle and large, expressive eyes.", "Afghan Hounds have a unique gait, with a high-stepping, bouncy stride that is often described as a “flying trot.”", "They have a long, curved tail that is usually carried high and is often adorned with a plume of"], "Basset Hound": ["They have a short, stocky body with short legs and a long, curved tail.", "They have a distinctive facial expression with a wrinkled forehead and a sad, droopy expression.", "They have a short, smooth coat that is usually tan and white or black and white in color."], "Beagle": ["Beagles have long, droopy ears that hang down to the sides of their face.", "Beagles have a short, stubby tail that is usually carried high and curved over their back.", "Beagles have a distinctive facial expression, with a wide, friendly smile and large, expressive eyes."], "Bloodhound": ["Bloodhounds have a unique, loose skin that hangs from their face and neck, giving them a distinctive look.", "Bloodhounds have a long, thick coat of fur that is usually a reddish-brown or black color. They also have a long, bushy tail."], "Bluetick Coonhound": ["They have a long, muscular body and a large, domed head.", "Bluetick Coonhounds have long, pendulous ears that hang down to the sides of their face.", "They have a long, bushy tail that is carried low and often has a white tip."], "Black and Tan Coonhound": ["They have a long, droopy ears and a long muzzle.", "They have a deep, loud bark and a long, bushy tail."], "Treeing Walker Coonhound": ["They have a long, muscular body and a long, tapered tail.", "They have long, droopy ears that hang down to the sides of their face.", "They have a deep, loud bark that is often used to track and tree raccoons."], "English foxhound": ["They have a short, dense coat that is usually white with black, tan, or red markings.", "They have long, drooping ears and a long, bushy tail.", "They have a strong, muscular body and a long, graceful stride."], "Redbone Coonhound": ["They have a long, muscular body and a deep chest.", "They have long, drooping ears and a long, thin muzzle.", "They have a long, bushy tail that is usually carried low."], "borzoi": ["They have a thick, silky coat that is usually white, gray, or black in color.", "Borzois have a long, flowing tail that is often carried low and curved.", "They have long, slender legs and a deep chest."], "Irish Wolfhound": ["Irish Wolfhounds have a long, shaggy coat that is usually gray, brindle, black, or white.", "Irish Wolfhounds have a long, narrow head with a distinctive Roman nose and long, drooping ears. They also have a deep chest and long, muscular legs."], "Italian Greyhound": ["They have a short, fine coat that is usually grey, black, or fawn in color.", "They have long, thin legs and a long, slender tail that tapers to a point.", "They have large, dark eyes and long, pointed ears that stand erect."], "Whippet": ["They have a short, smooth coat that is usually white with black, gray, or brindle markings.", "Whippets have long, slender legs and a deep chest, and their tail is usually carried low."], "Ibizan Hound": ["They have a short, smooth coat that is usually white or cream in color, with some having red or tan markings.", "Ibizan Hounds have large, erect ears that are set high on the head and have a distinctive, curved shape.", "They have a long, slender muzzle and a slightly domed head."], "Norwegian Elkhound": ["They have a wedge-shaped head with a black mask and a black muzzle.", "They have a thick, bushy tail that is usually carried over the back.", "They have a muscular body and strong legs, with a deep chest and a broad back."], "Otterhound": ["They have a large, domed head with a long muzzle and drooping ears.", "Otterhounds have a unique, webbed feet that help them swim and hunt in water.", "They have a long, thick tail that is usually carried low."], "Saluki": ["They have a deep chest and a long, curved tail that is usually carried low.", "Salukis have a unique, silky coat that is usually white, cream, fawn, or red in color. They may also have black markings on their face, ears, and tail."], "Scottish Deerhound": ["They have a long, wiry coat that is usually gray or blue-gray in color.", "They have a long, narrow head with a long muzzle and a distinctive black nose.", "They have long, pointed ears that hang down close to the head.", "They have a long, bushy tail that is usually carried low."], "Weimaraner": ["Weimaraners have a long, muscular body and a short, smooth coat.", "Weimaraners have a unique facial structure, with a long muzzle, large eyes, and pointed ears. They also have a distinctive, long tail that is usually carried low."], "Staffordshire Bull Terrier": ["They have a broad, muscular head with a short muzzle and a black nose.", "They have a strong, muscular body with a deep chest and a short, thick tail.", "They have short, strong legs and a wide, powerful jaw."], "American Staffordshire Terrier": ["They have a broad, muscular head with a short muzzle and a black nose.", "They have a strong, muscular body with a deep chest and a wide, powerful jaw.", "They have a short, thick tail that is usually docked.", "They have small, triangular ears that are usually cropped."], "Bedlington Terrier": ["They have a long, narrow muzzle and small, triangular ears that are set high on the head.", "Bedlington Terriers have a distinctive, curly tail that is usually carried high and is often described as a \"plume\"."], "Border Terrier": ["They have a distinctive head shape, with a broad skull and a short muzzle.", "They have small, V-shaped ears that are set high on the head.", "They have a long, low-set tail that is usually carried horizontally."], "Kerry Blue Terrier": ["They have a long, pointed muzzle and a long, feathered tail.", "They have a distinctive head shape, with a flat skull and a pronounced stop between the eyes.", "They have a thick, wiry coat that is usually trimmed short around the face and legs."], "Irish Terrier": ["They have a long muzzle and a distinctive black nose.", "Irish Terriers have a long, straight tail that is usually carried high.", "They have a strong, muscular body and a proud, alert stance."], "Norfolk Terrier": ["They have a double coat of wiry fur, with a soft undercoat and a coarse outer coat. The fur is usually black and tan, but can also be red, wheaten, or grizzle.", "Norfolk Terriers have a short, sturdy body and a tail that is usually docked. They have short legs and a deep chest."], "Norwich Terrier": ["They have a short, square muzzle and a black nose.", "They have small, V-shaped ears that are set high on the head.", "They have a short, sturdy body and a tail that is usually docked.", "They have a distinctive, scruffy beard and eyebrows."], "Yorkshire Terrier": ["They have a long, straight muzzle and a small, pointed nose.", "They have small, erect ears and a long, flowing tail.", "They have a small, compact body and short legs."], "Wire Fox Terrier": ["They have a long muzzle and a pointed nose, with a black nose and dark eyes.", "They have a long, bushy tail that is usually carried high and is often curved over the back.", "They have long, thin legs and a lean body, with a distinctive fox-like head."], "Lakeland Terrier": ["They have a square-shaped body with a broad chest and a short, strong back.", "Lakeland Terriers have a distinctive head shape, with a flat skull, a short muzzle, and a black nose.", "They have small, V-shaped ears that are set high on the head.", "Lakeland Terriers have a"], "Sealyham Terrier": ["They have a short, square muzzle and a black nose.", "Sealyham Terriers have a long, bushy tail that is usually carried high.", "They have small, triangular ears that are set high on the head."], "Airedale Terrier": ["They have a long muzzle and a strong jaw, with a black nose and dark eyes.", "They have a long, bushy tail that is usually carried high and is often wagged when excited.", "They have a thick, muscular neck and broad chest, with long legs and a deep chest."], "Cairn Terrier": ["They have a broad, flat head with a short muzzle and small, dark eyes.", "Cairn Terriers have a short, sturdy body with short legs and a tail that is usually carried high. They have a shaggy, unkempt appearance."], "Australian Terrier": ["They have a long, narrow head with a pointed muzzle and erect ears.", "They have a strong, muscular body and a long, straight tail.", "They have a unique, shaggy beard and eyebrows, which are often darker than the rest of their coat."], "Dandie Dinmont Terrier": ["They have a long, low body with short legs and a long tail.", "They have a double coat of fur, with a soft, wavy outer coat and a dense, soft undercoat.", "They have a distinctive face with a short muzzle, large eyes, and long, drooping ears."], "Boston Terrier": ["They have a short, square-shaped head with erect ears and a short, wide muzzle.", "They have a short, smooth coat and a tail that is usually docked.", "They have a distinctive, wide-eyed expression and a friendly, alert demeanor."], "Miniature Schnauzer": ["They have a long, bushy beard and eyebrows, and a long, bushy tail that is usually docked.", "Miniature Schnauzers have a square-shaped head with a long muzzle and a distinctive underbite. They also have small, erect ears that are set high on the head."], "Giant Schnauzer": ["They have a thick, bushy beard and eyebrows, as well as a long, shaggy coat on their legs and chest.", "Giant Schnauzers have a long, rectangular head with a strong muzzle and a distinctive beard. They also have a high-set tail that is usually docked."], "Standard Schnauzer": ["They have a long, bushy beard and eyebrows, and a long, thick mustache.", "Standard Schnauzers have a square-shaped head with a long muzzle and a strong jaw. They have a distinctive, alert expression.", "They have a muscular body with a deep chest and a long, straight tail."], "Scottish Terrier": ["They have a distinctive beard and eyebrows, which are often darker than the rest of the coat.", "They have a short, sturdy body and a long, tapered tail.", "They have short, strong legs and a broad, flat head with a black nose."], "Tibetan Terrier": ["Tibetan Terriers have a unique head shape, with a flat skull, a short muzzle, and a black nose.", "Tibetan Terriers have a long, plumed tail that is usually carried over the back. They also have a unique facial expression, with a slightly sad, soulful look."], "Australian Silky Terrier": ["They have a small, wedge-shaped head with a short muzzle and dark eyes.", "They have a long, low-set tail that is usually carried in a slight curve.", "They have small, pointed ears that are set high on the head."], "Soft-coated Wheaten Terrier": ["They have a long, silky coat that is usually parted down the middle of the back.", "They have a long, straight muzzle and a black nose.", "They have dark, almond-shaped eyes and long, floppy ears.", "They have a long, feathered tail that is usually carried low."], "West Highland White Terrier": ["They have a short muzzle and a black nose.", "They have small, triangular ears that stand erect.", "They have a long, fluffy tail that is usually carried over their back.", "They have a double coat, with a soft, dense undercoat and a wiry, weather-resistant outer coat."], "Lhasa Apso": ["They have a distinctive topknot of fur on their head, which is often a different color than the rest of their coat.", "Lhasa Apsos have a long, shaggy muzzle and a short, curled tail. They also have a distinctive, alert expression with large, dark eyes."], "Flat-Coated Retriever": ["They have a distinctive head shape, with a broad skull and a long muzzle.", "They have a long, straight tail that is usually carried low.", "They have a strong, muscular body and a proud, alert stance."], "Curly-coated Retriever": ["They have a long, narrow head with a muzzle that tapers to a point.", "They have long, strong legs and a deep chest.", "They have a long, feathered tail that is usually carried low."], "Golden Retriever": ["They have a broad head with a black nose and dark eyes.", "They have a long, feathered tail that is usually carried low.", "They have long, strong legs and webbed feet, which make them excellent swimmers."], "Labrador Retriever": ["They have a thick, double coat of fur that is usually black, yellow, or chocolate in color.", "Labrador Retrievers have a strong, muscular body and a tail that is usually thick and tapered."], "Chesapeake Bay Retriever": ["They have a broad head with a deep muzzle and a strong jaw.", "They have a distinctive otter-like tail that is thick at the base and tapers to a point.", "They have webbed feet, which helps them swim and retrieve objects from the water."], "German Shorthaired Pointer": ["They have a long, muscular body and a short, sleek coat.", "German Shorthaired Pointers have a distinctive head shape, with a long muzzle, large ears, and a broad forehead.", "They have a long, feathered tail that is usually carried in a downward position."], "Vizsla": ["They have a long, slender muzzle and pointed ears.", "They have a muscular body and a tail that is usually docked.", "They have a unique facial expression, with a gentle, intelligent expression in their eyes."], "English Setter": ["They have a distinctive head shape with a long muzzle and a domed forehead.", "They have long, feathered ears that hang down close to the cheeks.", "They have a long, feathered tail that is usually carried low."], "Irish Setter": ["They have a long, feathered tail that is usually carried low.", "Irish Setters have a distinctive head shape, with a long muzzle and a flat skull.", "They have long, thin legs and a deep chest."], "Gordon Setter": ["They have a distinctive long, feathered tail that is carried low.", "They have a broad, flat head with a long muzzle and dark eyes.", "They have long, muscular legs and a deep chest."], "Brittany dog": ["They have a medium-length, single-layered coat that is usually white with orange or liver-colored markings.", "Brittany dogs have long, feathered ears that hang down close to their cheeks and a long, feathered tail that curves slightly at the end."], "Clumber Spaniel": ["They have a long, silky coat that is usually white with orange or lemon markings.", "Clumber Spaniels have a unique facial expression, with a broad, flat head and a short muzzle. They also have a distinctive, drooping mustache and eyebrows."], "English Springer Spaniel": ["They have a long, feathered tail that is usually carried low.", "They have a long muzzle and ears that hang down close to the cheeks.", "They have a friendly, alert expression with dark, round eyes."], "Welsh Springer Spaniel": ["They have a long, feathered tail that is usually carried low.", "Welsh Springer Spaniels have a broad head with a short muzzle and a black nose. They have dark, almond-shaped eyes and long, floppy ears."], "Cocker Spaniel": ["They have a long, feathered tail that is usually carried low.", "Cocker Spaniels have a characteristic \"drop\" ear, which is long and hangs down the side of the head.", "They have a short muzzle and a round, expressive face."], "Sussex Spaniel": ["They have a long, low-set tail that is usually docked.", "They have a broad, flat head with a short muzzle and large, round eyes.", "They have long, drooping ears that hang close to the head.", "They have a deep chest and a strong, muscular body."], "Irish Water Spaniel": ["They have a long, shaggy coat that is usually slightly darker on the back and lighter on the chest and belly.", "Irish Water Spaniels have a distinctive topknot of long, curly hair on their head.", "They have a long, feathered tail that is usually carried in a loose curl over the back.", "Irish Water Spaniels have webbed feet, which helps"], "Kuvasz": ["Kuvasz have a large, broad head with a black nose and dark eyes.", "Kuvasz have a muscular body and a long, thick tail that is usually carried low.", "Kuvasz have a distinctive gait, with a long stride and a proud, upright posture."], "Schipperke": ["Schipperkes have a fox-like face with a pointed muzzle, erect ears, and almond-shaped eyes.", "Schipperkes have a unique tail that is carried high and curled over the back."], "Groenendael dog": ["They have a distinctive wolf-like face with a pointed muzzle and erect ears.", "They have a long, bushy tail that is usually carried low.", "They have a muscular body with a deep chest and strong legs."], "Malinois": ["They have a square-shaped head with a black muzzle and a black nose.", "They have a muscular body with a deep chest and a long, straight tail.", "They have a distinctive gait, with a high-stepping, prancing motion."], "Briard": ["Briards have a large, square head with a long muzzle and floppy ears.", "Briards have a long, thick tail that is usually carried low."], "Australian Kelpie": ["They have a pointed muzzle and erect ears, and their eyes are usually bright and alert.", "They have a long, bushy tail that is usually carried low and is often used to express their emotions."], "Komondor": ["Komondors have a large, muscular body and a broad, flat head. They have a long muzzle and a black nose.", "Komondors have a distinctive tail that is carried low and curls up at the end. They also have long, drooping ears that are covered in fur."], "Old English Sheepdog": ["They have a long, bushy tail that is often curled over their back.", "Old English Sheepdogs have a large, square head with a broad muzzle and long, drooping ears.", "They have a thick, muscular body and short legs."], "Shetland Sheepdog": ["They have a long, pointed muzzle and ears that stand erect.", "Shetland Sheepdogs have a thick, bushy tail that is usually carried low.", "They have a distinctive, intelligent expression in their eyes."], "collie": ["Collies have a long, pointed muzzle and a thick, bushy tail.", "Collies have a unique facial expression, with large, alert eyes and ears that are usually erect."], "Border Collie": ["They have a medium-length double coat, with a thick, soft undercoat and a longer, coarser outer coat.", "Border Collies have a pointed muzzle and ears that stand erect. They have a keen, alert expression and bright, intelligent eyes."], "Bouvier des Flandres dog": ["They have a large, square head with a broad muzzle and a black nose.", "They have a long, thick tail that is usually carried low.", "They have a muscular body and a proud, alert stance."], "Rottweiler": ["Rottweilers have a broad, muscular head with a black muzzle and a black nose.", "Rottweilers have a deep chest and a strong, straight back.", "Rottweilers have a thick, muscular neck and a long, docked tail."], "German Shepherd Dog": ["They have a strong, muscular body and a long, bushy tail.", "German Shepherds often have a black and tan coat, with a black saddle and tan legs, chest, and muzzle."], "Dobermann": ["They have a distinctive black and tan coat, with tan markings on the face, chest, and legs.", "Dobermanns have a short, smooth coat and erect ears. They also have a docked tail, which is a signature feature of the breed."], "Miniature Pinscher": ["They have a long, slender muzzle and a short, docked tail.", "Miniature Pinschers have a unique gait, with a high-stepping, prancing motion."], "Greater Swiss Mountain Dog": ["They have a broad, flat head with a black muzzle and a distinctive black mask around the eyes.", "They have a muscular body with a deep chest and a long, bushy tail that is usually carried low.", "They have large, round feet with thick, webbed toes, which help them traverse snowy terrain."], "Bernese Mountain Dog": ["They have a distinctive white blaze on their face, as well as white markings on their chest, legs, and muzzle.", "Bernese Mountain Dogs have a large, muscular body and a long, bushy tail. They also have a distinctive tri-colored face, with a black muzzle, white blaze, and rust-colored cheeks."], "Appenzeller Sennenhund": ["They have a long, thick coat with a distinctive mane around the neck and chest.", "Appenzeller Sennenhunds have a broad, square head with a short muzzle and dark eyes.", "They have a muscular body with a deep chest and strong legs."], "Entlebucher Sennenhund": ["They have a short, square muzzle and a broad head with a rounded forehead.", "They have a thick, muscular neck and a deep chest.", "They have a long, bushy tail that is usually carried low.", "They have short, strong legs and webbed feet, which make them excellent swimmers."], "Boxer": ["Boxers have a short, smooth coat that is usually fawn or brindle in color.", "Boxers have a muscular body with a deep chest and strong legs. They also have a distinctive tail that is usually docked."], "Bullmastiff": ["They have a short, dense coat that is usually fawn, brindle, or red in color.", "Bullmastiffs have a distinctive black mask around their eyes and muzzle.", "They have a deep chest and strong, straight legs."], "Tibetan Mastiff": ["They have a large, broad head with a distinctive mane around the neck and shoulders.", "Tibetan Mastiffs have a muscular body and a long, bushy tail that curls over their back.", "They have a deep, loud bark and are known for their alertness and loyalty."], "French Bulldog": ["French Bulldogs have a short, stocky body with a wide chest and a short, square-shaped head.", "French Bulldogs have a unique set of ears that stand erect and are often described as \"bat ears\".", "French Bulldogs have a short, smooth coat that is usually brindle, fawn, or white in color."], "Great Dane": ["They have a short, smooth coat that is usually black, blue, fawn, or brindle.", "Great Danes have a long, narrow head with a deep muzzle and a black nose.", "They have large, floppy ears that hang down on either side of their head.", "Great Danes have a long, muscular neck and a deep chest."], "St. Bernard": ["St. Bernards have a large, broad head with a short muzzle and droopy ears.", "St. Bernards have a long, thick tail that is usually carried low. They also have a distinctive black and white collar around their neck."], "husky": ["Huskies have a distinctive facial mask, with a white blaze between the eyes and a black or brown muzzle.", "Huskies have erect ears, almond-shaped eyes, and a thick, bushy tail that curls over their back."], "Alaskan Malamute": ["They have a broad, wedge-shaped head with a wide muzzle and small, triangular ears.", "Alaskan Malamutes have a thick, bushy tail that is usually carried over the back.", "They have a strong, muscular body and a thick neck."], "Siberian Husky": ["They have a distinctive facial mask, with a white blaze between the eyes and a white muzzle.", "Siberian Huskies have erect ears and almond-shaped eyes, which can be blue, brown, or a combination of both.", "They have a thick, bushy tail that curls over their back."], "Dalmatian": ["Dalmatians have a short, dense coat of fur that is usually white with black or brown spots.", "Dalmatians have a long, muscular body with a deep chest and long legs. They also have a long, tapered tail and pointed ears."], "Affenpinscher": ["They have a short muzzle and a wide, flat head with a prominent forehead.", "Affenpinschers have a unique, monkey-like expression, with bright, alert eyes and ears that are usually cropped.", "They have a long, bushy tail that is usually carried high."], "Basenji": ["Basenjis have a unique wrinkled forehead and a tightly curled tail.", "Basenjis have a distinctive barkless vocalization, which is often described as a yodel."], "pug": ["They have a short, curly tail and a broad chest.", "Pugs have a unique gait, with their hind legs moving in a straight line and their front legs moving in a circular motion.", "They have a short, smooth coat of fur that is usually fawn or black in color."], "Leonberger": ["Leonbergers have a black mask on their face, with a black nose and dark eyes.", "They have a thick, bushy tail that is usually carried low.", "Leonbergers have a unique gait, with a slow, rolling trot."], "Newfoundland dog": ["They have a large, broad head with a wide muzzle and a black nose.", "They have a deep chest and a strong, muscular body.", "They have webbed feet, which makes them excellent swimmers.", "They have a long, thick tail that is usually carried low."], "Great Pyrenees dog": ["They have a large, broad head with a black nose and dark eyes.", "They have a long, thick tail that is usually carried low.", "They have a muscular body with a deep chest and strong legs."], "Samoyed": ["Samoyeds have a distinctive fox-like face, with a black nose, almond-shaped eyes, and erect ears.", "Samoyeds have a thick, fluffy tail that curls over their back, and a thick mane around their neck."], "Pomeranian": ["They have a fox-like face with a short muzzle, small ears, and dark, almond-shaped eyes.", "Pomeranians have a thick, double coat with a soft, dense undercoat and a longer, coarser outer coat. They also have a long, fluffy tail that curls over their back."], "Chow Chow": ["They have a thick double coat of fur, with a dense undercoat and a longer, coarser outer coat. The fur is usually reddish-brown, black, or cream in color.", "Chow Chows have a distinctive curled tail, which is usually carried over the back. They also have a unique \"blue\""], "Keeshond": ["Keeshonds have a distinctive fox-like face with a black mask around the eyes and muzzle.", "Keeshonds have a thick, fluffy tail that curls over their back.", "Keeshonds have a distinctive ruff of fur around their neck."], "brussels griffon": ["They have large, round eyes that are usually dark in color.", "They have a thick, wiry coat that is usually black, tan, or reddish-brown in color.", "They have a short, stubby tail that is usually carried upright."], "Pembroke Welsh Corgi": ["They have a short, thick coat of fur that is usually red, sable, fawn, or black and tan in color.", "They have a long, low body with short legs and a long, thick tail."], "Cardigan Welsh Corgi": ["They have a double coat of fur, with a thick, coarse outer coat and a soft, dense undercoat.", "Cardigan Welsh Corgis have a distinctive fox-like face with large, pointed ears and a short muzzle.", "They have a deep chest and a long, low-set tail.", "Cardigan Welsh Corgis have a unique herding stance"], "Toy Poodle": ["Toy Poodles have a long muzzle and a short, square-shaped head.", "Toy Poodles have a long, fluffy tail that is usually carried high.", "Toy Poodles have a variety of coat colors, including black, white, cream, apricot, and silver."], "Miniature Poodle": ["They have a long muzzle and a high-set tail that is usually docked.", "Miniature Poodles have a characteristic \"poodle clip\" which includes shaved legs, feet, and tail, and a topknot of fur on the head."], "Standard Poodle": ["Standard Poodles have a long muzzle and a high-set tail.", "Standard Poodles have a distinctive topknot of fur on their head, which is often tied up in a bow."], "Mexican hairless dog (xoloitzcuintli)": ["Xoloitzcuintlis have a distinctive wedge-shaped head with large, erect ears.", "They have a long, slender muzzle and a deep chest. Their eyes are almond-shaped and dark.", "Xoloitzcuintlis have a long, thin tail that is usually carried low."], "grey wolf": ["They have a long, bushy tail, which is usually black-tipped.", "Grey wolves have large, pointed ears and a long muzzle.", "They have a thick, double-layered coat, which helps them stay warm in cold climates."], "Alaskan tundra wolf": ["They have a broad, triangular head with a pointed muzzle and large, pointed ears.", "They have a long, bushy tail that is usually white or gray in color.", "They have a thick, muscular neck and broad chest.", "They have long, powerful legs and large paws."], "red wolf or maned wolf": ["Maned wolves have a distinctive black mane running down their back and a white-tipped tail.", "Both species have long, pointed ears and a slender muzzle."], "coyote": ["They have a long, bushy tail that is usually tipped with black fur.", "Coyotes have a light gray or tan coat with darker patches on their back and sides.", "They have a white or cream-colored chest and belly."], "dingo": ["They have a long, bushy tail and pointed ears.", "Dingoes have a lean, muscular body and long legs, making them appear taller than other canines."], "dhole": ["They have a long, bushy tail that is usually held low to the ground.", "Dholes have a long, slender muzzle and pointed ears, which are often held erect.", "They have long, powerful legs and large paws, which are adapted for running and climbing."], "African wild dog": ["They have large, rounded ears and a long muzzle.", "African wild dogs have long legs and a long, bushy tail.", "They have four toes on each foot, with the middle two toes being the longest."], "hyena": ["They have powerful jaws and sharp teeth, which are often visible when they open their mouths.", "Hyenas have a unique, striped pattern on their fur, which can be used to distinguish them from other animals.", "They also have a long, bushy tail and short, rounded ears."], "red fox": ["They have a long, bushy tail with a white tip, which is often used as a distinguishing feature.", "Red foxes have pointed ears and a black nose, and their muzzle is usually white. They also have black markings around their eyes."], "kit fox": ["They have a sandy-colored coat with a white underside and a black-tipped tail.", "Kit foxes are relatively small, with an average body length of about two feet and a weight of around five pounds."], "Arctic fox": ["They have a short muzzle and small ears, which helps them conserve heat in cold climates.", "Arctic foxes have a distinctive bushy tail, which is usually white or gray in color."], "grey fox": ["They have a pointed muzzle and large, pointed ears.", "Grey foxes have a unique, black-tipped tail that is often held in a curved position.", "They have a slender body and long legs, which makes them well-suited for climbing trees."], "tabby cat": ["Tabby cats often have a distinctive \"ticked\" fur pattern, with alternating bands of light and dark fur.", "Tabby cats often have a distinctive \"tiger stripe\" pattern, with stripes running down their sides and legs."], "tiger cat": ["They have a long, slender body and a short, thick tail.", "Tiger cats have large, round eyes and a wide, triangular face. They also have long whiskers and tufted ears."], "Persian cat": ["Persian cats have a round face with a short muzzle and large, round eyes.", "Persian cats have a long, fluffy tail that is usually held low and close to the body.", "Persian cats have short legs and a broad, stocky body."], "Siamese cat": ["Siamese cats have a slender, muscular body type, with long legs and a long, tapering tail.", "Siamese cats have almond-shaped eyes that are typically blue in color."], "Egyptian Mau": ["They have a short, sleek coat that is usually silver or smoke-colored, with black spots and stripes.", "Egyptian Maus have a distinctive facial structure, with large, almond-shaped eyes, a short muzzle, and a broad forehead. They also have a long, slender tail with a black tip."], "cougar": ["They have a long, muscular body and a large head with a short, rounded muzzle.", "Cougars have long, powerful legs and a long, thick tail that is usually held low to the ground.", "They have large, rounded ears and a white patch on the chest."], "lynx": ["Lynx have long legs and large feet, which are well-suited for walking in snow.", "Lynx have a short, bobbed tail, which is usually tipped with a black tuft of fur.", "Lynx have thick, spotted fur, which is usually grayish-brown in color."], "leopard": ["Leopards have a long tail with a black tip, which is often used for balance when they are climbing trees.", "Leopards have a short, stocky body and long legs, which makes them well-suited for climbing and running."], "snow leopard": ["They have long, thick fur, which helps them stay warm in their cold mountain habitats.", "Snow leopards have long, thick tails that are almost as long as their bodies. These tails are often tipped with a black tuft of fur.", "Snow leopards have short, stocky legs and large paws, which help them move"], "jaguar": ["Jaguars have a large, muscular body with a short tail and a broad head.", "Jaguars have a unique black spot on the back of their ears, which is often used to distinguish them from other large cats."], "lion": ["Lions have a large, muscular body with a long tail.", "Lions have a unique facial structure, with a broad muzzle, large ears, and a tuft of fur on the chin."], "tiger": ["Tigers have a large, muscular body with a long tail.", "Tigers have a large head with a wide muzzle and prominent whiskers.", "Tigers have a distinctive white spot on the back of their ears."], "cheetah": ["Cheetahs have a long, slender body and a small head, with a black \"tear-streak\" running from the corner of each eye down the side of the nose.", "Cheetahs have a long, black-tipped tail that is used for balance when running."], "brown bear": ["They have a long snout and small ears, and their fur is usually a shade of brown, ranging from light tan to dark brown.", "Brown bears have large, curved claws that are used for digging and climbing. They also have a distinctive, concave facial profile."], "American black bear": ["They have a large, round head with small ears and a short, pointed muzzle.", "American black bears have a distinctive white patch on their chest, which is often shaped like a V or U.", "They have long, curved claws that are used for climbing trees and digging for food."], "polar bear": ["Polar bears have a distinctive black nose and small ears, which are often hidden by their fur.", "Polar bears have large, curved claws that help them grip the ice and snow. They also have a thick layer of fat beneath their skin, which helps them stay warm in cold temperatures."], "sloth bear": ["Sloth bears have long, curved claws that are used for digging and foraging for food.", "Sloth bears have a long snout and small ears, which are often hidden by their fur.", "Sloth bears have a distinctive humped back, which is caused by their long, curved spine."], "mongoose": ["They have a distinctive coat of fur, which can range from gray to brown to black, and often have a lighter-colored underside.", "Mongooses have a long, bushy tail that is usually darker than the rest of their fur.", "They have small ears and beady eyes, and some species have a crest of fur on their head."], "meerkat": ["They have a sandy-brown fur color with a lighter underside and a black-tipped tail.", "Meerkats have large, round eyes and ears that are set close together on the sides of their head.", "They often stand upright on their hind legs, with their front paws held up in the air."], "tiger beetle": ["They have a glossy, metallic-looking exoskeleton, usually in shades of green, blue, or brown.", "The legs of tiger beetles are long and spindly, and they have large, curved mandibles.", "The wings of tiger beetles are usually transparent, and they have a distinctive pattern of stripes or spots on their backs."], "ladybug": ["Ladybugs have two sets of wings, which are usually held together in a closed position.", "Ladybugs have long antennae, which are usually black or brown in color."], "ground beetle": ["Ground beetles have long, slender legs and antennae. These antennae are usually longer than the body of the beetle, and can be used to distinguish them from other insects.", "Ground beetles have a distinct head shape, with large eyes and a protruding snout. This snout is often used to burrow into"], "longhorn beetle": ["Longhorn beetles have a distinctively elongated body shape, with a narrow head and thorax and a wider abdomen.", "Longhorn beetles often have bright colors and patterns on their wings and body, such as stripes, spots, or bands."], "leaf beetle": ["Leaf beetles often have bright colors, such as red, yellow, or green, and may have stripes or spots.", "Leaf beetles have long antennae and short legs, and some species have wings that are visible when the beetle is at rest."], "dung beetle": ["They have short antennae and six legs, with the front pair adapted for digging.", "Dung beetles often have a shiny, metallic appearance, ranging from black to green or blue.", "Some species have horns or ridges on their heads, which can be used to distinguish them from other beetles."], "rhinoceros beetle": ["They have a hard, shiny exoskeleton that is usually black or brown in color.", "Rhinoceros beetles have large, powerful mandibles that are used for digging and defense.", "They have six legs and two antennae, which are usually longer than their body."], "weevil": ["Weevils have a hard, segmented exoskeleton, which can be seen in the photo.", "Weevils often have a distinct pattern of spots or stripes on their bodies, which can be used to identify the species."], "fly": ["Flies have two large compound eyes, which are usually easily visible.", "Flies have a pair of antennae, which are usually visible on the head.", "Flies have a pair of halteres, which are small knob-like structures located near the wings.", "Flies have a slender body, which is usually visible in the photo."], "bee": ["Bees have two sets of wings, with the hind wings being smaller than the forewings.", "Bees have a pair of antennae on their heads, which they use to sense their environment.", "Bees have a proboscis, which is a long, tube-like mouthpart used for sucking up nectar and pollen."], "ant": ["Ants have two antennae on their head, which they use to sense their environment.", "Ants have six legs, which are usually visible in a photo.", "Ants have a pair of mandibles, which are used for grasping and manipulating objects."], "grasshopper": ["Grasshoppers have long, powerful hind legs, which they use for jumping.", "Grasshoppers have a distinct body shape, with a large head, a narrow thorax, and a wide abdomen.", "Grasshoppers have a variety of colors and patterns, ranging from green to brown to yellow. Some species also have stripes or spots."], "cricket insect": ["Crickets have three pairs of legs and two pairs of wings. The wings are usually held flat against the body and are used for jumping and flying.", "Crickets have a distinct chirping sound that is produced by rubbing their wings together. This sound is often used to attract mates."], "stick insect": ["Stick insects have long antennae and legs, which can be used to help identify them.", "Stick insects often have spines or spikes on their bodies, which can be used to distinguish them from other insects."], "cockroach": ["They have long antennae and six legs, with two of the legs being longer than the others.", "Cockroaches have two sets of wings, although some species may not have wings at all. The wings are usually darker than the body and may be patterned."], "praying mantis": ["They have long, spindly legs with sharp claws at the end, which they use to grasp prey.", "Praying mantises have a pair of wings that are usually held in a folded position, and they often have a bright green or brown coloration."], "cicada": [" Cicadas have a hard outer shell that is usually green or brown in color. This shell is often marked with stripes or spots.", " Cicadas have long antennae that are usually longer than the length of their body. They also have long legs that are used for clinging to trees and other surfaces."], "leafhopper": ["Leafhoppers have long antennae and short legs, and often have bright colors or patterns on their wings.", "Leafhoppers have a unique jumping ability, which can be seen when they take off from a leaf or other surface."], "lacewing": ["Lacewings have long antennae and large eyes. They also have a slender body and long legs.", "Lacewings have a unique coloration, with some species having a metallic green or blue hue."], "dragonfly": ["Dragonflies have long, slender bodies with a pair of large compound eyes that take up most of the head.", "Dragonflies have three pairs of legs that are used for perching and grasping prey. They also have a pair of short antennae.", "Dragonflies come in a variety of colors, from bright blues and greens to dull browns and blacks."], "damselfly": ["Damselflies have long, slender bodies with three distinct segments. The head is usually large and may have antennae or eyespots.", "Damselflies have three pairs of legs that are used for perching and grasping prey. The legs are usually long and thin and may have spines or bristles."], "red admiral butterfly": ["The underside of the wings is usually a duller orange color, with a pattern of black spots and stripes.", "Red admiral butterflies have a wingspan of about 2.5 inches, making them larger than many other butterfly species."], "ringlet butterfly": ["The wings of a ringlet butterfly are usually a dark brown or black color, with white or yellowish rings.", "The underside of the wings of a ringlet butterfly are usually a lighter brown or gray color, with the same pattern of rings as the upper side.", "The antennae of a ringlet butterfly are usually black and white, with a distinctive club shape at the end."], "monarch butterfly": ["The wingspan of a monarch butterfly is typically 3-4 inches, making them larger than other butterfly species.", "Monarch butterflies have a unique pattern of veins on their wings, which can be used to distinguish them from other butterfly species."], "small white butterfly": ["The wings of small white butterflies often have a distinctive pattern of black spots or stripes.", "Small white butterflies often have a small, slender body with long antennae."], "sulphur butterfly": ["The wingspan of a sulphur butterfly is usually between 2.5 and 4 inches.", "The underside of the wings may have a more muted coloration, often with white or cream-colored spots.", "The antennae of a sulphur butterfly are usually black with a white tip."], "gossamer-winged butterfly": ["Gossamer-winged butterflies have long, thin antennae that are usually black or brown in color.", "Gossamer-winged butterflies have a slender body and long, thin legs. They are usually smaller than other butterfly species."], "starfish": ["Starfish often have a spiny texture, with small bumps or spines covering their arms.", "The underside of a starfish is usually a lighter color than the top, and may feature small tube feet or suction cups."], "sea urchin": ["The spines can be of various colors, ranging from black to yellow, and can be striped or solid.", "Sea urchins have five rows of tube feet, which are used for locomotion and feeding. These tube feet are visible on the underside of the urchin.", "Sea urchins have a central mouth, surrounded by five teeth, which are used to"], "sea cucumber": ["Sea cucumbers often have a pattern of bumps or spines along their body, which can be used to distinguish them from other sea creatures.", "Sea cucumbers have a unique set of tube feet, which they use to move and cling to surfaces. These tube feet are often visible in photos."], "cottontail rabbit": ["Cottontail rabbits have long ears that are usually held upright, and are often darker in color than the rest of the body.", "Cottontail rabbits have a short, compact body with short legs and a rounded head. They are usually brown or gray in color, with lighter fur on the underside."], "hare": ["Hares have long, powerful hind legs that are adapted for running and leaping.", "Hares have a brownish-gray fur coat that is usually mottled with lighter and darker patches."], "Angora rabbit": ["Angora rabbits have large ears that stand upright and are often tufted with fur.", "Angora rabbits have a unique body shape, with a large head, short neck, and a rounded body."], "hamster": ["They have large ears and eyes, and a small nose.", "They have thick fur that can range in color from white to brown to black.", "They have a distinctive pattern of stripes or spots on their fur.", "They have a large cheek pouch on either side of their face, which they use to store food."], "porcupine": ["Porcupines have a large, round head with small ears and a short muzzle.", "Porcupines have a long, bushy tail that is covered in quills. This tail is usually held upright when the porcupine is alarmed."], "fox squirrel": ["They have large, bushy tails that are usually longer than their body length.", "Fox squirrels have large, pointed ears and a black nose.", "They have a distinctive white stripe running down the center of their back."], "marmot": ["Marmots have a distinctive face with a pointed snout and small ears.", "Marmots have a thick, bushy coat of fur, usually in shades of brown, gray, or black. They also have a white patch of fur on their chest."], "beaver": ["Beavers have large, webbed hind feet that are used for swimming and digging.", "Beavers have a distinctive, wide head with small eyes and ears, and a large, flat nose.", "Beavers have thick, brown fur that is often darker on the back and lighter on the underside."], "guinea pig": ["They have a distinct head shape, with a short muzzle and large, round eyes.", "Guinea pigs have thick, soft fur that can come in a variety of colors and patterns.", "They have short, rounded ears that are usually visible above the fur."], "common sorrel horse": ["The mane and tail of a common sorrel horse are usually a lighter shade of red than the body.", "Common sorrel horses often have white markings on their face, such as a star or snip, and sometimes white socks or stockings on their legs."], "zebra": ["Zebras have long ears and a short, erect mane.", "Zebras have a stocky build with a short neck and a long, tufted tail."], "pig": ["Pigs have short, stubby legs and a large, round body.", "Pigs have a thick coat of fur, which can range from white to black, and sometimes even pink or spotted.", "Pigs have a curly tail that is usually held up in the air."], "wild boar": ["They have a thick, bristly coat of fur that is usually black or dark brown in color.", "Wild boars have a distinctive set of tusks that protrude from their lower jaw. These tusks are used for digging and defending themselves.", "Wild boars also have a long, tufted tail that is usually held upright when running."], "warthog": ["Warthogs have two pairs of tusks, one pair of upper tusks and one pair of lower tusks. The upper tusks are curved and can be seen protruding from the sides of the mouth.", "Warthogs have a mane of short, bristly hair running along their back and down their sides. They also have a tu"], "hippopotamus": ["They have a large head with a wide mouth and two large, protruding teeth.", "Hippos have a thick, grayish-brown skin with sparse, sparsely distributed hairs.", "They have small eyes and ears, and a short tail."], "ox": ["Oxen have two horns that are curved and point outward from the head.", "Oxen have a distinctive coat of fur that is usually a light brown or reddish color."], "water buffalo": ["They have a distinctive hump on their back, which is usually more pronounced in males.", "Water buffaloes have long, curved horns that can reach up to 1.5 meters in length.", "They have a shaggy coat of fur that is usually black or dark brown in color."], "bison": ["They have a shaggy coat of fur, usually brown or black in color.", "Bison have short, curved horns that protrude from the sides of their head.", "Bison have a large, bushy tail that is usually black in color."], "ram (adult male sheep)": ["Rams have a thick, woolly coat that is usually darker in color than that of female sheep.", "Rams have a large, muscular body and a thick neck, which is often covered in a mane of long, shaggy fur."], "bighorn sheep": ["Bighorn sheep have a distinctive white rump patch, which is usually more prominent in males.", "Bighorn sheep have a thick, woolly coat that is usually brown or gray in color. They also have a short tail and short, stocky legs."], "Alpine ibex": ["They have a light brown to dark gray coat with a white underside.", "They have a short, black beard on their chin and a black stripe running down their back.", "They have long, cloven hooves that are well-adapted for climbing steep, rocky terrain."], "hartebeest": ["They have a large, curved horns that are usually present in both males and females.", "Hartebeests have a light brown coat with a white underside and a white stripe running along the back."], "impala (antelope)": ["Impalas have long, slender legs and a long neck.", "Impalas have a distinctive tuft of black hair at the tip of their tail.", "Impalas have a characteristic black stripe running down the back of their legs."], "gazelle": ["They have a distinctive facial profile, with large eyes, long ears, and a short muzzle.", "Gazelles have a light-colored coat with dark stripes or spots, which helps them blend into their environment."], "arabian camel": ["Arabian camels have long, curved necks and long legs.", "Arabian camels have thick, shaggy coats that are usually a light tan or brown color.", "Arabian camels have long, curved eyelashes and a distinctive facial structure."], "llama": ["They have long, curved ears and a short muzzle.", "Llamas have a thick, woolly coat that can range in color from white to brown to black.", "They have a long, furry tail and four-toed feet."], "weasel": ["Weasels have a long, thin tail that is usually the same color as their body.", "Weasels have small, pointed ears and a pointed muzzle. They have small, black eyes and a black nose."], "mink": ["They have a glossy, dark brown fur with a white patch on their throat and chin.", "Minks have small, rounded ears and a pointed muzzle. They also have small, black eyes and a black nose."], "European polecat": ["They have a dark brown coat with a white underbelly and white markings on the face.", "They have a pointed muzzle and small ears, and their eyes are usually dark.", "They have long, slender legs and webbed feet, which are adapted for swimming."], "black-footed ferret": ["They have a long, slender body with short legs and a long neck.", "They have a white chest and belly, and their fur is usually a mix of brown, black, and white.", "They have long, sharp claws that they use for digging and climbing."], "otter": ["Otters have a thick, dense fur coat that is usually dark brown or black in color.", "Otters have a long, tapered tail that is often used for swimming and diving.", "Otters have a characteristic face with a pointed muzzle, small eyes, and small ears."], "skunk": ["Skunks have a short, bushy tail with a black tip.", "Skunks have small, rounded ears and a pointed snout.", "Skunks have small, sharp claws on their feet, which they use for digging and climbing."], "badger": ["Badgers have short, stocky legs and a long, thick body.", "Badgers have short, rounded ears and a short tail.", "Badgers have long claws on their front feet, which they use for digging."], "armadillo": ["Armadillos have short, stubby legs and long claws that they use for digging.", "Armadillos have a long, pointed snout and small ears that are usually hidden by their fur."], "three-toed sloth": ["They have long, shaggy fur that is usually grayish-brown in color.", "They have three long claws on each of their front feet, which they use to hang from branches.", "They have a slow, deliberate movement pattern, often hanging upside down from branches."], "orangutan": ["They have long, shaggy hair on their head and body, and their arms are longer than their legs.", "Orangutans have a distinctive, wide face with prominent cheek pads and a large, protruding muzzle. They also have a prominent brow ridge and small ears."], "gorilla": ["Gorillas have broad chests and shoulders, and their arms are longer than their legs.", "Gorillas have a prominent brow ridge, and their eyes are usually dark brown or black.", "Gorillas have a large head with a short muzzle and a wide jaw."], "chimpanzee": ["Chimpanzees have long arms and legs, and their hands and feet are often larger than those of humans.", "Chimpanzees have a unique fur pattern, with a dark face, hands, and feet, and a lighter fur on the rest of the body."], "gibbon": ["Gibbons have a distinctive facial structure, with a flat face, large eyes, and a small nose.", "Gibbons have a unique fur pattern, with a black or dark brown body and white or light-colored hands, feet, and face."], "siamang": ["They have long arms and legs, and their hands and feet are adapted for gripping branches.", "Siamangs have a unique vocalization, which is a loud, resonating call that can be heard from far away."], "guenon": ["Guenons have distinctive facial features, including a long, pointed muzzle and large eyes.", "Guenons have long, curved claws on their hands and feet, which they use to climb trees and forage for food."], "patas monkey": ["They have long, thin limbs and a long tail, which is usually held upright when the monkey is in motion.", "Patas monkeys have a distinctive facial pattern, with a white or cream-colored patch around the eyes and a black stripe running from the nose to the back of the head."], "baboon": ["They have a long, thick tail that is usually held upright.", "Baboons have a unique coloration, with a mix of gray, brown, and black fur.", "They have long, powerful limbs and digits, which they use to climb trees and rocks."], "macaque": ["Macaques have a wide range of fur colors, from light brown to black, and often have a lighter-colored muzzle and cheeks.", "Macaques have long tails, which can be used to help them balance when climbing trees. They also have long arms and legs, and their hands and feet are adapted for gripping branches."], "langur": ["They have a distinctive face with a white or light-colored muzzle and a dark patch around the eyes.", "Langurs have long, powerful legs and arms, which they use to climb trees and swing from branch to branch.", "They have a distinctive tuft of fur on the crown of their head, which is usually black or dark brown."], "black-and-white colobus": ["They have a long, white tail with a tuft of black fur at the end.", "They have long, white whiskers and a white beard.", "They have a distinctive, round face with large, round eyes."], "proboscis monkey": ["They have a large, round head and a thick, shaggy coat of fur.", "Proboscis monkeys have long, powerful limbs and a long, prehensile tail, which they use to help them balance while climbing trees.", "They have a distinctive gait, walking with a swaying motion and taking long strides."], "marmoset": ["Marmosets have a distinctive tuft of fur on their heads, which can be used to identify them.", "Marmosets have long tails, which are usually longer than their bodies.", "Marmosets have claws on their hands and feet, which they use to climb trees and branches."], "white-headed capuchin": ["They have a long, prehensile tail that is used for balance and to help them move through the trees.", "They have long, slender fingers and toes that are well adapted for gripping branches and manipulating objects.", "They have a light brown to grayish fur on their body, with a lighter color on their underside."], "howler monkey": ["They have a large, prehensile tail that is used for balance and gripping branches.", "Howler monkeys have a loud, deep call that can be heard from up to three miles away. This call is often used to mark territory and communicate with other members of the troop.", "Howler monkeys have a wide, flat face with a prominent muzzle and large eyes. They also have"], "titi monkey": ["Titi monkeys have long, bushy tails that are usually black and white.", "Titi monkeys have long, slender limbs and digits, which they use to cling to trees and branches."], "Geoffroy's spider monkey": ["They have long, slender arms and legs, and a long, prehensile tail that they use to swing from branches.", "They have a black and white fur pattern on their back, with a white stripe running down the center of their back."], "common squirrel monkey": ["They have a long, bushy tail that is usually longer than their body.", "They have long, slender limbs and digits, which they use to climb and jump from tree to tree.", "They have a grayish-brown fur coat, with lighter fur on their undersides."], "ring-tailed lemur": ["They have a white face mask, which is usually surrounded by a darker fur.", "Ring-tailed lemurs have long limbs and digits, which they use to grip onto trees and other surfaces.", "They often have a distinctive posture, with their arms and legs spread out in a vertical position."], "indri": ["They have a long, bushy tail, which is usually black and white.", "Indris have large, round eyes and a short snout.", "They have long, powerful hind legs and short forelimbs, which they use to leap from tree to tree."], "Asian elephant": ["Asian elephants have a single, long trunk that is used for grasping and manipulating objects.", "Asian elephants have four short, stubby legs and a large, bulky body. They also have a long tail with a tuft of hair at the end."], "African bush elephant": ["They have two distinct tusks that protrude from their upper jaw.", "They have a long trunk that is used for grasping objects and for drinking water.", "They have a large, bulky body with thick, wrinkled skin.", "They have four short, stubby legs and large, flat feet."], "red panda": ["They have a long, bushy tail with a white tip, which is often held in a curved position.", "Red pandas have a unique facial structure, with a white muzzle and black eye patches. They also have a white stripe running from the top of their head to their nose."], "giant panda": ["Giant pandas have a large head and round face, with a short snout and small ears.", "Giant pandas have a large, distinctive tail, which is usually black and white.", "Giant pandas have large, distinctive paws with five digits, which they use to hold and manipulate food."], "snoek fish": ["They have a distinctive dark green or brown back with a silver-white underside.", "They have a single, long dorsal fin that runs along the length of their body, and two pectoral fins near the head.", "They have a large mouth with sharp teeth, and two barbels near the lower jaw."], "eel": ["They have a single dorsal fin that runs along the length of their body, and a pair of pectoral fins near the head.", "Eels have a pointed snout and small eyes, and their coloration can range from dark brown to yellowish-green."], "silver salmon": ["They have a black spot on the upper part of their tail fin, which is a distinguishing feature.", "Silver salmon have a large, hooked jaw and sharp teeth, which can be seen when they open their mouths.", "They also have a distinct hump on their back, which is a characteristic of the species."], "rock beauty fish": ["They have a large, fan-shaped dorsal fin, which is usually yellow with a black edge.", "Rock beauty fish have a long, pointed snout and a large, protruding lower jaw. They also have a pair of long, thin barbels near their mouth."], "clownfish": ["Clownfish have a unique shape, with a large head and a tapered body.", "Clownfish have a distinctive fin arrangement, with a dorsal fin that runs along the top of their body and a long, flowing tail fin."], "sturgeon": ["They have a long, pointed snout and four barbels on their chin.", "Sturgeons have five rows of bony plates, called scutes, along their body.", "They have a long, paddle-like tail and a pair of dorsal fins."], "gar fish": ["Gars have a long, pointed snout and a set of long, sharp teeth.", "Gars have a set of long, thin pectoral fins that extend from the sides of their body.", "Gars have a set of long, thin pelvic fins that extend from the bottom of their body.", "Gars have a set of long, thin dorsal fins that run along the"], "lionfish": ["Lionfish have long, venomous spines that protrude from their bodies. These spines can be used to identify the species of lionfish.", "Lionfish have a unique body shape, with a large head and a long, slender body. This body shape is distinct from other fish species and can be used to identify a lionfish."], "pufferfish": ["They have a large head with a protruding snout and large eyes.", "They have a pattern of stripes, spots, or other markings on their body.", "They have a unique ability to inflate their bodies with water or air when threatened, making them appear much larger than they actually are."], "abacus": ["The rods are divided into sections, with beads or counters of different colors strung along them.", "The beads are usually arranged in a pattern of two or more colors, with the higher numbers of each color representing higher values."], "abaya": ["Abayas often have a hood or head covering, which is usually made of a different material than the rest of the garment.", "Abayas may also feature a face veil, which is usually made of a sheer, lightweight fabric."], "academic gown": ["The gowns are often adorned with velvet panels on the chest and sleeves, and may have a hood attached to the back.", "Academic gowns are usually worn with a mortarboard hat, which is a flat, square cap with a tassel attached to the top."], "accordion": ["Accordions have a keyboard with buttons or keys, usually black and white, which are used to play the instrument.", "Accordions often have a strap or handle on the side, which is used to hold the instrument while playing."], "acoustic guitar": ["The sound hole is usually located in the middle of the body and is often round or oval in shape.", "Acoustic guitars have six strings, which are usually made of metal or nylon.", "The headstock of an acoustic guitar is usually located at the top of the neck and contains the tuning pegs."], "aircraft carrier": ["Aircraft carriers typically have a large island structure on the starboard side of the ship, which houses the bridge, communications, and other command and control systems.", "Aircraft carriers often have multiple decks, with the flight deck being the highest and most visible. This deck is usually marked with a large number of aircraft tie-down points and arresting wires."], "airliner": ["Airplanes have two or more engines, usually mounted on the wings or the tail.", "Airplanes have a distinct tail fin, which is usually painted with the airline's logo or colors.", "Airplanes have multiple windows along the fuselage, and often have a distinctive paint job or livery."], "airship": ["Airships are usually brightly colored, often with a combination of red, white, and blue.", "Airships have several large fins or rudders at the back, which are used to control the direction of the craft."], "altar": ["Candles, incense, and other offerings are often placed on the altar.", "Altars may also feature statues, paintings, or other religious artifacts."], "ambulance": ["Ambulances are usually equipped with flashing lights and sirens, which can be seen in a photo.", "Ambulances are typically larger than other vehicles on the road, and often feature a boxy shape with a raised roof."], "amphibious vehicle": ["They often have large, wide tires that are designed to provide traction on both land and water.", "Amphibious vehicles usually have a propeller or fan at the rear, allowing them to move through water."], "analog clock": ["The face of the clock is usually marked with numbers or tick marks to indicate the time.", "The clock may also feature a third hand, which is used to indicate the seconds.", "The clock may also have a pendulum or other decorative features."], "apiary": ["Apiaries often have a fence or other barrier around them to protect the bees from predators.", "Apiaries may also have a water source nearby, such as a pond or stream, to provide the bees with a source of hydration."], "apron": ["Aprons often have pockets, which can be used to store tools or other items.", "Aprons come in a variety of colors and patterns, making them easy to distinguish from other clothing items."], "trash can": ["Trash cans often have a handle or two on the sides, making them easy to carry.", "Trash cans are usually made of metal or plastic, and may have a logo or brand name printed on them."], "assault rifle": ["They often have a collapsible stock, allowing the user to adjust the length of the rifle.", "Assault rifles usually have a magazine that protrudes from the bottom of the weapon.", "They often have a carrying handle on the top of the weapon, and a foregrip near the muzzle."], "backpack": ["Backpacks often have a top handle for easy carrying.", "Backpacks usually have several pockets and compartments for storing items.", "Backpacks often have a distinctive shape, with a curved top and a flat bottom."], "bakery": ["Many bakeries have a recognizable sign or logo displayed prominently on the storefront.", "Inside, bakeries often have shelves or counters filled with freshly baked goods, such as cakes, pies, breads, and pastries."], "balance beam": ["Balance beams are usually made of wood or metal and have a non-slip surface.", "Balance beams are often brightly colored, with alternating stripes of different colors.", "Balance beams are usually supported by two legs at either end, which can be seen in the photo."], "balloon": ["Balloons are usually round or oval in shape, with a thin neck connecting the body of the balloon to the string.", "Balloons are often filled with air or helium, giving them a distinct shape and buoyancy."], "ballpoint pen": ["The tip of a ballpoint pen is usually made of metal and has a small ball at the end, which is used to dispense ink.", "The body of a ballpoint pen is usually made of plastic and may feature a clip or other design elements. It may also have the manufacturer's logo or brand name printed on it."], "Band-Aid": ["The adhesive backing is usually covered with a thin, transparent plastic film, which can be peeled off to reveal the adhesive.", "Band-Aids often feature a bright red or blue logo, which is a signature feature of the product."], "banjo": ["Banjos usually have four or five strings, which are attached to a bridge and run along the length of the neck.", "Banjos often have a distinctive shape, with a curved headstock and a resonator on the back of the body. This resonator amplifies the sound of the strings when the"], "baluster / handrail": ["Handrails are usually curved and often feature a decorative design.", "Balusters and handrails are often connected to each other with a series of horizontal bars or spindles."], "barbell": ["Barbells often have knurled grips along the length of the bar, allowing for a secure grip when lifting.", "The weights attached to the barbell are usually made of metal and come in a variety of sizes and shapes. They are usually painted in a variety of colors to indicate the weight of the barbell."], "barber chair": ["Barber chairs often feature a footrest and armrests, as well as a reclining mechanism for adjusting the angle of the seat.", "Barber chairs are usually upholstered in leather or vinyl, and often feature a distinctive pattern or color."], "barbershop": ["Inside the shop, there are usually several chairs for customers to sit in, as well as a counter for the barber to work at.", "Barbershops often have a variety of grooming products and tools on display, such as scissors, combs, razors, and shaving cream."], "barn": ["Barns often have large doors, either sliding or hinged, which are used to access the interior.", "Barns are usually made of wood, and may feature a variety of colors, textures, and patterns. They may also have windows, shutters, and other decorative features."], "barometer": ["The dial or gauge is usually marked with a range of atmospheric pressure readings, such as \"High,\" \"Low,\" and \"Normal.\"", "Many barometers also feature a pointer or needle that moves in response to changes in atmospheric pressure."], "barrel": ["Barrels often have metal bands around them, which are used to reinforce the structure and keep the barrel sealed.", "Barrels usually have a spigot or tap at the bottom, which is used to dispense the contents."], "wheelbarrow": ["The body of the wheelbarrow is usually a metal or plastic tray, with two handles at the front for pushing and steering.", "Wheelbarrows often have a footrest at the back, which is used to help lift the wheelbarrow when it is full."], "baseball": ["Baseballs have a cork or rubber core, which is usually visible in the center of the ball.", "Baseballs are usually white with red stitching, but can also be other colors depending on the type of game being played."], "basketball": ["The surface of a basketball is composed of a pattern of interlocking panels, which are usually eight in number.", "Basketballs also feature a unique texture, with a slightly raised surface that provides grip when handling the ball."], "bassinet": ["Bassinets often have a mattress and bedding, such as a sheet, blanket, or quilt.", "Bassinets are usually designed with a low profile, making them easy to access for parents and caregivers."], "bassoon": ["The bassoon has a double reed mouthpiece, which is a unique feature that distinguishes it from other woodwind instruments.", "The bassoon has a complex system of keys and levers that are used to change the pitch of the instrument."], "swimming cap": ["Swimming caps are designed to fit snugly over the head and ears, and often feature a chin strap to keep them in place.", "Swimming caps often have a logo or brand name printed on them, making them easily identifiable."], "bath towel": ["Bath towels often have a loop or two at one end, which is used to hang the towel up.", "Bath towels are usually made of absorbent materials such as cotton or microfiber, which can be identified by their texture."], "bathtub": ["They often have a glossy finish, and may be made of porcelain, acrylic, or other materials.", "Bathtubs usually have a drain at the bottom, and may have a shower head or faucet attached to the side."], "station wagon": ["Station wagons often have a large rear hatch, which is used to access the cargo area.", "Station wagons usually have a large, flat rear window, which is often tinted.", "Station wagons often have a distinctive grille, which can help to identify the make and model."], "lighthouse": ["The top of the lighthouse is usually painted with a distinctive pattern or color, making it easily recognizable.", "The lighthouse will often have a light source at the top, which can be seen from a distance.", "The base of the lighthouse is usually surrounded by a fence or wall, and may have a door or gate."], "beaker": ["Beakers often have a scale or markings on the side to measure the volume of liquid inside.", "Beakers are usually made of glass or plastic, and may have a handle for easy handling."], "military hat (bearskin or shako)": ["Shako hats are usually tall and conical in shape, with a flat top and a narrow brim.", "Both types of hats often feature a plume or feather on the top, as well as a chin strap or chin cord.", "Bearskin hats are usually made of fur, while shako hats are usually made of leather or felt."], "beer bottle": ["The bottle is usually labeled with the beer's brand name, logo, and other information.", "The bottle often has a crown cap or twist-off cap, which is used to open the bottle.", "The bottle may also have a label or sticker on the neck or body of the bottle."], "beer glass": ["Beer glasses often have a handle, which can be used to easily hold the glass.", "Beer glasses often have a logo or design etched or printed on the side, which can be used to identify the type of beer or the brewery."], "bell tower": ["Bell towers often feature a large bell at the top, which is usually visible from a distance.", "Bell towers often have multiple levels, with windows or balconies at the top. They may also feature decorative elements such as arches, columns, or statues."], "baby bib": ["Baby bibs usually have a neck opening that is adjustable with a snap or Velcro closure.", "Baby bibs often have a pocket at the bottom to catch any food or liquid that may fall during mealtime."], "tandem bicycle": ["The frame of a tandem bicycle is usually longer than a regular bicycle, and the two sets of handlebars are connected by a crossbar.", "The tandem bicycle will usually have two sets of pedals, one for each rider. The pedals are usually connected by a chain or belt drive."], "bikini": ["Bikinis often feature bright colors and patterns, such as stripes, polka dots, or floral designs.", "Bikinis are often made of lightweight, stretchy fabrics such as lycra or spandex."], "ring binder": ["The rings are usually made of metal or plastic and can be opened and closed to add or remove pages.", "The cover of the binder is usually made of a hard material such as cardboard or plastic, and may feature a logo or design."], "binoculars": ["The lenses are usually surrounded by a protective casing, which may be made of metal or plastic.", "Binoculars often have a focusing mechanism, such as a wheel or knob, to adjust the focus of the lenses.", "Many binoculars have a strap or handle for easy carrying."], "birdhouse": ["Birdhouses often have a slanted roof, which helps protect the interior from the elements.", "Birdhouses may have decorative features such as perches, windows, or other embellishments."], "boathouse": ["Boathouses are usually constructed with a sloping roof, often with a large overhang to protect the boats from the elements.", "Boathouses often feature large windows or doors to allow access to the boats, and may have a dock or ramp leading down to the water."], "bobsleigh": ["Bobsleighs have two sets of runners, one on the bottom and one on the sides, which help the bobsleigh glide on the ice.", "Bobsleighs are usually brightly colored, with a variety of designs and logos."], "bolo tie": ["The clasp is usually decorated with a metal ornament, such as a silver or gold-plated design, or a stone or gem.", "The two pieces of leather or cord are usually connected by a metal slide, which allows the wearer to adjust the length of the tie."], "poke bonnet": ["Poke bonnets often have a high crown, which is usually round or conical in shape.", "The brim of a poke bonnet is usually quite wide, often extending beyond the wearer's shoulders."], "bookcase": ["The shelves are usually adjustable, allowing for different heights and configurations.", "Bookcases often feature a back panel, which can be made of wood, metal, or other materials. This panel helps to keep the books in place and can also add a decorative touch.", "Many bookcases have doors or drawers for additional storage."], "bookstore": ["Bookstores often have a recognizable sign or logo outside the building.", "Inside, bookstores typically have shelves and tables filled with books, magazines, and other reading materials. They may also have a counter or desk for checkout."], "bottle cap": ["Bottle caps often feature a logo or brand name printed on the top.", "Bottle caps are usually made of metal or plastic, and may have a ridged or textured surface."], "hunting bow": ["The handle of a hunting bow is usually made of wood, plastic, or metal, and is often decorated with a pattern or design.", "The bowstring is usually made of a strong material such as Dacron or Kevlar, and is usually brightly colored.", "The bow may also have a stabilizer, which is a weight attached to the handle to help balance the bow and reduce vibration."], "bow tie": ["Bow ties are usually made of fabric, and often feature a pattern or design.", "Bow ties are usually tied in a knot at the neck, and the ends of the tie are usually of equal length."], "brass memorial plaque": ["The plaque will often feature a raised border or frame, which can be ornate or plain.", "The plaque will usually have a textured surface, with the text and images engraved into the metal.", "The plaque will often feature a dedication or inscription, which can be in the form of a poem, quote, or other text."], "bra": ["Bras often have a closure in the back, which can be a hook-and-eye closure, a clasp, or a zipper.", "Bras may have decorative details such as lace, embroidery, or bows."], "breakwater": ["Breakwaters are often built in a curved or angled shape, which helps to deflect the waves away from the shoreline.", "Breakwaters are usually built close to the shoreline, and may be visible from the beach or shoreline."], "breastplate": ["Breastplates often have intricate designs or patterns etched into the metal, such as floral motifs or geometric shapes.", "Breastplates may also feature decorative elements such as rivets, buckles, or straps."], "broom": ["The head of the broom is usually wider than the handle, and the bristles are usually arranged in a fan-like pattern.", "Brooms often have a loop at the end of the handle, which is used to hang the broom up when not in use."], "bucket": ["The handle is usually made of metal or plastic and is used to carry the bucket.", "Buckets often have a lip or rim around the top edge, which helps to contain the contents.", "Buckets may also have a lid or cover, which is usually made of plastic or metal."], "buckle": ["Buckles often have a distinct shape, such as a circle, rectangle, or oval.", "Buckles may have decorative designs or patterns, such as engravings, embossing, or enamel."], "bulletproof vest": ["Bulletproof vests often feature a distinct pattern of overlapping panels, which are designed to disperse the force of a bullet impact.", "Bulletproof vests are usually secured with straps or buckles, and may feature additional pockets or pouches for carrying items."], "high-speed train": ["High-speed trains often have a distinctive livery, with bright colors and logos that make them easily recognizable.", "High-speed trains usually have multiple carriages, connected by couplings, and are often much longer than regular trains."], "butcher shop": ["The walls of a butcher shop are usually lined with hooks and shelves for storing and displaying products.", "Butcher shops often have a large cutting board and a variety of knives and other tools for cutting and preparing meat.", "The floors of a butcher shop are usually tiled or covered with a non-slip material to make cleaning easier."], "taxicab": ["Taxicabs often have a light on the roof, which is used to indicate when the cab is available for hire.", "Taxicabs usually have a sign on the roof, which displays the company name and logo.", "Taxicabs often have a meter inside, which is used to calculate the fare."], "cauldron": ["They often have a handle or two on either side, allowing them to be moved or suspended over a fire.", "Cauldrons often have a lid, which can be used to trap steam or smoke.", "The bottom of the cauldron is usually flat, allowing it to sit securely on a surface."], "candle": ["The flame of a candle is usually visible, and can be used to distinguish it from other objects.", "Candles often have a distinct scent, which can be used to identify them in a photo.", "Candles may also have a label or logo on them, which can be used to identify the brand or type of candle."], "cannon": ["Cannons often have a carriage or platform to support the barrel and provide stability when firing.", "Cannons usually have a large wheel or wheels to help move them around.", "Cannons often have a large, rectangular opening at the back of the barrel, which is used to load the ammunition."], "canoe": ["Canoes often have a flat bottom and sides that curve up towards the ends.", "Canoes are usually made of wood, fiberglass, or plastic, and may have a variety of colors and designs.", "Canoes often have a seat or two in the middle, and may have a paddle or oar attached."], "can opener": ["Can openers have a sharp blade that is used to cut the lid off the can. This blade is usually located at the end of the handle, and is often a distinct shape or color.", "Many can openers have a lever or knob that is used to open and close the blade. This lever or knob is usually located near the handle and is"], "cardigan": ["Cardigans are usually made of knitted fabric, such as wool or cotton. This fabric often has a distinct texture or pattern, such as stripes or cable-knit.", "Cardigans may have ribbed cuffs and hems, which are often a different color than the rest of the garment."], "car mirror": ["Car mirrors are usually mounted on the side of the car, either on the door or the side panel.", "Car mirrors often have a small arm extending from the base, which allows the driver to adjust the angle of the mirror."], "carousel": ["The platform is usually decorated with bright colors and intricate designs.", "Carousels often have a central pole or tower that supports the rotating platform. This pole is usually decorated with lights, flags, or other decorations."], "tool kit": ["Tool kits often come in a carrying case, which can be made of plastic, metal, or fabric. The case may feature a handle or straps for easy transport.", "Tool kits may also feature a variety of compartments and pockets for storing and organizing the tools."], "cardboard box / carton": ["The sides of the box are usually made of corrugated cardboard, with ridges and grooves that give the box strength and rigidity.", "The box may have a logo or other identifying marks printed on the outside, such as a company name or product name.", "The box may also have a flap or lid that can be opened or closed."], "car wheel": ["The spokes of the wheel are usually visible, and can vary in number and design depending on the make and model of the car.", "The wheel rim is usually made of metal and is often painted or coated with a protective finish.", "The wheel is usually mounted on a tire, which can be identified by its tread pattern."], "automated teller machine": ["They often have a keypad and a display screen, which are used to interact with the machine.", "Automated teller machines usually have a card reader, which is used to insert a debit or credit card.", "They also have a slot for cash and a slot for receipts."], "cassette": [" The cassette has a plastic shell with a hinged door that opens to reveal the tape.", " The cassette has a label on the front with the artist, album, and track information.", " The cassette has a small hole in the center of the spool, which is used to wind the tape."], "cassette player": ["The cassette player will have a door that opens to insert the cassette tape.", "The cassette player will have a series of buttons and dials to control the playback of the cassette.", "The cassette player will have a headphone jack and/or speakers to listen to the audio."], "castle": ["Castles often feature crenellations, or battlements, along the top of the walls.", "Castles often have a drawbridge, portcullis, or other form of entrance gate.", "Castles often have a moat or other form of water feature surrounding them."], "catamaran": ["Catamarans often have a large sail, usually triangular in shape, mounted on a mast.", "Catamarans usually have two outriggers, or amas, extending from the hulls. These are used to provide stability and balance."], "CD player": ["CD players often have a display screen that shows the track number, time, and other information.", "CD players usually have a series of buttons for controlling playback, such as play, pause, skip, and stop. These buttons are usually located on the front of the device."], "cello": ["Cellos have four strings, which are usually tuned to the notes C, G, D, and A.", "Cellos have a bridge, which is a small piece of wood that holds the strings in place and transmits their vibrations to the body of the instrument.", "Cellos have a tailpiece, which is a metal piece at the bottom of the instrument that holds the strings in"], "mobile phone": ["Mobile phones often have a camera lens on the back, as well as a speaker and microphone.", "Many mobile phones have the manufacturer's logo or brand name displayed on the back or sides of the device."], "chain": ["Chains often have a distinctive pattern of links, such as a herringbone or diamond pattern.", "Chains may have a clasp or hook at one end, allowing them to be attached to other objects."], "chain-link fence": ["The metal wires are usually galvanized, meaning they are coated in a protective layer of zinc. This gives them a silver or grayish color.", "The metal wires are connected to metal posts, which are usually spaced evenly apart. The posts are usually made of steel and are either painted or galvanized."], "chain mail": ["Chain mail is often worn in a protective garment, such as a hauberk or haubergeon. These garments are usually long-sleeved and reach down to the knees or lower.", "Chain mail is usually made of steel or iron, and can be identified by its metallic sheen."], "chainsaw": ["Chainsaws usually have a pull-start cord, which is used to start the engine.", "Chainsaws often have a protective guard around the blade to protect the user from flying debris.", "Chainsaws usually have a chain brake, which is a lever or switch used to stop the chain from spinning."], "storage chest": ["They may have handles on the sides or top for easy carrying.", "Many storage chests have a lock or latch to keep the lid closed.", "Some storage chests have decorative designs or carvings on the exterior."], "chiffonier": ["Chiffoniers often feature ornate carvings or designs on the drawers and legs.", "Chiffoniers are usually made of wood, and may have a glossy finish or be painted in a variety of colors."], "bell or wind chime": ["Bells and wind chimes are often hung from a string or chain, and may feature intricate patterns or designs.", "Bells and wind chimes often feature a variety of colors, from bright and vibrant to muted and subtle."], "china cabinet": ["The doors of a china cabinet are often framed with intricate woodwork, such as carved designs or moldings.", "The shelves of a china cabinet are usually lined with glass, allowing the contents to be seen from the outside."], "Christmas stocking": ["Christmas stockings are usually hung from a mantle or other elevated surface, and often feature a loop or hook at the top for easy hanging.", "Christmas stockings are usually filled with small gifts or treats, such as candy, toys, or other festive items."], "church": ["Churches often have large stained glass windows, which are colorful and intricate designs that allow light to enter the building.", "Churches often have a large cross or crucifix prominently displayed on the front of the building."], "movie theater": ["Movie theaters often have a large, flat screen or projection screen visible from the outside.", "Movie theaters often have a ticket booth or kiosk near the entrance.", "Movie theaters often have a concession stand with snacks and drinks."], "cleaver": ["The blade is usually curved and has a sharp edge on one side and a blunt edge on the other.", "The handle of a cleaver is usually made of wood or plastic and is designed to provide a secure grip."], "cliff dwelling": ["The walls of a cliff dwelling are often made of stone or mud bricks, and may be decorated with carvings or paintings.", "The entrance to a cliff dwelling is usually a small opening in the wall, and may be framed with a wooden or stone arch."], "cloak": ["Cloaks often have a distinct shape, with a wide bottom and a narrower top. This shape is often accentuated by a belt or drawstring at the waist.", "Cloaks often feature decorative elements, such as embroidery, tassels, or fur trim. These elements can help distinguish a cloak from"], "clogs": ["Clogs often have a distinct, open-toed design, with a strap or buckle across the top of the foot.", "Clogs often feature a raised heel, which is a signature feature of the shoe."], "cocktail shaker": ["The lid of a cocktail shaker is usually made of metal and has a built-in strainer.", "The body of the shaker is often decorated with a pattern or design, such as a checkered pattern or a geometric shape.", "The handle of the shaker is usually made of metal and is often curved or looped for easy gripping."], "coffee mug": ["Coffee mugs often have a wide base and a tapered top, making them easy to hold and drink from.", "Coffee mugs often have a logo or design printed on them, which can be used to identify the mug."], "coffeemaker": ["Most coffeemakers have a water reservoir, which is used to fill the machine with water.", "Coffeemakers often have a control panel with buttons or dials to adjust the settings. Some models may also have a digital display.", "Many coffeemakers have a filter basket, which is used to hold the ground coffee. This is usually located at the top"], "spiral or coil": ["The lines of a spiral or coil are usually uniform in width and spacing, creating a symmetrical pattern.", "The lines of a spiral or coil often have a repeating pattern, with the same shape and size repeating itself multiple times."], "combination lock": ["The dial or keypad is usually surrounded by a series of numbers or symbols, which are used to set the combination.", "Combination locks often have a small lever or button that must be pressed in order to open the lock."], "computer keyboard": ["The keys are usually labeled with letters, numbers, and symbols.", "Many keyboards have a set of function keys along the top row, and some have a numeric keypad on the right side.", "The keys are usually black or gray, and some keyboards have colored keys for special functions."], "candy store": ["Many candy stores have large signs or banners advertising their products.", "Candy stores often have a variety of containers and jars filled with different types of candy, as well as shelves and racks of packaged candy."], "container ship": ["They often have a large superstructure at the stern, which houses the bridge and other facilities.", "Container ships are usually painted in bright colors, with the name of the ship and its home port prominently displayed on the hull.", "Container ships typically have multiple decks, with large cranes used to load and unload containers."], "convertible": ["Convertibles often have a longer wheelbase than other cars, giving them a more elongated look.", "Convertibles usually have a lower profile than other cars, making them appear sleeker and more aerodynamic."], "corkscrew": ["The metal shaft usually has a sharp point at the end, which is used to puncture the cork.", "The handle of the corkscrew often has a small lever or knob at the end, which is used to pull the cork out of the bottle."], "cornet": ["Cornets have three to four valves, which are used to change the pitch of the instrument.", "Cornets usually have a metal finish, with a brass or silver color."], "cowboy boot": ["The shaft of the boot is usually decorated with intricate stitching, often in a floral or geometric pattern.", "Cowboy boots often have a pull tab at the back of the shaft, which is used to help pull the boot on.", "The sole of the boot is usually made of leather and has a distinct pattern of ridges and grooves."], "cowboy hat": ["The crown of a cowboy hat is usually tall and pointed, with a crease running down the center.", "Cowboy hats often feature a band around the base of the crown, which can be decorated with a variety of materials such as leather, metal, or fabric."], "cradle": ["The head and foot of the cradle are often decorated with carvings or other embellishments.", "The sides of the cradle may be open or closed, and may feature a canopy or other decorative elements."], "construction crane": ["The boom arm is usually supported by a lattice of metal beams, which can be seen from the side.", "The crane is usually mounted on a large, wheeled platform, which allows it to move around the construction site.", "The crane is usually operated by a cab at the top of the boom arm, which is visible from the side."], "crash helmet": ["Crash helmets often feature a chin strap to keep the helmet securely in place.", "Many crash helmets have a visor to protect the eyes from wind, dust, and debris. Visors are usually made of plastic or polycarbonate and come in a variety of colors and tints."], "crate": ["Crates often have metal or wooden slats on the sides, providing structural support and ventilation.", "Crates may have handles or straps on the sides, making them easier to carry.", "Crates may have a logo or label on the outside, indicating the contents or manufacturer."], "infant bed": ["They often have a guardrail on one side to prevent the infant from rolling out of the bed.", "Infant beds often have a canopy or netting to provide a sense of security and privacy.", "They may also have a mobile or other decorations to provide visual stimulation."], "Crock Pot": ["Crock Pots often have a control panel with knobs or buttons to adjust the temperature and cooking time.", "Crock Pots usually have a handle on the side for easy carrying, and some models have a locking lid for added safety."], "croquet ball": ["Croquet balls are usually made of a hard material such as plastic or wood, and have a smooth, glossy finish.", "Croquet balls often have a logo or brand name printed on them, which can be used to identify the ball."], "crutch": ["The poles are usually made of metal or plastic and have a curved handle at the top for the user to grip.", "The crossbar is usually padded for comfort and may have adjustable height settings.", "Crutches often have rubber tips at the bottom of the poles for better grip on the ground."], "cuirass": ["Cuirasses often feature intricate designs, such as embossed patterns, engravings, or etchings.", "Cuirasses are usually worn with a helmet, which may feature a crest or plume."], "dam": ["Dams are usually made of concrete or other materials, and may have a distinct shape or design.", "Dams often have spillways or other outlets to control the flow of water.", "Dams may also have turbines or other machinery to generate electricity."], "desk": ["Desks often have a distinct shape, such as rectangular, L-shaped, or U-shaped.", "Desks may have a variety of features, such as a keyboard tray, shelves, or cubbies."], "desktop computer": ["The tower is usually black or gray and may have the manufacturer's logo or brand name displayed on the front.", "Desktop computers often have a monitor, keyboard, and mouse connected to the tower. The monitor is usually a flat-screen LCD or LED display, while the keyboard and mouse are usually connected via USB or wireless connection."], "rotary dial telephone": ["The dial is usually mounted on the front of the telephone, and is used to dial numbers.", "The telephone also has a receiver, which is a handset with a mouthpiece and an earpiece.", "The telephone is usually mounted on a base, which may have a cord connecting it to the wall."], "diaper": ["The material of the diaper is usually a soft, absorbent fabric.", "Diapers often have a printed pattern or design on them, such as cartoon characters or animals.", "Some diapers have a wetness indicator strip that changes color when the diaper is wet."], "digital clock": ["Digital clocks often have a backlight or illuminated display, making them easier to read in low-light conditions.", "Digital clocks may have buttons or dials for setting the time, as well as other features such as alarms or timers."], "digital watch": ["Digital watches often have buttons or dials on the side or face of the watch. These buttons are used to control the watch's functions.", "Digital watches often have the manufacturer's logo or brand name displayed on the face or band of the watch."], "dining table": ["Dining tables often have four legs, although some may have more or less depending on the design.", "Dining tables may have a variety of materials, such as wood, metal, or glass, and may feature intricate designs or carvings."], "dishcloth": ["Dishcloths are usually rectangular in shape, with a loop or tab at one end for hanging.", "Dishcloths often have a bright, vibrant color, such as yellow, green, or blue."], "dishwasher": ["Dishwashers often have a control panel on the front, which may include buttons, dials, or a digital display.", "Dishwashers may have a manufacturer's logo or brand name displayed on the front panel or door."], "disc brake": ["Disc brakes also have a caliper, which is the part that houses the brake pads and presses them against the rotor when the brakes are applied.", "Disc brakes often have a visible brake line, which is a metal tube that connects the brake caliper to the brake lever."], "dock": ["Docks often have posts or pilings that extend into the water, providing support and stability.", "Docks may also feature a ramp or gangway for easy access to the boat."], "dog sled": ["The sled is usually pulled by a team of dogs, harnessed together in a line.", "The sled is often decorated with colorful flags, bells, and other decorations."], "dome": ["Domes often feature a central opening at the top, which can be used for ventilation or light.", "Domes may have decorative features such as columns, arches, or windows. These features can help to distinguish a dome from other structures."], "doormat": ["Doormats often feature a textured surface, such as a coir or rubber material, to help remove dirt and debris from shoes.", "Doormats often feature a design or logo, such as a welcome message or a company logo."], "drilling rig": ["The rig will usually have a derrick or mast, which is a tall, vertical structure used to support the drill string and hoist equipment.", "The rig will also have a substructure, which is a large, horizontal platform that supports the derrick and other equipment.", "Drilling rigs often have a large number of pipes, hoses, and cables running between the various components."], "drum": ["The head of the drum is usually covered with a thin membrane, which is struck to produce sound.", "Drums often have a stand or mount, which allows them to be held in place while being played.", "Drums may also feature decorative designs or patterns, such as stripes or other shapes."], "drumstick": ["The tip of the drumstick is usually made of a harder material than the rest of the stick, such as wood, plastic, or metal.", "Drumsticks often have a textured grip, such as a knurled pattern, to provide better control and comfort when playing."], "dumbbell": ["Dumbbells often have a rubber or plastic coating to provide a better grip and protect the user from injury.", "The weights are usually marked with the weight in kilograms or pounds, making it easy to identify the size of the dumbbell."], "Dutch oven": ["The lid of a Dutch oven is often domed, with a lip around the edge to help keep the lid in place.", "Dutch ovens often have a ring around the lid, which is used to hang the pot over a fire."], "electric fan": ["Electric fans often have a switch or dial to control the speed of the fan.", "Electric fans usually have a base or stand, which can be either a pedestal or a wall-mounted bracket."], "electric guitar": ["Electric guitars usually have a neck with a fretboard, and a headstock with tuning pegs.", "Electric guitars often have pickups, which are metal or plastic covers that house the magnets that pick up the vibrations of the strings."], "electric locomotive": ["Electric locomotives often have a large pantograph on the roof, which is used to collect power from overhead lines.", "Electric locomotives usually have a large number of windows, which are used to provide visibility for the driver. They also often have a distinctive livery, which can help to identify the locomotive."], "entertainment center": ["Entertainment centers often feature a large, flat-screen television mounted on the wall or placed on top of the unit.", "Entertainment centers may also have built-in speakers, amplifiers, and other audio-visual equipment."], "envelope": ["The flap is usually sealed with adhesive, and may be decorated with a pattern or logo.", "Envelopes often have the address of the recipient printed on the front, along with a stamp or other postage markings."], "espresso machine": ["The portafilter is a handle with a metal filter basket attached, which is used to hold the ground espresso beans.", "Espresso machines often have a pressure gauge, which indicates the pressure of the steam used to extract the espresso.", "Many espresso machines have a steam wand, which is used to froth milk for cappuccinos and"], "face powder": ["The powder itself is usually a light, matte color, and may have a slight shimmer or sparkle.", "The container may have a logo or brand name printed on it, or may be decorated with a pattern or design."], "feather boa": ["The feathers are often arranged in a spiral pattern, with the longest feathers in the center and the shortest feathers on the outside.", "Feather boas often have a thin cord running through the center of the feathers, which helps to keep them in place."], "filing cabinet": ["The drawers are usually labeled with a letter or number, making them easy to identify.", "Filing cabinets often have handles on the drawers, making them easy to open and close.", "The drawers are usually made of metal, making them appear shiny in photos."], "fireboat": ["Fireboats often have multiple water cannons mounted on the deck, which are used to direct powerful streams of water at fires.", "Fireboats are usually brightly colored, often with red and yellow stripes, and may have the name of the fire department or city they serve painted on the side."], "fire truck": ["Fire trucks often feature a large ladder on the back, which can be extended to reach high places.", "Fire trucks usually have a large water tank on the back, and may also have a hose reel and other equipment.", "Fire trucks often have a large, loud siren on the roof, which is used to alert people of an emergency."], "fire screen": ["Fire screens often have a curved or arched top, which is designed to keep sparks and embers from flying out of the fireplace.", "Fire screens usually have a handle or two on either side, allowing them to be moved easily."], "flagpole": ["Flagpoles often have a halyard, which is a rope or cable used to raise and lower the flag.", "Flagpoles may also have a finial, which is a decorative ornament at the top of the pole."], "flute": ["Flutes have a series of finger holes along the body, which are used to change the pitch of the notes.", "Flutes often have a metal mouthpiece at the end, which is used to blow air into the instrument."], "folding chair": ["The frame is usually collapsible, with two or more sections that can be folded together for easy storage.", "The legs of the chair are usually connected by a crossbar, which can be used to lock the chair in an open or closed position."], "football helmet": ["The helmet is usually decorated with the team's logo or colors, making it easy to identify.", "Football helmets often have a large, padded interior to protect the head and neck of the wearer."], "forklift": ["Forklifts have two large, pronged forks that extend from the front of the vehicle. These forks are used to lift and transport heavy objects.", "Forklifts are usually powered by an internal combustion engine, and often have a large exhaust pipe protruding from the back."], "fountain": ["Fountains often have ornate designs, such as sculptures, statues, or other decorations.", "Fountains may also feature lights or other features, such as mist or fog, to create a more dramatic effect."], "fountain pen": ["The nib of a fountain pen is usually made of metal and is the part that touches the paper. It is usually pointed and can come in a variety of shapes and sizes.", "Fountain pens often have a cap that covers the nib when not in use. This cap is usually made of metal or plastic and can be decorated with engravings or logos."], "four-poster bed": ["The posts are often ornately carved or decorated, and may be topped with finials or other decorative elements.", "The bed frame may be draped with fabric or curtains, which can be used to create a canopy or other decorative effect."], "freight car": ["Freight cars often have large doors on one or both sides, which are used to load and unload cargo.", "Freight cars are usually painted in a bright color, such as yellow, orange, or red, and often feature the logo of the railroad company that owns them."], "French horn": ["The instrument is usually made of brass, and has a long, coiled tubing that wraps around the body.", "French horns have three or four valves, which are used to change the pitch of the instrument. These valves are usually located near the bell of the instrument."], "frying pan": ["The handle of a frying pan is usually long and curved, allowing for easy maneuvering.", "Frying pans often have a non-stick coating, which can be seen as a glossy finish on the surface."], "fur coat": ["Fur coats often have a glossy sheen, which can be seen in the photo.", "Fur coats usually have a thick, luxurious feel, and the fur may be visible in the photo.", "Fur coats often have a hood or collar, which can be seen in the photo."], "garbage truck": ["They often have a large, hydraulic arm extending from the side of the truck, used to lift and dump garbage bins.", "Garbage trucks are usually brightly colored, often with a yellow or green body and a black or blue bed. They may also feature the company's logo or name on the side."], "gas mask or respirator": ["The filter is usually a cylindrical shape and is usually colored black or grey.", "The straps of the mask are usually adjustable and are often made of rubber or elastic material.", "The mask itself is usually made of a hard plastic material and is designed to fit snugly against the face."], "gas pump": ["The nozzle is usually connected to a hose, which is often coiled up and stored on the side of the pump.", "Most gas pumps have a digital display that shows the current price of fuel, as well as the amount of fuel dispensed.", "Many gas pumps also feature a payment terminal, which may be a card reader or a keypad."], "goblet": ["Goblets often have a decorative base, which can be ornate or plain.", "The cup of a goblet is usually made of glass or metal, and may be decorated with etchings, engravings, or other designs."], "go-kart": ["Go-karts often have a roll cage or frame surrounding the driver, providing protection in the event of a crash.", "Go-karts are usually powered by a small engine, such as a lawnmower engine, and have a chain-driven rear axle."], "golf ball": ["The dimples are usually evenly spaced and symmetrical, and can range from shallow to deep.", "Golf balls often have a logo or brand name printed on them, which can be used to identify the ball."], "golf cart": ["They often feature a distinctive, boxy shape with a flat roof and a short wheelbase.", "Golf carts are usually painted in bright colors, such as yellow, green, or blue. They may also feature the logo of the golf course or manufacturer.", "Golf carts are usually equipped with a steering wheel, accelerator, and brake pedals."], "gondola": ["Gondolas are usually painted in a distinctive black and white striped pattern.", "Gondolas are often seen with a single oarman standing in the stern, using a single oar to propel the boat.", "Gondolas are often seen with a canopy or awning covering the passengers."], "gong": ["Gongs often have a raised center, which is known as the boss.", "Gongs are usually decorated with intricate patterns or symbols, which can help to distinguish them from other percussion instruments.", "Gongs are usually suspended from a frame or stand, which can also help to identify them in a photo."], "gown": ["Gowns often have intricate details such as lace, beading, or embroidery. These details can be used to distinguish a gown from other types of clothing.", "Gowns often have a distinct neckline, such as a V-neck, scoop neck, or sweetheart neckline. This can be used to identify a gown"], "grand piano": ["Grand pianos have three pedals at the bottom, which are used to control the sound and volume of the instrument.", "Grand pianos usually have a glossy finish, and the keys are often black and white."], "greenhouse": ["Greenhouses often have a distinct shape, such as a dome, arch, or lean-to.", "Greenhouses are usually surrounded by a frame or structure, which can be made of wood, metal, or plastic."], "radiator grille": ["The grille is usually located at the front of the vehicle, and may be framed by a bumper or other bodywork.", "Radiator grilles often feature the manufacturer's logo or brand name."], "grocery store": ["Grocery stores typically have large parking lots with cars parked in them.", "Grocery stores often have aisles of shelves stocked with food items, as well as refrigerated sections for dairy and produce.", "Grocery stores often have checkout counters with cash registers and conveyor belts."], "guillotine": ["The blade is usually curved and can be seen from the side.", "The frame of the guillotine is usually made of wood or metal and has a handle or lever at the bottom.", "The blade is usually connected to the frame by a rope or chain."], "hair clip": ["Hair clips often feature decorative elements such as beads, rhinestones, or other embellishments.", "Hair clips are usually made of metal, plastic, or other materials, and may be brightly colored or have a metallic finish."], "hair spray": ["The cans are usually brightly colored and feature the brand name and product name prominently.", "The nozzle of the can is often a different color than the rest of the can, and may feature a locking mechanism to prevent accidental spraying."], "half-track": ["Half-tracks usually have a cab for the driver and passengers, and a cargo area in the back. The cargo area is often covered by a canvas tarp or metal roof.", "Half-tracks are usually equipped with a machine gun or other armament mounted on the roof or sides"], "hammer": ["The handle of a hammer is usually made of wood or plastic and is usually cylindrical in shape.", "The head of a hammer is usually decorated with a pattern or logo of the manufacturer."], "hamper": ["Hampers often have lids or covers, which can be opened or closed. This is a useful feature for distinguishing a hamper from other objects.", "Hampers are usually tall and cylindrical in shape, with a handle on the top for easy carrying. This is a useful feature for distinguishing a hamper from"], "hair dryer": ["Hair dryers often have a handle or grip for easy maneuvering.", "Many hair dryers have a switch or button to turn them on and off, as well as a temperature setting dial.", "Hair dryers may also have a concentrator nozzle attachment, which is a narrow nozzle that directs the airflow for more precise styling."], "hand-held computer": ["Hand-held computers often have a physical home button, which is usually located at the bottom of the device.", "Hand-held computers usually have a camera lens located on the back of the device, which is usually circular in shape.", "Hand-held computers often have a headphone jack located on the top or side of the device."], "handkerchief": ["Handkerchiefs often feature a pattern or design, such as a floral print, polka dots, or stripes.", "Handkerchiefs are usually made of lightweight fabric, such as cotton or silk, and may be plain or brightly colored."], "hard disk drive": ["The casing is usually silver or black in color and may have the manufacturer's logo or brand name printed on it.", "Hard disk drives have a number of ports and connectors on the back, including power, data, and audio/video."], "harmonica": ["The reeds are usually arranged in two rows, with the lower row containing the lower-pitched notes and the upper row containing the higher-pitched notes.", "The holes are usually arranged in a symmetrical pattern, with the lower-pitched notes on the left and the higher-pitched notes on the right."], "harp": ["The strings of a harp are usually arranged in a symmetrical pattern, with the strings running from the top of the frame to the bottom.", "The strings are usually made of metal or nylon, and the number of strings can vary depending on the type of harp.", "The soundboard of a harp is usually made of wood and is located at the base of the frame."], "combine harvester": ["The cab typically has a large window at the front, allowing the operator to see the field ahead.", "The threshing drum is usually covered in a mesh or metal grille, and is often brightly colored.", "Combine harvesters are usually accompanied by a large grain cart, which is used to collect the harvested grain."], "hatchet": ["The blade is usually made of metal and has a sharp, angled edge.", "The handle is usually made of wood or plastic and may have a grip or a textured surface for better control.", "Hatchets often have a hole at the end of the handle for hanging or storage."], "holster": ["Holsters often have a distinct shape, such as a curved or angled design, to accommodate the shape of the firearm.", "Many holsters feature a retention strap or thumb break to secure the firearm in place. This strap is usually made of leather or nylon and is often visible in the photo."], "home theater": ["Home theaters often have multiple speakers, either mounted on the wall or placed around the room.", "Home theaters may also feature a soundbar, which is a long, thin speaker that sits below the television.", "Home theaters may also have a subwoofer, which is a large, box-shaped speaker that produces low-frequency sound."], "honeycomb": ["The cells are often filled with a golden-yellow honey, which is visible through the thin walls of the cells.", "Honeycombs are often found in a cluster, with multiple combs connected to each other."], "hook": ["Hooks often have a hole or loop at the base, allowing them to be attached to a wall or other surface.", "Hooks may be made of metal, plastic, or wood, and may be painted or unpainted."], "hoop skirt": ["The skirt is usually held up by a waistband or belt, and may feature decorative elements such as lace, ruffles, or bows.", "The skirt is often supported by several metal or plastic hoops, which give the skirt its signature shape."], "gymnastic horizontal bar": ["The bar is usually painted in a bright color, such as yellow or blue, to make it stand out.", "The bar is usually set at a height of around 1.5 meters, and is often surrounded by a mat for safety.", "The bar is usually set at a slight angle, with the lower end slightly higher than the upper end."], "horse-drawn vehicle": ["The vehicle is usually pulled by one or more horses, which are usually harnessed to the vehicle with straps or reins.", "Horse-drawn vehicles often feature a driver's seat, which is usually elevated and located at the front of the vehicle."], "hourglass": ["The two chambers are usually filled with sand or other granular material, and the hourglass is often turned upside down to measure a set amount of time.", "Hourglasses often feature a wooden or metal frame to hold the glass container in place, and some may have a stand or handle for easy handling."], "iPod": ["The iconic click wheel is a signature feature of iPods, and is usually located on the front of the device.", "iPods often have the Apple logo prominently displayed on the back of the device."], "clothes iron": ["The base of the iron is usually made of metal and has a steam vent or holes for steam to escape.", "The handle of the iron is usually made of plastic and has a switch or button to turn the iron on and off.", "The soleplate of the iron is usually made of metal and has a smooth, shiny surface."], "carved pumpkin": ["The surface of a carved pumpkin is usually textured, with ridges and bumps from the carving process.", "Carved pumpkins often have a face or other design carved into the surface, with eyes, a nose, and a mouth. These features are usually highlighted with a contrasting color, such as white or orange."], "jeans": ["Jeans often have a distinct stitching pattern, usually in a contrasting color.", "Jeans usually have pockets, belt loops, and a zipper fly. These features are often used to distinguish jeans from other types of pants."], "jeep": ["Jeeps often have a distinctive seven-slot grille, which is a signature feature of the brand.", "Jeeps usually have large, off-road tires and a raised suspension, which gives them a rugged, outdoorsy look.", "Jeeps often have a spare tire mounted on the back, which is another signature feature."], "T-shirt": ["The fabric of a T-shirt is usually lightweight and stretchy, and may be plain or patterned.", "T-shirts often feature a logo, graphic, or text printed on the front or back."], "jigsaw puzzle": ["The pieces of a jigsaw puzzle are usually cut in a unique way, with interlocking tabs and notches that fit together to form the complete image.", "The edges of the pieces are often curved or irregular, making them stand out from other objects in the photo."], "rickshaw": ["The cart is usually pulled by a person or animal, and is often brightly colored or decorated with intricate designs.", "Rickshaws often have a canopy or roof to protect passengers from the elements. This canopy is usually made of fabric or plastic and is often brightly colored."], "joystick": ["Joysticks often have a directional pad or hat switch on the top of the handle. This is used to control the direction of the joystick.", "Joysticks may also have a throttle or rudder control on the side of the handle. This is used to control the speed or rotation of the joystick."], "kimono": ["Kimonos often feature intricate patterns and designs, such as floral motifs, geometric shapes, or traditional Japanese symbols.", "Kimonos are usually worn with an obi, a wide sash that is tied around the waist. The obi is often brightly colored and can be used to distinguish a kimono from other garments."], "knee pad": ["They often feature a hard outer shell, usually made of plastic or rubber, to protect the knee from impact.", "Knee pads often have straps or elastic bands to secure them in place. These straps may be adjustable or fixed.", "Knee pads may also feature cushioning or padding to provide additional comfort."], "knot": ["Knots often have a distinct center point, where the strands of the knot converge.", "Knots can be tied in a variety of materials, such as rope, string, or fabric, and the texture of the material can be used to distinguish the knot."], "lab coat": ["Lab coats often have a collar, buttons, and pockets.", "Lab coats may have a logo or name of the laboratory or institution printed on the chest or back."], "ladle": ["The handle of a ladle is usually thin and cylindrical, and may have a loop or hook at the end for hanging.", "The scoop of a ladle is usually wide and deep, and may have a spout or pouring lip at the end."], "lampshade": ["Lampshades are often made of fabric, paper, or metal, and can be decorated with patterns or designs.", "Lampshades often have a metal or plastic frame that holds the fabric or paper in place. This frame is usually visible in the photo."], "laptop computer": ["The laptop's screen is usually rectangular and is often surrounded by a thin bezel.", "The laptop's keyboard is usually located below the screen and is typically backlit.", "The laptop's trackpad is usually located below the keyboard and is often marked with a distinct logo.", "Many laptops have the manufacturer's logo or brand name displayed on the lid or be"], "lawn mower": ["The cutting deck is usually located at the bottom of the mower and is usually made of metal.", "Lawn mowers often have a wheel at each corner, allowing them to be pushed around the lawn.", "The blades of the mower are usually visible and can be identified by their distinct shape."], "lens cap": ["Lens caps often have a textured surface, such as a ribbed pattern, to make them easier to grip.", "Lens caps usually have the manufacturer's logo or brand name printed on them."], "letter opener": ["The handle of a letter opener is usually made of metal or plastic and may feature a decorative design or logo.", "Letter openers often have a curved or hooked end, which is used to slide under the envelope flap and open it."], "library": ["Libraries often have a distinct architecture, with tall ceilings, long hallways, and large open spaces.", "Libraries often have bookshelves, tables, and chairs, as well as other furniture and decorations.", "Libraries often have signs or logos indicating the library's name or affiliation."], "lifeboat": ["Lifeboats are usually equipped with oars or paddles, which can be seen in the photo.", "Lifeboats often have a canopy or roof, which can be seen in the photo.", "Lifeboats are usually equipped with a motor, which can be seen in the photo."], "lighter": ["They often have a metal or plastic casing, with a flint wheel and a trigger mechanism.", "Many lighters have a brand logo or name printed on the side.", "Some lighters have a transparent window to show the fuel level."], "limousine": ["Limousines often feature a partition between the driver and passenger compartments, as well as tinted windows.", "Limousines are usually equipped with luxury features such as a bar, television, and sound system."], "ocean liner": ["Ocean liners often have a distinctive bow, or front, with a large, curved shape.", "Ocean liners usually have multiple smokestacks, which are used to expel exhaust from the ship's engines.", "Ocean liners often have a large number of windows, which are typically arranged in a symmetrical pattern."], "lipstick": ["Lipsticks often have a glossy finish and a pointed tip.", "Many lipsticks have a brand name or logo printed on the tube."], "slip-on shoe": ["Slip-on shoes often have elastic panels on the sides, allowing them to be easily slipped on and off.", "Slip-on shoes often have a distinct shape, with a rounded toe and a slightly raised heel."], "lotion": ["Lotions often have a label or logo on the container, which can help identify the product.", "Lotions usually have a creamy or oily texture, which can be seen in the photo."], "music speaker": ["Music speakers usually have a grille covering the front of the speaker, which can be a mesh or a solid material.", "Music speakers often have a logo or brand name displayed on the grille or the body of the speaker."], "loupe magnifying glass": ["The lens of the loupe magnifying glass is usually convex, meaning it is curved outward.", "Loupe magnifying glasses often have a metal frame, which can be either silver or gold in color."], "sawmill": ["Sawmills often have a large saw blade, either circular or band-style, which is used to cut logs into lumber.", "Sawmills often have a conveyor belt or other system to move the logs through the saw blade.", "Sawmills may also have a large stack of lumber, either cut or uncut, nearby."], "magnetic compass": ["The base of the compass is usually marked with a degree scale, allowing for precise navigation.", "The needle or arrow is usually colored red or black, and is often surrounded by a transparent plastic casing."], "messenger bag": ["Messenger bags often have a large, rectangular shape with a flap closure.", "Messenger bags often feature multiple pockets and compartments for organizing items. They may also have a buckle or drawstring closure."], "mailbox": ["Most mailboxes feature a flag, which is used to indicate to the mail carrier that there is mail to be collected.", "Mailboxes often have the address of the recipient printed on the side or front."], "maillot": ["Maillots often have a distinct pattern or design, such as stripes, polka dots, or floral prints.", "Maillots are usually made of lightweight, stretchy fabrics, such as lycra or spandex."], "one-piece bathing suit": ["The neckline of a one-piece bathing suit is usually higher than a two-piece, and may feature a scoop, halter, or racerback style.", "One-piece bathing suits often have a variety of straps, ties, or cutouts that add visual interest and can help distinguish them from other swimwear."], "manhole cover": ["They often feature a raised lip or edge around the perimeter.", "Manhole covers are usually made of metal and feature a pattern of holes or slots.", "They often have a logo or other identifying mark stamped into the metal."], "maraca": ["The body of the maraca is usually made of wood, plastic, or metal, and is filled with small beads or seeds that create a rattling sound when shaken.", "Maracas often feature bright colors and patterns, such as stripes or polka dots, to make them visually appealing."], "marimba": ["The bars are usually supported by a frame, which is often made of metal or wood.", "Marimbas often have a set of pedals at the bottom of the instrument, which are used to adjust the pitch of the bars."], "mask": ["Masks often feature decorative elements, such as intricate patterns, bright colors, or sequins.", "Masks are usually worn over the nose and mouth, so they will often have two holes for the eyes and one for the mouth."], "matchstick": ["Matchsticks often have a red or black tip, which is the striking surface used to ignite the match.", "Matchsticks may have a logo or brand name printed on the side, which can be used to identify the matchstick."], "maypole": ["The pole is usually made of wood or metal and is often painted or decorated with symbols or patterns.", "The ribbons or streamers are usually brightly colored and hang down from the top of the pole in a spiral pattern."], "maze": ["The pathways of a maze often form a loop, with a start and end point.", "Mazes can feature dead ends, or false pathways that lead nowhere.", "Mazes may also feature obstacles or puzzles that must be solved in order to progress."], "measuring cup": ["The cup is often marked with measurements in milliliters, cups, or ounces.", "The cup is usually made of plastic or metal and is often transparent, allowing the user to see the contents inside."], "medicine cabinet": ["The door may have a handle or knob for easy access.", "The cabinet may be mounted on the wall or recessed into the wall.", "The cabinet may have a lock or latch to keep the contents secure.", "The cabinet may have shelves or drawers for organizing items."], "megalith": ["Megaliths often feature distinct carvings or patterns, such as spirals, circles, or zig-zags.", "Megaliths are usually found in clusters or groups, and can be seen from a distance due to their size."], "microphone": ["The head of the microphone is usually covered with a metal mesh or foam windscreen.", "Many microphones have a logo or brand name printed on the body or head.", "Some microphones have a switch or dial on the body for adjusting the gain or other settings."], "microwave oven": ["The door is usually made of metal or glass, and may have a handle or a button to open it.", "The control panel is usually located on the top or side of the oven, and may feature a digital display, buttons, or dials.", "The interior of the oven is usually made of metal and may have a rotating turntable."], "military uniform": ["Many uniforms feature patches, badges, and other insignia that denote rank, unit, or other information.", "Military uniforms often have pockets, epaulettes, and other features that are not found on civilian clothing."], "milk can": ["Milk cans often have a handle on the side, making them easy to carry.", "Milk cans are usually made of metal, and may have a glossy or matte finish. They may also be painted with a logo or other identifying marks."], "minibus": ["Minibuses usually have multiple rows of seating, with windows along the sides and rear.", "Minibuses often have a sliding door on the side or rear, and may have a luggage compartment at the back."], "miniskirt": ["They often feature a tight fit, hugging the wearer's curves.", "Miniskirts often have a flared or pleated design, which gives them a distinct look.", "They are often made of lightweight fabrics such as cotton, linen, or polyester."], "minivan": ["Minivans often have sliding side doors, which are a signature feature of the vehicle type.", "Minivans usually have a large windshield and a wide grille, which are both distinct features.", "Many minivans have a third row of seating, which is a unique feature of the vehicle type."], "missile": [" Many missiles have fins or wings near the rear of the body, which help to stabilize the missile in flight.", " Missiles often have a visible exhaust plume, which is created by the burning of fuel as the missile accelerates."], "mitten": ["Mittens often have a distinct pattern or design, such as stripes, polka dots, or a solid color.", "Mittens are usually made of a soft material, such as wool, cotton, or synthetic fibers."], "mixing bowl": ["They often have a handle on one side and a spout on the other, making them easy to pour from.", "Mixing bowls are usually made of metal, glass, or ceramic, and may have a pattern or design on the outside."], "mobile home": ["Mobile homes often have a single door at the front, and several windows along the sides.", "Mobile homes are usually built on a metal frame, which is visible from the outside.", "Mobile homes are often set on a concrete foundation or blocks, which can be seen in the photo."], "ford model t": ["The Model T has a unique two-piece windshield, with the top half folding down to allow for ventilation.", "The Model T has a large, round radiator grille with a distinctive Ford logo in the center.", "The Model T has a large, round headlamp on either side of the grille.", "The Model T has a flat, rectangular dashboard with"], "modem": [" Modems often have a manufacturer's logo or brand name displayed on the front or side of the device.", " Modems usually have several indicator lights, which can be used to tell if the device is powered on, connected to the internet, or transmitting data."], "monastery": ["Monasteries often have large courtyards or gardens, with pathways and benches for contemplation.", "Monasteries often have a large bell tower, which is used to call the monks to prayer.", "Monasteries often feature large, ornate gates or doors, which are often decorated with religious symbols."], "monitor": ["Monitors often have thin bezels surrounding the screen.", "Monitors usually have a stand that can be adjusted to different angles.", "Monitors often have the manufacturer's logo or brand name displayed on the bezel, stand, or occasionally on the screen itself during startup."], "moped": ["Mopeds often have a step-through frame, meaning the rider can straddle the frame and sit comfortably.", "Mopeds usually have a low-powered engine, usually 50cc or less, and are often equipped with pedals for manual propulsion. They also often have a distinctive exhaust pipe."], "mortar and pestle": ["The mortar is usually larger than the pestle, and has a rough, pitted texture on the inside.", "The pestle is usually smaller than the mortar, and has a rounded end for grinding ingredients."], "graduation cap": ["The tassel is usually a different color than the cap, and is often the school's colors or the student's major.", "The cap is usually adorned with a gold or silver tassel holder, which is a metal or plastic ornament that holds the tassel in place."], "mosque": ["The entrance to a mosque is usually marked by a tall, ornate archway.", "Mosques often have a tall, slender minaret tower, which is used to call the faithful to prayer.", "The interior of a mosque is often decorated with intricate geometric patterns and colorful tiles."], "mosquito net": ["The netting is usually held up by a frame, which can be made of metal, wood, or plastic. This frame is usually visible in the photo.", "The netting is usually draped over a bed or other sleeping area, and the shape of the netting can be used to distinguish it from other objects in the photo."], "vespa": ["Vespas often feature a round headlight, which is usually mounted on the front shield.", "Vespas are usually painted in bright colors, such as red, yellow, or blue. They may also feature unique designs or patterns."], "mountain bike": ["Mountain bikes often have knobby tires with deep treads for better traction on rough terrain.", "Mountain bikes usually have a suspension system, either in the form of a front fork or a full-suspension frame. This helps absorb shock and makes the ride more comfortable."], "tent": ["Tents are usually made of a lightweight, waterproof material, such as nylon or canvas. This material is often brightly colored, making it easy to spot in a photo.", "Tents often have a door flap or zipper, which can be used to enter and exit the tent. This feature is usually visible in a photo."], "computer mouse": [" The shape of the mouse is usually curved and ergonomic, designed to fit comfortably in the user's hand.", " The bottom of the mouse usually has a rubber or plastic pad to allow it to move smoothly on a surface.", " The cord of the mouse is usually visible, and can be used to identify the type of mouse."], "mousetrap": ["The most recognizable feature of a mousetrap is the spring-loaded bar, which is designed to snap shut when triggered.", "Many mousetraps have a bait holder, which is designed to hold food or other attractants to lure the mouse into the trap."], "moving van": ["They often feature a large, bold logo or name of the moving company on the side of the van.", "Moving vans usually have large, sliding side doors and a rear door that opens up for loading and unloading.", "They often have a ramp or liftgate at the back for easy loading and unloading of heavy items."], "muzzle": ["The muzzle will usually have a buckle or clasp that allows it to be secured around the animal's snout.", "The muzzle will often have a loop or handle at the top, allowing the handler to control the animal."], "metal nail": ["The head of the nail is usually flat and may have a raised or indented pattern.", "The color of the nail is usually silver or gray, but may vary depending on the type of metal used."], "neck brace": ["Neck braces often have adjustable straps or buckles to ensure a snug fit.", "Neck braces may also feature padding or cushioning to provide comfort and support."], "necklace": ["Necklaces can be made of a variety of materials, such as metal, plastic, wood, or beads.", "Necklaces often feature a clasp or hook that allows the wearer to fasten the necklace around their neck."], "baby pacifier": ["The handle of the pacifier is usually made of plastic and is often decorated with bright colors or patterns.", "The handle is usually connected to the nipple by a ring or clip, which is often made of metal."], "notebook computer": ["Notebook computers often have a trackpad or touchpad located below the keyboard.", "Notebook computers usually have a manufacturer's logo or brand name displayed on the lid or bezel.", "Notebook computers often have ports for connecting external devices, such as USB, HDMI, and audio jacks."], "obelisk": ["Obelisks often feature inscriptions or hieroglyphs on their sides, which can be used to identify them.", "Obelisks are usually made of stone, and may feature intricate carvings or patterns on their surfaces."], "oboe": ["Oboes have a double reed mouthpiece, which is a unique feature that sets them apart from other woodwind instruments.", "Oboes have a range of keys and buttons along the body, which are used to adjust the pitch and tone of the instrument."], "ocarina": ["Ocarinas often have a distinct, curved shape with a protruding neck.", "Ocarinas usually have a decorative pattern or design on the surface, such as a floral motif or geometric shapes."], "odometer": ["Odometers often have a reset button or knob, which is used to reset the odometer to zero.", "Odometers may also feature a trip meter, which is used to measure the distance traveled since the last reset."], "oil filter": ["Oil filters often have a metal or plastic housing with a paper or synthetic filter element inside.", "Oil filters may have a brand name or logo printed on the housing, as well as a size or part number."], "pipe organ": ["The pipes are usually arranged in a series of ranks, with the tallest pipes at the back and the shortest at the front.", "The console of a pipe organ is usually located at the front of the instrument, and is typically made of wood and metal. It houses the keyboards, stops, and other controls used to play the instrument."], "oscilloscope": ["Oscilloscopes usually have a set of knobs and buttons on the front panel, used to control the device.", "Oscilloscopes often have a set of probes connected to the device, used to measure electrical signals."], "overskirt": ["Overskirts often have a high waistline, which is usually accentuated with a belt or sash.", "Overskirts may feature decorative details such as lace, ruffles, or pleats."], "bullock cart": ["The wheels of a bullock cart are usually made of wood and are often quite large.", "The cart is usually pulled by two oxen, which are connected to the cart by a yoke. The yoke is usually made of wood or metal and is connected to the cart by ropes or chains.", "The cart is often decorated with colorful fabrics and ornaments, and"], "oxygen mask": ["Oxygen masks are often connected to a tube or hose, which is used to deliver oxygen to the wearer.", "Oxygen masks are usually equipped with adjustable straps, which are used to secure the mask to the wearer's face."], "product packet / packaging": ["Product packets / packaging often have a distinct shape, such as a box, pouch, or bag.", "Product packets / packaging often have a unique color scheme, such as a bright color or a combination of colors.", "Product packets / packaging often have text or images printed on them, such as instructions, ingredients, or nutritional information."], "paddle": ["The blade of a paddle is usually made of wood, plastic, or metal, and is often curved or angled to provide more power when striking the water.", "Paddles often have a grip or handle at the end of the handle, which is used to hold the paddle securely while paddling."], "paddle wheel": ["The paddles are usually evenly spaced around the wheel and can be made of metal, wood, or plastic.", "The paddles are often connected to a central hub or axle, which is usually visible in the photo."], "padlock": ["Padlocks often have a distinct shape, such as a circle, oval, or rectangle.", "Padlocks usually have a keyhole or combination dial for unlocking.", "Padlocks may have a manufacturer's logo or brand name displayed on the body."], "paintbrush": ["The bristles of a paintbrush are usually made of either natural or synthetic materials, and can be either stiff or soft.", "Paintbrushes often have a metal ferrule that holds the bristles in place, and can be identified by its cylindrical shape."], "pajamas": ["Pajamas often have a drawstring or elastic waistband, allowing for a snug fit.", "Pajamas may feature a variety of patterns, such as stripes, polka dots, or floral designs. They may also feature cartoon characters or other designs."], "palace": ["Palaces often feature grand staircases, balconies, and terraces.", "Palaces are often surrounded by lush gardens and grounds, with fountains, ponds, and other landscaping features."], "pan flute": ["The tubes are usually made of bamboo, wood, or metal, and are often decorated with colorful designs or patterns.", "The mouthpiece of the pan flute is usually located at one end of the instrument, and is often made of a different material than the tubes."], "paper towel": ["Paper towels often have a quilted or embossed pattern, which is a signature feature.", "Paper towels are usually found in rolls, with a cardboard or plastic core in the center."], "parachute": ["Parachutes often have a central vent or hole in the middle of the canopy, which helps to slow the descent of the person or object attached to the parachute.", "Parachutes are usually suspended from a set of cords or lines, which are connected to the harness or straps. These cords or lines are usually visible in the photo."], "parallel bars": ["The bars are usually mounted on a frame, which can be either a single pole or a set of four poles.", "The bars are usually painted in a bright color, such as yellow or blue, to make them more visible.", "The bars are usually set at a certain height, and the gap between them is usually consistent."], "park bench": ["The seat and backrest are usually made of wood or metal, and may be decorated with carvings or other designs.", "Park benches often have armrests on either side, and may feature a center armrest or table.", "Park benches are usually placed in a public area, such as a park or plaza."], "parking meter": ["They often have a coin slot at the top, and a display screen or window at the bottom.", "Parking meters are usually painted in bright colors, such as yellow, green, or blue.", "They often have a sign or label indicating the cost of parking, as well as instructions for use."], "railroad car": ["Railroad cars often have large, sliding doors on either side, which are used for loading and unloading cargo.", "Railroad cars are usually painted in bright colors, such as yellow, red, or blue, and often feature the railroad company's logo or name."], "patio": ["Patios often have furniture, such as tables, chairs, and benches.", "Patios may have a railing or fence around the perimeter.", "Patios may have a roof or awning for shade.", "Patios may have planters or other decorative elements."], "payphone": ["Payphones often have a coin slot or card reader, as well as a keypad for dialing.", "Payphones may also have a directory or instructions printed on the side or back of the unit."], "pedestal": ["Pedestals often have a distinct shape, such as a square, rectangle, or circle.", "Pedestals may have decorative features such as carvings, engravings, or other embellishments."], "pencil case": ["They often have a zipper or other closure mechanism to keep the contents secure.", "Pencil cases often have a handle or strap for easy carrying. Some may also feature pockets or compartments for additional storage."], "pencil sharpener": ["The handle is usually made of plastic or metal, and is used to turn the sharpening blade.", "The sharpening blade is usually made of metal and is exposed when the pencil sharpener is in use. It is usually shaped like a cone or a spiral."], "perfume": ["Many perfume bottles feature a label or logo, which can help identify the brand or scent.", "Perfumes often have a spray nozzle or pump, which can be used to dispense the scent."], "Petri dish": ["The sides of the dish are usually slightly raised, forming a shallow bowl.", "Petri dishes are often labeled with the manufacturer's logo or name, as well as the size of the dish."], "photocopier": ["Photocopiers often have a control panel with buttons and a display screen.", "Photocopiers usually have a paper tray at the bottom, which is used to feed paper into the machine.", "Photocopiers often have a paper output tray at the top, which is used to collect the printed documents."], "plectrum": ["They often have a logo or brand name printed on them.", "They come in a variety of colors, shapes, and sizes, so look for any distinguishing features that may help identify the plectrum."], "Pickelhaube": ["The helmets are usually made of leather and feature a metal spike and metal trim around the edges.", "The helmets often have a metal plate with a crest or emblem on the front, which can help to identify the wearer's unit or rank."], "picket fence": ["The posts are usually pointed at the top, giving the fence a distinctive look.", "The boards or rails are usually painted white, although other colors are possible.", "The gaps between the posts are usually uniform, although some designs feature varying widths."], "pickup truck": ["Pickup trucks often have a large, tall grille in the front, which is usually decorated with the manufacturer's logo or brand name.", "Pickup trucks usually have four doors, with two on each side, and a large cab in the front. The cab is usually taller than the cargo bed, and is often decorated with chrome accents."], "pier": ["Piers often have railings or posts along the sides, which can be used to tie up boats or provide a barrier between the pier and the water.", "Piers may also feature benches, lights, or other structures, such as a gazebo or pavilion, at the end."], "piggy bank": ["Piggy banks often have a slot on the top for coins to be inserted.", "Piggy banks are usually made of ceramic, plastic, or metal, and may be decorated with colorful designs or patterns."], "pill bottle": ["Pill bottles often have a label with the name of the medication, dosage, and other information printed on it.", "Pill bottles usually have a child-proof cap, which requires two hands to open."], "pillow": ["Pillows often have a fabric cover, which can be patterned or plain.", "Pillows may have a distinct texture, such as a quilted or tufted surface.", "Pillows may have a tag or label attached to them, which can help identify the manufacturer."], "ping-pong ball": ["The ball is usually round and has a diameter of 40mm.", "The surface of the ball is usually textured with small dimples."], "pinwheel": ["The blades of a pinwheel are usually made of paper or plastic and are often decorated with patterns or designs.", "Pinwheels are usually mounted on a stick or handle, which is used to spin the wheel."], "pirate ship": ["The hull of a pirate ship is usually long and narrow, with a raised bow and stern.", "Pirate ships often feature a skull and crossbones flag, which is a signature feature of any pirate vessel.", "Pirate ships often have multiple cannons mounted on the sides, which can be used to fire upon other ships."], "drink pitcher": ["The shape of the pitcher can vary, but they are usually tall and cylindrical.", "The material of the pitcher can also vary, but they are usually made of glass, ceramic, or plastic.", "Drink pitchers often have a lid or stopper to keep the contents inside."], "block plane": ["The blade of a block plane is usually set at a low angle, and is often visible when the plane is viewed from the side.", "The blade is usually adjustable, and can be adjusted by turning a knob or lever on the side of the plane.", "Block planes often have a wooden handle, which is usually curved and ergonomically designed for comfortable use."], "planetarium": ["Inside the dome, there are usually several rows of seating, allowing visitors to look up at the stars projected onto the ceiling.", "Planetariums often have a projector at the center of the dome, which is used to project the stars and other celestial bodies onto the ceiling."], "plastic bag": ["Plastic bags often have a glossy sheen, reflecting light in a unique way.", "Plastic bags often have a logo or brand name printed on them, making them easily identifiable.", "Plastic bags often have handles or drawstrings, making them easy to carry."], "plate rack": ["Plate racks often have a distinct design, with curved edges or decorative patterns.", "Plate racks may also feature a back panel, which can be made of metal or wood and may have a decorative pattern or design."], "farm plow": ["The blade is usually attached to a frame, which is connected to a handle or handles.", "Farm plows often have a wheel or wheels at the back, which helps to guide the plow and keep it on track."], "plunger": ["Plungers often have a metal or plastic rod extending from the handle to the cup. This rod is used to provide leverage when pushing or pulling the plunger.", "Plungers may also have a hook or loop at the end of the handle, allowing them to be hung up for storage"], "Polaroid camera": ["The lens is usually located in the center of the camera, and is often surrounded by a black or silver ring.", "The camera usually has a viewfinder located on the top, and a shutter button on the front.", "The camera also has a film compartment on the back, which is usually marked with the Polaroid logo."], "pole": ["Poles often have a distinct color or pattern, such as a striped or checkered pattern.", "Poles may have a sign or flag attached to the top, or a light or other object mounted on the side."], "police van": ["Police vans often feature a large light bar on the roof, which is used to signal the presence of law enforcement.", "Police vans often have the words \"Police\" or \"Law Enforcement\" written on the side, as well as the logo of the local police department."], "poncho": ["Ponchos are often cut in a semicircular shape, with a hole in the center for the head. This shape is distinct from other garments, making it easy to identify.", "Ponchos often feature decorative fringes or tassels along the edges, adding to their unique look."], "pool table": ["The pool table will have six pockets located at the corners and sides of the table.", "Pool tables usually have a set of rails around the perimeter of the table, which are used to cushion the impact of the balls when they are struck.", "Pool tables often have a set of cues, which are long sticks used to strike the balls."], "soda bottle": ["Soda bottles often have a cap or lid, which can be either twist-off or pop-top.", "Many soda bottles feature a label or logo printed on the front, which can help to identify the brand or flavor of the beverage."], "plant pot": ["Plant pots often have drainage holes at the bottom, allowing excess water to escape.", "Plant pots come in a variety of materials, such as plastic, terracotta, ceramic, and metal. The material can often be identified by its color and texture."], "potter's wheel": ["The wheel is usually mounted on a stand, which can be either a single post or a four-legged base.", "The wheel is usually powered by a foot pedal, which is connected to the wheel by a belt or chain.", "The wheel is often accompanied by a splash pan, which is a shallow basin that catches excess clay and water."], "power drill": ["The drill bit is usually visible at the end of the drill, and is often a different color than the rest of the drill.", "Power drills often have a manufacturer's logo or brand name displayed on the body of the drill."], "prayer rug": ["Prayer rugs are usually decorated with intricate patterns and designs, often featuring bright colors and intricate details.", "Prayer rugs are usually rectangular in shape, with a slightly pointed end. This pointed end is meant to indicate the direction of Mecca."], "printer": ["Most printers have a paper tray that can be seen from the side or top.", "Many printers have a control panel with buttons and a display screen.", "Many printers have a logo or brand name displayed on the front or side."], "prison": ["Prisons often have guard towers or watchtowers, which are used to monitor the area and provide a vantage point for guards.", "Prisons often have multiple buildings, such as administrative offices, housing units, and recreational areas. These buildings are usually surrounded by a secure perimeter."], "projectile": ["Projectiles often have a cylindrical or conical shape, with a smooth surface.", "Projectiles may have fins or stabilizing wings, which help them to fly in a straight line.", "Projectiles may have markings or engravings on them, such as a manufacturer's logo or serial number."], "projector": ["Projectors often have a large vent at the back, which is used to dissipate heat generated by the projector's internal components.", "Projectors usually have a control panel at the top, which is used to adjust the image settings and other features."], "hockey puck": ["Hockey pucks are round and flat, with a diameter of 3 inches and a thickness of 1 inch.", "Hockey pucks are made of vulcanized rubber, which gives them a slightly textured surface."], "punching bag": ["Punching bags are often filled with sand, water, or other materials to provide resistance when struck.", "Punching bags are usually suspended from the ceiling or a stand, and feature a loop or handle at the top for easy hanging.", "Punching bags often feature a striking surface, such as leather or vinyl, which is usually decorated with a logo or brand name."], "purse": ["Purses often have handles or straps, which can be made of leather, fabric, or metal.", "Purses often have decorative features such as buckles, zippers, or buttons.", "Purses often have a logo or brand name displayed on the exterior."], "quill": ["Quills often have a feathery texture, with visible barbs and vanes.", "Quills may be decorated with intricate designs, such as spirals or patterns.", "Quills may be made of various materials, such as metal, wood, or plastic."], "quilt": ["Quilts often have a distinct border, usually made of a single fabric or pattern. This border can be a different color or pattern than the patchwork.", "Quilts often have a backing fabric, which is usually a single color or pattern. This backing fabric is usually visible on the underside of the quilt."], "race car": ["Race cars often feature a large rear spoiler, which helps to keep the car stable at high speeds.", "Race cars are usually brightly colored and feature sponsor logos, team names, and driver numbers."], "racket": ["The strings of a racket are usually strung in a criss-cross pattern, with the strings running perpendicular to each other.", "Most rackets have a grip at the end of the handle, which is usually made of a rubber or synthetic material. This grip is designed to provide a"], "radiator": ["Radiators are usually mounted on the wall or floor and have a series of pipes connected to them.", "Radiators often have a control knob or valve that can be used to adjust the temperature."], "radio": ["Radios often have a tuning dial or knob, which is used to select the desired frequency.", "Radios may also have a display panel, which can show the current frequency or station."], "radio telescope": ["Radio telescopes often have a central support structure, which is used to hold the dish in place and can be seen in the photo.", "Radio telescopes usually have a control room or cabin nearby, which houses the equipment used to control the telescope and analyze the data it collects."], "rain barrel": ["Rain barrels often have a spigot or tap near the bottom, which is used to access the stored water.", "Rain barrels are usually made of plastic or metal, and may feature a decorative design or color."], "recreational vehicle": ["Many recreational vehicles have large windows, allowing for a good view of the outside.", "Recreational vehicles often have a distinct paint job, with bright colors and designs. They may also have a logo or brand name displayed on the side."], "fishing casting reel": ["Fishing casting reels often have a drag system, which is used to adjust the tension of the line. This system is usually composed of a knob or lever that is used to adjust the tension.", "Fishing casting reels often have a line guide, which is used to direct the line from the spool to the rod"], "reflex camera": ["Reflex cameras often have a viewfinder on the top, which is used to compose the image.", "Reflex cameras usually have a variety of buttons and dials on the top and back of the camera, which are used to adjust settings and control the camera."], "refrigerator": ["Refrigerators often have a handle or handles on the door, which can be used to open and close the appliance.", "Many refrigerators have a manufacturer's logo or brand name displayed on the door or side of the appliance."], "remote control": ["They often have a number of buttons, usually arranged in a grid pattern.", "Many remote controls have a manufacturer's logo or brand name printed on them.", "Some remote controls have a directional pad or joystick, which is a unique feature."], "restaurant": ["Tables and chairs are a common feature of restaurants, and can be used to distinguish them from other types of buildings.", "Restaurants often have a kitchen area, which can be identified by the presence of cooking equipment, such as ovens, stoves, and refrigerators.", "Restaurants may also have a bar area, which can be identified by the presence of bar stools and liquor bottles."], "revolver": ["Revolvers often have a distinct hammer at the back of the cylinder, which is used to cock the gun and fire the rounds.", "Revolvers usually have a trigger guard, which is a curved piece of metal that protects the trigger from accidental firing."], "rifle": ["Rifles often have a stock, which is the part of the gun that rests against the shoulder when firing.", "Rifles usually have a trigger and trigger guard, which are used to fire the gun.", "Rifles often have a magazine, which is a detachable container that holds ammunition.", "Rifles usually have a sight, which is used to aim the gun."], "rocking chair": ["Rocking chairs often have a wide base, which allows them to rock back and forth.", "Rocking chairs often have a distinct design, such as spindles or slats, which can help to distinguish them from other types of chairs."], "rotisserie": ["The spit is usually made of metal and is often motorized, allowing the food to rotate slowly and evenly.", "Rotisseries often have a heating element at the base, which is used to cook the food. This element is usually visible in the photo."], "eraser": ["Erasers often have a textured surface, which helps to remove pencil marks.", "Erasers are usually brightly colored, often pink or yellow."], "rugby ball": ["Rugby balls are usually made of leather or synthetic materials and have a textured surface.", "Rugby balls are often decorated with the logo of the team or manufacturer."], "ruler measuring stick": ["The markings are usually in centimeters or inches, and are often accompanied by a number scale.", "The end of the ruler measuring stick is usually pointed, and may have a hole or hook for hanging."], "sneaker": ["Sneakers often have a distinctive upper, which can be made of leather, canvas, or synthetic materials. This upper is usually decorated with logos, stripes, or other designs.", "Sneakers often have laces, which can be a useful visual feature for distinguishing them from other types of shoes."], "safe": ["Safes often have a handle or knob on the door, as well as a keyhole or combination lock.", "Many safes have a distinct design, with a combination of metal and plastic materials, and may feature a logo or brand name."], "safety pin": ["The head of the safety pin is usually decorated with a pattern or design, such as a flower or a star.", "Safety pins often have a small loop at the end, which is used to secure the pin in place."], "salt shaker": ["The lid of a salt shaker is usually perforated with small holes, allowing the salt to be dispensed.", "Salt shakers often have a label or logo on the side, indicating the brand or type of salt inside."], "sandal": ["The sole of a sandal is usually flat and made of rubber or plastic.", "Sandals often have a distinctive pattern or design on the straps or upper part of the shoe."], "sarong": ["Sarongs are usually made of lightweight, breathable fabrics such as cotton, rayon, or silk.", "Sarongs are usually worn around the waist and are secured with a knot or a belt."], "saxophone": ["Saxophones have a series of keys along the length of the instrument, which are used to change the pitch of the notes.", "Saxophones have a mouthpiece at the top of the instrument, which is used to blow air into the instrument to produce sound."], "scabbard": ["Scabbards are usually made of leather or metal and feature a belt loop or strap for attaching to a belt or other clothing.", "Scabbards often feature decorative elements such as engravings, embossing, or other ornamentation."], "weighing scale": ["Most scales have a digital display or dial to show the weight of the item.", "Weighing scales often have a calibration knob or button to adjust the accuracy of the readings.", "Many scales have a handle or carrying strap for portability."], "school bus": ["School buses have a distinct shape, with a large, boxy body and a sloped hood.", "School buses often have large windows, and may have a sign on the front or side indicating it is a school bus.", "School buses may also have a stop sign that swings out from the side of the bus when it is stopped to pick up or drop off passengers."], "schooner": ["Schooners often have a bowsprit, a long pole extending from the bow of the ship.", "Schooners typically have a long, narrow hull with a shallow draft, allowing them to sail in shallow waters.", "Schooners often have a distinctive sail plan, with multiple sails of different shapes and sizes."], "scoreboard": ["Scoreboards often have a timer or clock display, which can be used to track the time remaining in a game or match.", "Scoreboards may also feature team logos or colors, which can be used to distinguish between the two teams playing."], "CRT monitor": ["CRT monitors usually have a large, round neck connecting the screen to the base.", "CRT monitors often have a large, rectangular back panel with several ports for connecting cables."], "screw": ["The head of the screw is usually flat or slightly rounded, and may have a slot or cross-shaped indentation for a screwdriver.", "The threads of the screw are usually visible, and may be either coarse or fine depending on the type of screw."], "screwdriver": ["The head of the screwdriver is usually made of metal and has a slot or a Phillips head.", "The handle of the screwdriver is usually made of plastic or metal and may have a textured grip for better control."], "seat belt": ["The webbing is usually a bright color, such as red, yellow, or orange, making it stand out in a photo.", "The buckle or clasp is usually metal and may have a logo or brand name on it."], "sewing machine": ["The needle and bobbin are usually visible on the top of the machine, and the foot pedal is usually located on the floor.", "Many sewing machines have a variety of dials and buttons on the front, which are used to adjust the stitch length, tension, and other settings."], "shield": ["Shields often feature a distinct design or pattern, such as a coat of arms, a crest, or a symbol.", "Shields are usually made of metal, wood, or leather, and may have a raised rim or border."], "shoe store": ["The store may have a sign or logo prominently displayed, often featuring the store's name or a recognizable shoe brand.", "The store may have a variety of shoe-related items, such as shoe laces, shoe polish, and shoe trees."], "shoji screen / room divider": ["Shoji screens are usually tall and thin, and can be folded up for storage.", "Shoji screens are often used to divide a room, and can be seen in traditional Japanese homes."], "shopping basket": ["Shopping baskets often have a distinct shape, such as a square or oval, with a wide opening at the top.", "Shopping baskets may have a logo or brand name printed on the side, or a pattern or design on the exterior."], "shopping cart": ["Shopping carts usually have a handlebar at the top for pushing and steering the cart.", "Shopping carts often have a basket or tray at the bottom for carrying items. This basket or tray is usually made of metal and has a wire mesh pattern."], "shovel": ["The blade of a shovel is usually made of metal and is either flat or slightly curved.", "The handle of a shovel is usually made of wood or metal and is usually straight or slightly curved.", "Shovels often have a grip at the end of the handle for better control."], "shower cap": ["The edges of the shower cap are often elasticized, allowing it to fit snugly around the head.", "Many shower caps feature a decorative pattern or design, such as polka dots, stripes, or floral prints."], "shower curtain": ["Shower curtains are typically hung from a rod or track, and feature a series of holes or grommets along the top edge for attaching to the rod.", "Shower curtains often feature a weighted hem along the bottom edge, which helps keep the curtain in place and prevents it from billowing out."], "ski": ["Skis often have a textured surface, such as grooves or ridges, to help with grip and stability.", "Skis are usually brightly colored, with a variety of designs and patterns."], "balaclava ski mask": ["The ski mask typically has a hole for the eyes and nose, and sometimes a hole for the mouth.", "The ski mask is usually one solid color, such as black, grey, or white."], "sleeping bag": ["Sleeping bags often have a zipper running along the side or down the middle, allowing the user to open and close the bag.", "Many sleeping bags feature a drawstring or toggle at the top, allowing the user to cinch the hood closed for extra warmth."], "slide rule": ["They often feature a sliding central piece, which can be moved along a ruler-like scale.", "Slide rules usually have two sets of numbers, one on the top and one on the bottom, which can be used to calculate mathematical equations.", "They often have a cursor, which is a small metal piece that can be used to measure the distance between two points on the scale."], "sliding door": ["Sliding doors often have a handle or knob on one side, allowing the user to open and close the door.", "Sliding doors are often made of glass, allowing light to pass through and providing a clear view of the outside."], "slot machine": ["Slot machines often have a large arm or handle on the side, which is used to spin the reels.", "Slot machines are usually brightly colored and feature flashing lights and sound effects. They may also have a coin slot or acceptor, as well as a payout tray."], "snorkel": ["The curved end of the snorkel is usually fitted with a mouthpiece, which is designed to fit comfortably in the user's mouth.", "Snorkels often feature a purge valve at the bottom of the tube, which allows water to be expelled from the tube."], "snowmobile": ["The engine is usually located in the center of the vehicle, with a seat for the driver and a handlebar for steering.", "Snowmobiles often have skis in the front for steering and a skid plate in the back for traction. They also have a bright headlight and taillight for visibility in low-light conditions."], "snowplow": ["Snowplows often have bright, reflective markings on the blade and body of the vehicle, making them more visible in low-light conditions.", "Snowplows usually have large, rugged tires, which are designed to handle the weight of the vehicle and the snow it is pushing."], "soap dispenser": ["The pump or lever is usually made of metal or plastic, and is used to dispense the soap.", "The body of the dispenser is usually made of glass or plastic, and often has a label or logo on it.", "The dispenser may also have a window or opening on the side, allowing you to see the level of soap inside."], "soccer ball": ["Soccer balls usually have a black and white color scheme, with the pentagons and hexagons alternating between the two colors.", "Soccer balls often have a logo or brand name printed on them, which can be used to identify the ball."], "sock": ["Socks come in a variety of colors, patterns, and textures, making them easy to distinguish from other items.", "Many socks have a logo or brand name printed on them, making them even easier to identify."], "solar thermal collector": ["The panels are usually mounted on a roof or other elevated surface, and may be angled to maximize the amount of sunlight they receive.", "Solar thermal collectors often have a reflective surface, such as a mirror or other reflective material, to help capture and concentrate the sun's energy."], "sombrero": ["The brim of a sombrero is often decorated with colorful embroidery or stitching.", "The crown of a sombrero is usually made of woven straw or felt, and is often adorned with a band of ribbon or fabric."], "soup bowl": ["Soup bowls often have a handle or two on either side, making them easier to hold and carry.", "Soup bowls are usually made of ceramic, porcelain, or other heat-resistant materials, and may feature a glossy or matte finish."], "keyboard space bar": ["The space bar is usually wider than the other keys and is often a different color than the other keys.", "The space bar is usually labeled with a large \"Space\" or \"SPACEBAR\" label."], "space heater": ["They often have a control panel with buttons or dials to adjust the temperature and other settings.", "Space heaters usually have a fan or blower to circulate the heated air, and this can be seen as a vent or grille on the side or back of the heater.", "Many space heaters have a safety feature that will shut off the heater if it gets too hot,"], "space shuttle": ["Space shuttles have two large, white, solid rocket boosters attached to the sides of the fuselage.", "Space shuttles have a large, black, external fuel tank attached to the bottom of the fuselage.", "Space shuttles have a large, white, pointed nose cone at the front of the fuselage."], "spatula": ["The handle of a spatula is usually made of wood, plastic, or metal and is designed to be comfortable to hold.", "Spatulas often have a hole in the handle for hanging or storage."], "motorboat": ["Motorboats often have a motor mounted on the stern, which is usually visible from the side or rear of the boat.", "Motorboats usually have a steering wheel or tiller, which is used to control the direction of the boat. This is usually visible from the front or side of the boat."], "spider web": ["The web is usually composed of a single strand of silk, which is often visible in the photo.", "The web is usually suspended between two points, such as trees, rocks, or other structures.", "The web often has a dew-like glisten, which is caused by the spider's silk reflecting light."], "spindle": ["Spindles often have a decorative top, such as a finial or knob, which can be used to distinguish them from other cylindrical objects.", "Spindles often have a hole in the center, which can be used to thread a string or rope. This is a useful feature for distinguishing a spindle from other cylindrical objects."], "sports car": ["Sports cars often feature a wide, aggressive stance, with large wheels and tires.", "Many sports cars have unique styling cues, such as spoilers, scoops, and vents, which help to distinguish them from other cars."], "spotlight": ["Spotlights often have a metal or plastic housing, which can be used to distinguish them from other light sources.", "Spotlights may have a handle or mount, which can be used to adjust the angle of the light."], "stage": ["Stages often have a backdrop, which can be a curtain, wall, or other type of background.", "Stages often have lighting fixtures, such as spotlights, which can be used to highlight performers or set the mood.", "Stages often have a sound system, which can be seen as speakers, microphones, and other audio equipment."], "steam locomotive": ["Steam locomotives have a large, rectangular boiler, which is the source of the steam that powers the engine.", "Steam locomotives have a distinctive cowcatcher at the front, which is a metal frame designed to push obstacles out of the way.", "Steam locomotives have a large, wheeled tender behind the engine, which carries the fuel and water needed to power the"], "through arch bridge": ["The arch is usually made of stone or concrete, and is often decorated with intricate designs or patterns.", "Through arch bridges often have two towers or abutments at either end, which support the arch and the bridge deck."], "steel drum": ["Steel drums often have a series of raised ridges or indentations along the surface, which are used to create different tones when the drum is struck.", "Steel drums are usually painted in bright colors, often featuring intricate designs or patterns."], "stethoscope": ["The earpieces are usually made of plastic or metal and are connected to the tube by a Y-shaped joint.", "The diaphragm is usually made of rubber or plastic and is used to amplify sound. It is usually marked with the manufacturer's logo or brand name."], "scarf": ["Scarves often feature a pattern or design, such as stripes, polka dots, or floral prints.", "Scarves can be tied in a variety of ways, such as a simple knot, a loop, or a bow."], "stone wall": ["The stones may be of different sizes and shapes, but they are usually arranged in a uniform pattern.", "The stones may be of different colors, ranging from light gray to dark brown.", "The stones may be rough or smooth, depending on the type of stone used.", "The mortar between the stones may be visible, and may be of a different color than the stones."], "stopwatch": ["Stopwatches often have two or more buttons on the side or top of the watch, used to start, stop, and reset the timer.", "Stopwatches may have a clip or loop on the back, allowing them to be attached to clothing or a belt."], "stove": ["Many stoves have a control panel with knobs or buttons to adjust the temperature and settings.", "Stoves often have a vent hood above them, which can be used to remove smoke and odors from the kitchen."], "strainer": ["The mesh or perforated surface is usually circular or oval in shape, and can be made of metal, plastic, or other materials.", "Strainers often have a lip or rim around the edge of the bowl, which helps to keep the contents inside."], "tram": ["Trams often have a distinctive color scheme, with a bright, bold color on the roof and sides.", "Trams usually have a number of doors along the sides, and may have a logo or name of the company or city they are associated with."], "stretcher": ["Stretchers are usually made of metal or plastic, and may have a canvas or vinyl covering.", "Stretchers often have straps or buckles to secure a patient in place."], "couch": ["The upholstery of a couch is usually a distinct color or pattern, making it easy to spot in a photo.", "Many couches have cushions, which can be used to distinguish them from other furniture."], "stupa": ["Stupas often feature intricate carvings or decorations on the exterior, such as spirals, lotus flowers, or other symbols.", "Stupas are often surrounded by a fence or railing, and may have a pathway leading up to the entrance."], "submarine": ["Submarines often have a distinct paint scheme, usually a combination of gray and black.", "Submarines have several external features, such as periscopes, antennae, and hatches."], "suit": ["The trousers usually have a waistband, belt loops, and pockets.", "Suits are often made of a solid color or patterned fabric, such as pinstripes or herringbone."], "sundial": ["The face of the sundial is often inscribed with lines and numbers, which indicate the time of day when the sun's shadow falls on them.", "Sundials are often mounted on a pedestal or stand, which can be ornately decorated or simply functional."], "sunglass": ["Sunglasses often have a nose bridge, which is a piece of the frame that sits on the bridge of the nose. This helps to keep the glasses in place.", "Sunglasses may also have arms or temples, which are the pieces of the frame that extend from the lenses and wrap around the ears. These arms may be"], "sunglasses": ["The lenses are usually tinted or polarized, and can be round, square, or any other shape.", "The frames of sunglasses are usually made of plastic, metal, or a combination of both. They can be thin or thick, and come in a variety of colors and styles."], "sunscreen": ["Sunscreen often has a bright, colorful label with a picture of the sun or a beach scene.", "Sunscreen often has a distinctive smell, which can be used to identify it in a photo."], "suspension bridge": ["The bridge deck is usually composed of a series of steel beams, which are connected by a series of steel cables.", "Suspension bridges often have a distinctive shape, with the bridge deck curving up and down in a gentle arc."], "mop": ["Mops often have a wringer attached to the handle, which is used to squeeze out excess water from the mop head.", "Mops come in a variety of colors, shapes, and sizes, so look for any distinguishing features that may help identify the mop in the"], "sweatshirt": ["Sweatshirts often feature a kangaroo pocket at the front, which is a pouch-like pocket with an opening at the top.", "Sweatshirts are usually made of a thick, soft material such as cotton or fleece, and often feature a logo or design on the front."], "swim trunks / shorts": ["They are usually made of lightweight, quick-drying fabric, such as nylon or polyester.", "They often have an elastic waistband with a drawstring for a snug fit.", "They usually have pockets on the sides or back."], "swing": ["Swings often have a metal frame or support structure, which can be either a single pole or a more complex structure.", "Swings may also feature a backrest or armrests for added comfort and support."], "electrical switch": ["They often have a toggle switch or a button that can be pressed to turn the power on or off.", "Electrical switches are usually labeled with the type of switch, such as \"on/off\" or \"dimmer.\"", "Electrical switches are often mounted on a wall or other surface, and may have a plate or cover to protect the switch from dust and debris."], "syringe": ["The barrel of the syringe is usually transparent, allowing the user to see the liquid inside.", "The plunger is usually made of rubber or plastic and is used to draw the liquid into the barrel and expel it.", "The tip of the syringe is usually metal and has a sharp point for piercing the skin."], "table lamp": ["The stem is the part that connects the base to the shade. It is usually made of metal and can be curved or straight.", "The shade is the part that houses the lightbulb. It is usually made of fabric or glass and can be shaped like a dome, cylinder, or other shapes."], "tank": ["Tanks have tracks on either side, which are used for mobility.", "Tanks often have a large gun barrel protruding from the turret, and may have additional weapons mounted on the sides.", "Tanks are usually painted in camouflage colors, making them difficult to spot in certain environments."], "tape player": ["Tape players often have a display screen, buttons, and dials for controlling the playback.", "Tape players usually have a speaker or headphone jack for listening to the audio.", "Tape players may have a logo or brand name displayed on the device."], "teapot": ["Teapots often have a lid, which is usually round and sits atop the pot.", "Teapots are usually made of ceramic, metal, or glass, and may feature decorative designs or patterns."], "teddy bear": ["They often have two eyes, a nose, and a mouth, which can be stitched or embroidered.", "Teddy bears usually have two arms and two legs, and some may have a tail.", "They often have a bow or ribbon around their neck, and some may have a collar or other accessories."], "television": ["Modern televisions often have thin bezels surrounding the screen. Older models might exhibit broader, more pronounced bezels, sometimes housing buttons or dials.", "Many televisions have the manufacturer's logo or brand name displayed on the bezel, stand, or occasionally on the screen itself during startup.", "Te"], "tennis ball": ["The felt covering is usually textured with a pattern of small dimples.", "Tennis balls are usually round in shape, with a diameter of about 2.5 inches."], "thatched roof": ["Thatch roofs often have a rounded or conical shape, with the edges of the roof sloping downwards.", "Thatch roofs are usually held in place by a wooden frame, which can be seen in the photo."], "front curtain": ["Front curtains are usually hung from a rod or track, which can be seen in the photo.", "Front curtains often feature a tie-back or holdback, which is a loop of fabric or rope used to hold the curtain open. This can be seen in the photo as well."], "thimble": ["They often have a band around the middle, which can be plain or decorated.", "The top of the thimble usually has a small hole or indentation, which is used to help push the needle through fabric."], "threshing machine": ["The drum is usually mounted on a frame with wheels, allowing it to be moved around the field.", "The machine is usually powered by a tractor or other engine, and has a hopper or chute to collect the grain."], "throne": ["Thrones often have a tall backrest, with armrests and a footrest.", "Thrones are usually made of a sturdy material such as wood or metal, and may be decorated with gold or silver accents."], "tile roof": ["The tiles are usually arranged in a pattern, such as a herringbone or staggered pattern.", "Tile roofs often have a distinct, curved shape, with the tiles overlapping each other to form a dome-like structure."], "toaster": ["Toasters often have a lever on the side to lower the bread into the slots.", "Toasters usually have a timer knob or dial to set the desired toasting time.", "Toasters often have a crumb tray at the bottom to collect any debris."], "tobacco shop": ["Tobacco shops often have signs or logos that advertise their products.", "Tobacco shops often have a distinct smell of smoke or tobacco."], "toilet seat": ["Toilet seats often have a lid that can be opened and closed.", "Toilet seats are usually made of plastic or porcelain and may have a glossy finish.", "Toilet seats may have a hinge mechanism that allows them to be raised or lowered."], "torch": ["The light source is usually a bulb, which may be exposed or covered by a glass or plastic lens.", "Torches often have a switch or button to turn the light on and off, and may also have a dial or switch to adjust the brightness."], "totem pole": ["Totem poles often feature a variety of colors, including red, black, blue, and green.", "Totem poles are usually topped with a figure, such as an eagle or a bear, which is often the most prominent feature."], "tow truck": ["Tow trucks often have a large, bright yellow light bar on the roof, which is used to signal other drivers.", "Tow trucks usually have a large, visible logo or brand name on the side of the vehicle."], "toy store": ["Toys are usually displayed in an organized manner, often in shelves or bins.", "Toy stores often have large signs or banners advertising their products.", "Toy stores often have a wide variety of toys, from stuffed animals to action figures to board games."], "tractor": ["The wheels of a tractor are usually large and chunky, with deep treads for better traction.", "Tractors often have a large, three-point hitch at the back, which is used to attach implements such as plows, harrows, and mowers.", "Many tractors have a distinctive exhaust pipe at the back, which is used to expel exhaust fumes."], "semi-trailer truck": ["The trailer is usually much longer than the cab, and is often divided into two sections.", "Semi-trailer trucks often have a distinctive logo or brand name displayed on the cab or trailer.", "The trailer is usually connected to the cab by a fifth wheel, which is a large metal plate that sits between the two sections."], "tray": ["Trays often have raised edges or sides to contain items placed on them.", "Trays may have handles or grips on either side for easy carrying.", "Trays may have decorative designs or patterns on them."], "trench coat": ["They often feature a belt or sash around the waist, and may have a double-breasted front.", "Trench coats are usually made of a waterproof material, such as cotton gabardine or rubberized fabric. This material is usually a darker color, such as black, navy, or khaki."], "tricycle": ["The frame of a tricycle is usually low to the ground, allowing for easy access and stability.", "Tricycles often have a handlebar and seat for the rider, and pedals for propulsion.", "Many tricycles have a basket or other storage area attached to the frame."], "trimaran": ["Trimarans often have a large, open cockpit in the center of the boat, with seating for several people.", "Trimarans usually have a large, triangular sail mounted on a tall mast, which is often the most visible feature of the boat."], "tripod": ["Tripods often have a center column that can be extended to increase the height of the tripod.", "Tripods usually have a mounting plate or head that can be used to attach a camera or other device. This plate or head is usually located at the top of the center column."], "triumphal arch": ["The archway is often decorated with sculptures, reliefs, or inscriptions.", "Triumphal arches often feature two towers or columns on either side of the archway, which can be used to identify them.", "The archway is usually flanked by two smaller arches or doorways, which can also be used to distinguish them."], "trolleybus": ["Trolleybuses have two overhead wires that run along the length of the vehicle, connecting to the roof of the bus.", "Trolleybuses often have a third wheel in the middle of the vehicle, which is used to connect to the overhead wires.", "Trolleybuses usually have a distinctive livery, with bright colors and logos."], "trombone": ["The bell of the trombone is usually flared and is the widest part of the instrument.", "The mouthpiece of the trombone is typically a small, cup-shaped piece of metal that is inserted into the end of the slide."], "hot tub": ["Hot tubs often have a cover, which can be either solid or mesh.", "Hot tubs usually have jets of water and air bubbles, which can be seen when the cover is removed.", "Hot tubs often have a control panel with buttons and dials for adjusting the temperature and other settings."], "turnstile": ["The arm or gate is usually painted in a bright color, such as yellow or red, to make it easily visible.", "Turnstiles often have a card reader or other security device attached to them, such as a keypad or fingerprint scanner."], "typewriter keyboard": ["The keys are usually arranged in a staggered pattern, with the keys on the left side of the keyboard slightly higher than those on the right.", "The keys are often labeled with letters, numbers, and symbols, and may have a raised or indented texture."], "umbrella": ["The canopy of an umbrella is usually made of fabric and is often brightly colored.", "The ribs of an umbrella are usually made of metal and are connected to the handle and the canopy."], "unicycle": ["Unicycles often have a seat mounted on a post, which is adjustable to accommodate different riders.", "Unicycles usually have a handlebar or frame attached to the wheel, which is used for steering and balance."], "upright piano": ["The keys of an upright piano are usually black and white, and arranged in a repeating pattern.", "Upright pianos often have a music stand attached to the top of the instrument, which is used to hold sheet music.", "Upright pianos usually have three pedals at the bottom of the instrument, which are used to control the sound of the piano."], "vacuum cleaner": ["Most vacuum cleaners have a hose attachment at the end, which is used to suck up dirt and debris.", "Vacuum cleaners often have a dustbin or bag attached to the body, which collects the dirt and debris."], "vase": ["Vases often feature intricate designs, such as floral patterns, geometric shapes, or abstract designs.", "Vases may be made of a variety of materials, such as glass, ceramic, metal, or stone. The material can often be identified by its color, texture, and sheen."], "vaulted or arched ceiling": ["The walls of the room may be curved or angled to meet the ceiling, creating a distinct shape.", "The ceiling may be decorated with ornate moldings, such as dentils, corbels, or other decorative elements."], "velvet fabric": ["Velvet fabric often has a sheen or luster to it, which can be seen in the light.", "Velvet fabric is usually thicker than other fabrics, and can be identified by its deep, rich colors."], "vending machine": ["They often have a glass window or door that allows customers to view the items inside.", "Most vending machines have a coin slot and a selection of buttons for customers to choose their desired item.", "Many vending machines also have a display screen that shows the customer the item they have selected and the cost."], "vestment": ["Vestments are usually made of heavy fabrics such as velvet, silk, or brocade.", "Vestments often feature a large collar or cape, and may have long, flowing sleeves."], "viaduct": ["Viaducts are often made of stone or brick, and may feature decorative elements such as columns or balustrades.", "Viaducts are usually elevated, and may span a large area, such as a valley or river."], "violin": ["The strings of a violin are usually visible, and the bridge is often visible as well.", "The scroll at the top of the neck is a signature feature of a violin, and can be used to distinguish it from other string instruments.", "The F-holes on the body of the violin are also a distinctive feature."], "volleyball": ["The panels are usually made of leather or synthetic material and are often colored differently.", "The surface of the volleyball is often textured, with small bumps or dimples.", "The volleyball is usually inflated and has a distinct shape when viewed from the side."], "waffle iron": ["The plates are usually made of metal and have a non-stick coating.", "The handle of the waffle iron is usually long and curved, and is used to open and close the plates.", "The plates are usually connected to a base, which houses the heating element and controls."], "wall clock": ["Wall clocks often have a distinct design, such as a roman numeral face or a more modern digital display.", "Wall clocks may also feature a pendulum or other decorative elements, such as a moon phase indicator or a thermometer."], "wallet": ["Wallets often have a foldable design, with two or more sections that can be opened and closed.", "Wallets usually have a clasp or snap closure, and may feature a zipper or other fastening mechanism.", "Wallets often have slots for cards, cash, and other items, and may feature a logo or other design on the exterior."], "wardrobe": ["Wardrobes often feature ornate carvings or designs on the doors, or a decorative trim around the edges.", "Wardrobes may have handles or knobs on the doors, and may be made of wood, metal, or other materials."], "military aircraft": ["Many military aircraft have a distinct shape, with wings that are swept back and a pointed nose.", "Military aircraft often have weapons or other military equipment attached to them, such as missiles, bombs, or guns. These can be easily spotted in a photo."], "sink": ["Sinks often have a faucet or tap, which is used to control the flow of water.", "Many sinks have a drain, which is used to remove water from the basin. This is usually accompanied by a stopper or plug, which is used to seal the drain."], "washing machine": ["The door is usually made of metal or plastic and is often decorated with a logo or brand name.", "The control panel is usually located on the top or front of the machine and is often illuminated with LED lights.", "The drum of the washing machine is usually visible through the door and is usually made of metal or plastic."], "water bottle": ["They may have a handle or loop for easy carrying.", "Many water bottles have a logo or brand name printed on them.", "They may have a lid or cap that can be unscrewed or flipped open.", "Some water bottles have a straw or spout for drinking."], "water jug": ["Water jugs often have a lid or cap, which can be either removable or attached.", "Water jugs are usually made of plastic or metal, and may have a logo or brand name printed on them."], "water tower": ["They often feature a ladder or stairs leading up to the top, allowing for maintenance and inspection.", "Water towers are usually painted with a bright color, often white, to make them more visible from a distance. They may also feature the name of the town or city they are located in."], "whiskey jug": ["The shape of the jug is usually cylindrical, with a narrow neck and a wide base.", "The jug often has a label or logo of the whiskey brand printed on it.", "The jug may also have a cork or screw-top lid."], "whistle": ["Whistles often have a hole at one end, which is used to blow into the whistle.", "Whistles may have a decorative pattern or design on the outside, such as stripes or dots.", "Whistles may have a lanyard or string attached to them, which is used to hang the whistle around the neck."], "hair wig": ["Hair wigs often have a uniform texture and color, which can be seen in the photo.", "Hair wigs often have a distinct shape, such as a bob or pixie cut, which can be seen in the photo."], "window screen": ["The mesh pattern of the window screen is usually quite distinct, with small, uniform holes.", "Window screens are usually framed in metal or plastic, and the frame is usually visible in the photo."], "window shade": ["Window shades are usually mounted on a roller or track system, which can be seen in the photo.", "Window shades often have a pull cord or handle, which can be used to adjust the shade."], "Windsor tie": ["The knot of a Windsor tie is usually larger and more symmetrical than other types of knots.", "The fabric of a Windsor tie is usually thicker and more substantial than other types of ties."], "wine bottle": ["The label on the bottle often contains information about the type of wine, the winery, and the region it was produced in.", "The color of the bottle can also be a useful indicator, as red wines are usually bottled in dark green or brown glass, while white wines are usually bottled in clear or light green glass."], "airplane wing": ["The wings are usually made of metal and have a glossy finish.", "Airplane wings often have ailerons, flaps, and other control surfaces that can be seen from the outside.", "The wings may also have a series of rivets along the surface, which are used to attach the wing to the fuselage."], "wok": ["The sides of a wok are usually sloped, allowing for easy stirring and tossing of ingredients.", "Woks often have a lid, which is used to trap steam and heat while cooking."], "wooden spoon": ["Wooden spoons often have a smooth, curved handle and a flat, oval-shaped bowl.", "The bowl of the spoon is usually slightly concave, with a rounded edge."], "wool": ["Wool is often woven into a fabric, which can be identified by its distinct weave pattern.", "Wool may also be dyed, which can be identified by its vibrant colors."], "split-rail fence": ["The rails are usually made of wood, but can also be made of metal or plastic.", "The posts are usually made of wood, but can also be made of metal or plastic.", "The rails are usually spaced evenly apart, creating a distinctive pattern."], "shipwreck": [" The remains of a shipwreck may include masts, sails, and other rigging, which can be seen in the water or on the shore.", " Shipwrecks may also feature debris such as barrels, crates, and other items that were on board the ship."], "sailboat": ["Sailboats often have a cabin or cockpit, which is usually located near the stern of the boat.", "Sailboats are usually propelled by a rudder, which is a flat piece of wood or metal attached to the stern of the boat. This is used to steer the boat and is usually visible in the photo."], "yurt": ["Yurts often have a central skylight, which is a circular opening at the top of the roof.", "Yurts are usually decorated with colorful fabrics, rugs, and wall hangings."], "website": ["Websites typically have a navigation bar or menu at the top or side of the page. This can be used to quickly access different sections of the website.", "Websites often feature a search bar, allowing users to quickly search for specific content. This is usually located at the top of the page."], "comic book": ["Comic books often feature characters in action poses, often with exaggerated facial expressions and body language.", "Comic books often feature speech bubbles with text, which can be used to identify the comic book."], "crossword": ["The grid is usually divided into two sections, with the top section containing the clues for the across words and the bottom section containing the clues for the down words.", "Crosswords often feature a title or theme, which is usually written at the top of the grid."], "traffic or street sign": ["The text on the sign is usually in a sans-serif font, and often includes arrows or other symbols to indicate direction or meaning.", "Traffic and street signs often have a reflective coating, making them more visible at night or in low-light conditions."], "traffic light": ["The lights are usually arranged in a vertical line, with the red light at the top, yellow in the middle, and green at the bottom.", "Traffic lights are often mounted on a tall pole, and may be accompanied by a sign or other traffic control device."], "dust jacket": ["Dust jackets often feature a printed design on the front and back, usually including the title, author, and publisher of the book.", "Dust jackets are usually slightly larger than the book itself, and are designed to fit snugly around the book's cover."], "menu": ["Menus are often printed on paper or cardstock, and may feature a logo or design on the front.", "Menus may also be displayed on a digital screen, such as a tablet or computer monitor. In this case, the menu items may be organized into categories or tabs."], "plate": ["Plates often have a rim or lip around the edge, which helps contain food and liquids.", "Plates may have a pattern or design on them, such as a floral pattern or a solid color."], "guacamole": ["It often contains chunks of avocado, tomato, onion, and other ingredients.", "It is usually served in a bowl or plate, with chips or vegetables for dipping."], "consomme": ["Consomme is often served with garnishes such as vegetables, herbs, or noodles, which can be used to distinguish it from other soups.", "Consomme is usually served in a shallow bowl or cup, which can be used to identify it in a photo."], "hot pot": ["Hot pots often have a spout for pouring out the contents.", "Hot pots are usually made of metal, ceramic, or plastic, and may have a colorful design or pattern."], "trifle": ["Trifles often feature layers of cake, custard, jelly, and cream, which can be seen in the photo.", "Trifles are often decorated with fruits, nuts, and other toppings, which can be easily spotted in the photo."], "ice cream": ["Ice cream is often brightly colored, with a variety of flavors and toppings.", "Ice cream is often served with a spoon or other utensil, which can be a useful visual feature."], "popsicle": ["Popsicles are often decorated with swirls, stripes, or other patterns.", "The texture of a popsicle is usually smooth and glossy."], "baguette": ["Baguettes often have a distinctive shape, with a tapered end and a slightly curved top.", "Baguettes are usually scored with diagonal lines, creating a pattern of small, even slices."], "bagel": ["Bagels are usually covered in a variety of toppings, such as sesame seeds, poppy seeds, or onion flakes.", "Bagels are often glazed with an egg wash, giving them a glossy sheen."], "pretzel": ["Pretzels are often covered in coarse salt, which gives them a unique texture and flavor.", "Pretzels are usually a light golden-brown color, although some varieties may be darker or lighter."], "cheeseburger": ["The patty is usually topped with a slice of cheese, which is melted onto the patty.", "The burger is often garnished with lettuce, tomato, onion, pickles, and condiments such as ketchup, mustard, and mayonnaise."], "hot dog": ["Hot dogs are usually a light brown color, with a slightly charred appearance from being cooked.", "Hot dogs are often served in a bun, which can be a useful visual feature to distinguish them from other foods."], "mashed potatoes": ["The texture of mashed potatoes is usually lumpy and uneven.", "Mashed potatoes often have small pieces of butter or other ingredients mixed in, which can be seen as small yellow or white flecks.", "Mashed potatoes are often served with a garnish of parsley, chives, or other herbs, which can be seen as small green flecks."], "cabbage": ["The leaves of a cabbage are usually a deep green color, although some varieties may have purple or reddish leaves.", "Cabbages often have a white or light-colored stem at the base of the head."], "broccoli": ["The florets are usually tightly packed together and have a slightly fuzzy texture.", "Broccoli also has thick, fibrous stalks that are usually a lighter green color than the florets."], "cauliflower": ["The florets are surrounded by green leaves, which can be used to distinguish it from other white vegetables.", "The head of the cauliflower is usually round or oval in shape, and can range in size from small to large."], "zucchini": ["Zucchinis have a cylindrical shape, with a tapered end.", "Zucchinis have a distinct white or yellow flower at the end, which is a signature feature."], "spaghetti squash": ["The skin of a spaghetti squash is usually yellow or orange in color, and is often covered in small bumps or ridges.", "The flesh of a spaghetti squash is usually a pale yellow or orange color, and when cooked, it separates into thin strands resembling spaghetti noodles."], "acorn squash": ["The shape of an acorn squash is distinct, with a curved, ridged exterior and a pointed end.", "Acorn squash have a unique, nutty flavor and are often used in soups, stews, and other dishes."], "butternut squash": ["The skin of a butternut squash is usually a light tan or yellowish color, with some darker spots or stripes.", "The stem of a butternut squash is usually a light green color, and the blossom end of the squash is usually slightly indented."], "cucumber": ["The ends of cucumbers are usually rounded, and the skin is often slightly bumpy.", "Cucumbers often have a white, waxy coating on the skin, which can be seen when the cucumber is held up to the light."], "artichoke": ["The leaves of an artichoke are usually a deep green color, with lighter shades of green or yellow near the tips.", "Artichokes have a thick, fibrous stem that connects the base to the leaves. This stem is usually a light green or yellow color."], "bell pepper": ["Bell peppers come in a variety of colors, including green, red, yellow, orange, and purple.", "Bell peppers have a distinct texture, with a smooth, glossy exterior and a slightly ribbed interior.", "Bell peppers have a stem and a calyx, which is the green leafy part at the top."], "cardoon": ["The stems of cardoons are thick and fleshy, and can be purple or green in color.", "Cardoons have a large, central flower head that is usually white or purple in color."], "mushroom": ["The color of the cap can vary widely, from white to brown to red to yellow.", "The gills or pores on the underside of the cap are a key feature of mushrooms, and can be used to distinguish different species.", "The texture of the cap can also be used to identify mushrooms, as some species have a smooth surface while others are more bumpy or scaly"], "Granny Smith apple": ["The skin of a Granny Smith apple is usually smooth and glossy.", "Granny Smith apples are usually larger than other apple varieties, with a distinctively round shape.", "The stem of a Granny Smith apple is usually short and stubby."], "strawberry": ["The shape of a strawberry is distinct, with a pointed tip and a wide base.", "The surface of a strawberry is usually bumpy and textured, with small seeds visible on the surface."], "orange": ["The skin of an orange is usually a bright, vibrant orange color.", "Oranges have a distinct texture, with small bumps or dimples on the surface.", "Oranges have a distinct aroma, which can be detected in a photo."], "lemon": ["Lemons have a distinct, sour smell that can be detected in a photo.", "Lemons have a textured surface, with small bumps and dimples.", "Lemons have a pointed end and a slightly flattened base."], "fig": ["Figs are usually a deep purple or brown color, with a lighter colored interior.", "Figs often have a small stem at the top, and a small indentation at the bottom."], "pineapple": ["The pineapple's skin is usually a yellow-green color, with brownish-red scales.", "The pineapple's flesh is usually a yellow-orange color, and is usually quite juicy.", "The pineapple has a sweet, distinct smell."], "banana": ["Bananas have a pointed end and a more rounded end, with a slight indentation in the middle.", "Bananas have a thick, leathery skin that is usually speckled with brown spots.", "Bananas have a distinct shape, with a curved body and a tapered end."], "jackfruit": ["Jackfruits have a unique, sweet smell that is often described as a combination of pineapple, banana, and mango.", "The interior of a jackfruit is filled with yellow, edible pods that contain a single seed. The pods are often arranged in a star-like pattern."], "cherimoya (custard apple)": ["The skin of a cherimoya is green and covered in small, soft scales.", "The flesh of a cherimoya is white and creamy, and contains black seeds.", "The stem of a cherimoya is usually short and stubby."], "pomegranate": ["The skin of a pomegranate is usually a deep red or purple color, and is often covered in small bumps.", "The pomegranate has a crown-like structure at the top, with several small leaves or sepals."], "hay": ["Hay is often found in fields or barns, and is usually surrounded by other plants or vegetation.", "Hay is often made up of long, thin strands of grass or other plants, and can be identified by its distinct texture."], "carbonara": ["Carbonara is usually made with bacon or pancetta, so it will often have small pieces of meat visible in the dish.", "Carbonara is often topped with freshly grated Parmesan cheese, so it will usually have a light dusting of cheese on top."], "chocolate syrup": ["It is often poured in a thick, viscous stream, with a distinct texture.", "Chocolate syrup often has a distinct aroma, which can be detected in the photo."], "dough": ["Dough is usually a light-colored substance, ranging from white to yellowish-brown.", "Dough often has a glossy sheen, and may have small air bubbles visible on its surface."], "meatloaf": ["The top of the meatloaf is often glazed with a sauce or ketchup, giving it a glossy appearance.", "The sides of the meatloaf are usually browned and crisp, with a texture that is slightly different from the top and bottom."], "pizza": ["The crust of a pizza is usually golden-brown in color, with a slightly charred texture.", "The toppings of a pizza are usually visible, and can range from cheese, vegetables, and meats."], "pot pie": ["The filling of a pot pie is usually visible through the crust, and can range from creamy to chunky.", "Pot pies are often served in a deep dish, making them appear taller than other pies."], "burrito": ["Burritos are usually filled with a variety of ingredients, such as beans, rice, meat, vegetables, and cheese. These ingredients can be seen through the tortilla, and can help to distinguish a burrito from other types of food.", "Burritos are often served with a variety of condiments, such"], "red wine": ["Red wines often have a slight purple hue, which can be seen when the light reflects off the surface.", "Red wines often have a fruity aroma, which can be detected in the photo.", "Red wines often have a label with the name of the winery or the type of wine."], "espresso": ["Espresso is usually topped with a layer of crema, a light brown foam that forms on the surface of the espresso.", "Espresso is usually served with a small spoon, which is used to stir the espresso and mix the crema into the drink."], "tea cup": ["Tea cups often have a distinct shape, such as a curved or flared lip, or a more traditional straight-sided shape.", "Tea cups may have a pattern or design on them, such as a floral pattern or a logo."], "eggnog": ["Eggnog is usually a light yellow or off-white color, so it will stand out against a darker background.", "Eggnog is often served in a glass, so the glass itself can be a useful visual feature. It may be a clear glass, or it may be a festive glass with a holiday design."], "mountain": ["Mountains often have snow-capped peaks, especially in colder climates.", "Mountains are often surrounded by other landforms such as valleys, rivers, and forests."], "bubble": ["Bubbles often have a thin, transparent film that reflects light and creates a rainbow-like effect.", "Bubbles often have a bright, glossy surface that reflects the environment around them.", "Bubbles often appear to be floating in the air, as they are filled with air or a gas."], "cliff": ["Cliffs often have a distinct edge or lip at the top, which can be seen from a distance.", "Cliffs are usually composed of rock or soil, and may have vegetation growing on them.", "Cliffs may also have waterfalls or other water features cascading down them."], "coral reef": ["Corals are often arranged in intricate patterns, with a variety of shapes and sizes.", "Reefs often feature a variety of marine life, including fish, sea turtles, and other aquatic creatures."], "geyser": ["Geysers often have a pool of water at the base of the vent, which is heated by the geothermal energy below.", "Geysers can be identified by the steam plume they produce, which is usually visible from a distance."], "lakeshore": ["Lakeshores often have vegetation growing along the shoreline, such as grasses, shrubs, and trees.", "Lakeshores may also feature rocks, pebbles, and sand along the shoreline. These features can be used to distinguish a lakeshore from other bodies of water."], "promontory": ["Promontories often have a distinctive shape, with a sharp point or peak that stands out from the surrounding landscape.", "Promontories may also feature a lighthouse or other navigational aids, which can be used to identify them in photos."], "sandbar": ["Sandbars often have a distinct line of vegetation, such as grasses, shrubs, or trees, that marks the edge of the sandbar.", "Sandbars may also have a line of debris, such as driftwood, shells, or seaweed, that marks the edge of the sandbar."], "beach": ["Beaches often feature a variety of shells, rocks, and other natural debris scattered across the sand.", "Beaches are often bordered by vegetation, such as trees, shrubs, and grasses.", "Beaches may also feature man-made structures, such as piers, boardwalks, and beach houses."], "valley": ["Valleys are often surrounded by mountains or hills, which can be seen in the background of the photo.", "Valleys often have a river or stream running through them, which can be seen in the photo.", "Valleys may also have trees, shrubs, and other vegetation growing in them, which can be seen in the photo."], "volcano": ["Volcanoes often have a distinct layer of ash or lava around the base, which can be seen in photos.", "Volcanic plumes, or columns of smoke and ash, are a telltale sign of an active volcano. These plumes can be seen in photos, often rising high into the sky."], "baseball player": ["Baseball players often wear a protective helmet with a face mask.", "Baseball players often have a glove on one hand and a bat in the other.", "Baseball players often have a distinctive stance, with their feet spread apart and their weight shifted to one side."], "bridegroom": ["Bridegrooms often wear a boutonniere, which is a small flower pinned to the lapel of the suit or tuxedo.", "Bridegrooms often wear a tie or bow tie, which is usually a different color than the suit or tuxedo."], "scuba diver": ["Scuba divers often wear a buoyancy control device (BCD) and a tank on their back.", "Scuba divers usually wear a mask, fins, and a snorkel.", "Scuba divers often carry a dive light, which can be used to illuminate the underwater environment."], "rapeseed": ["The leaves of the rapeseed plant are long and narrow, with a serrated edge.", "The seed pods of the rapeseed plant are small and round, and can range in color from green to brown."], "daisy": ["The petals of a daisy are usually arranged in a symmetrical pattern, radiating outward from the center.", "Daisies often have a single, long stem with a few leaves at the base."], "yellow lady's slipper": ["The pouch is often lined with purple or pink veins, and the petals are usually a darker yellow or orange.", "The leaves of the yellow lady's slipper are usually long and narrow, and may be mottled with white or yellow spots."], "corn": ["Corn has a distinct shape, with a rounded top and a pointed bottom.", "Corn typically grows in rows, with multiple ears of corn growing close together."], "acorn": ["The outer shell of an acorn is usually a light brown color, with ridges or grooves running along its length.", "Acorns have a distinct cap or “cup” at the pointed end, which can vary in size and shape depending on the species."], "rose hip": ["Rose hips are usually a deep red or orange color, although some varieties may be yellow or purple.", "Rose hips often have a fuzzy or hairy texture, and may have small thorns or prickles."], "horse chestnut seed": ["The seeds have a distinctive, spiky, star-shaped pattern on the surface.", "The seeds are usually found in clusters of two to five, attached to a spiky, green husk."], "coral fungus": ["The branches are often covered in small, spore-bearing bumps or protrusions.", "The color of coral fungi can vary, but they are usually shades of yellow, orange, or red."], "agaric": ["The cap surface is often covered in small scales or warts, and can be smooth or sticky.", "The gills underneath the cap are usually white or cream-colored, and can be free or attached to the stem.", "The stem is usually white or cream-colored, and can be smooth or covered in small scales or warts."], "gyromitra": ["The stem of the gyromitra is usually short and thick, and can be either smooth or covered in small scales.", "The underside of the cap is usually covered in small, spore-bearing tubes. These tubes are usually yellowish-brown in color and can be seen when the mushroom is viewed from the side."], "stinkhorn mushroom": ["The mushroom's cap is often shaped like a cone or an egg, and is covered in a slimy, smelly substance.", "The mushroom's stem is usually white and covered in a slimy, smelly substance as well.", "The mushroom's base is usually black and covered in a slimy, smelly substance."], "earth star fungus": ["The outer layer of the star is made up of several pointed rays, which can be opened up to expose the spore-bearing surface.", "The spore-bearing surface is usually a light-colored, powdery surface, which can be seen when the rays are opened up.", "The earth star fungus is usually found growing in clusters, with several stars"], "hen of the woods mushroom": ["The caps are usually a light tan or gray color, and can range from a few inches to several feet in diameter.", "The underside of the mushroom is typically white or pale yellow, and is covered in small, tightly packed gills."], "bolete": ["The cap is usually a reddish-brown color, with a yellowish-brown or white underside.", "The stem of a bolete mushroom is usually thick and white, with a spongy texture.", "The pores on the underside of the cap are usually yellow or white, and are the defining feature of a bolete mushroom."], "corn cob": ["Corn cobs are often covered in a thin layer of husk, which can be green, yellow, or brown in color.", "Corn cobs have a series of kernels arranged in rows along the length of the cob. These kernels are usually yellow or white in color."], "toilet paper": ["It is usually found in a roll, with the paper wrapping around itself in a spiral pattern.", "The paper is usually soft and thin, and often has a quilted texture.", "The roll is usually held together with a cardboard tube in the center."]}