{"tench": ["Tench possess a large, rounded body with a thick, scaleless skin and a short, blunt head.", "Tench have a large, fan-shaped tail fin and two pairs of barbels near the mouth, which are used for locating food."], "goldfish": ["Goldfish come in a variety of colors, from bright orange to yellow, white, and even black.", "Goldfish have large eyes and a small, upturned mouth, which is often used to feed on small insects and plants."], "great white shark": ["The great white shark's coloration is typically a grayish-blue on top and white on the underside, allowing it to blend in with the ocean's surface.", "Great white sharks have a large, powerful tail that propels them through the water with great speed and agility."], "tiger shark": ["Tiger sharks have a large, broad head with a pointed snout and small eyes.", "Tiger sharks have a large, powerful tail, which is used for propulsion and steering."], "hammerhead shark": ["Hammerhead sharks have a streamlined body with a large, triangular dorsal fin and a long, pointed snout.", "Hammerhead sharks are typically gray or brown in color, with a white underside, and may display a pattern of stripes or spots."], "electric ray": ["They possess two large, disc-like electric organs on either side of their head, which can be used to stun prey or defend against predators.", "Electric rays have a distinct coloration, often displaying a dark brown or black back with a white or yellow underside."], "stingray": ["Stingrays have a distinct pattern of spots or stripes on their backs, which can be used to identify individual species.", "Stingrays have two large, wing-like pectoral fins, which they use to propel themselves through the water."], "rooster": ["Roosters have a long, pointed tail with feathers that can be spread out in a fan-like shape.", "Roosters have a large, muscular body with long, strong legs and sharp claws, adapted for scratching and foraging."], "hen": ["Hens have a characteristic comb on the top of their head, often with a wattle hanging from the side.", "Hens have a short tail and wings, and often display a hunched posture.", "Hens have a characteristic feather pattern, often with a barred or speckled pattern."], "ostrich": ["They have a distinctive black and white plumage, with a white tail and black wings.", "Ostriches have two toes on each foot, unlike other birds which have three or four. This is a useful feature for distinguishing them from other birds."], "brambling": ["They have a long, forked tail, often held in a fan-like shape, and a short, stout bill.", "Bramblings have a slender body and long wings, adapted for swift flight, and often display a distinctive, jerky flight pattern."], "goldfinch": ["Goldfinches have a short, conical bill adapted for feeding on small seeds.", "Goldfinches have a small, compact body with a short tail, often seen perched on branches or flying in flocks."], "house finch": ["They have a short, conical bill and a short, notched tail, both of which are useful for distinguishing them from other birds.", "House finches are often seen in flocks, perched on branches or wires, and have a habit of bobbing their heads when perched."], "junco": ["Juncos have a short, conical bill and a rounded head, with a white eye-ring and a white throat.", "Juncos have a small, compact body and short, rounded wings, adapted for quick, agile flight."], "indigo bunting": ["They have a short, conical bill and a long, forked tail, which they often fan out when perched.", "Indigo buntings are often seen in open fields and woodlands, often perching on low branches or shrubs."], "American robin": ["They have a short, stout bill and a white eye-ring, which can be seen even from a distance.", "Robins have a long tail with a white outer edge, which is often held upright when perched."], "bulbul": ["They have a bright, colorful plumage, often with a yellow or orange head and chest, and a black or brown back.", "Bulbuls are often seen perched on branches or wires, and they have a habit of flicking their tails up and down when perched."], "jay": ["Jays have a bright, colorful plumage, often with blue, black, and white markings.", "Jays have a long, pointed bill and a short, rounded tail, both of which can be used to identify them."], "magpie": ["Magpies have long, pointed tails, often with a white tip, and a long, curved beak.", "Magpies are known for their intelligence and curiosity, often seen exploring their environment and interacting with other animals."], "chickadee": ["Chickadees have a short, stubby bill and a round body, often with a white underside.", "Chickadees are known for their energetic, acrobatic behavior, often flitting between branches and hopping along the ground."], "American dipper": ["They have a short, stubby bill, adapted for catching aquatic insects, and a short tail.", "American dippers are often seen bobbing up and down on rocks near fast-flowing streams, using their wings to keep balance."], "kite (bird of prey)": ["Kites have a slim, streamlined body, with long, pointed wings and a hooked beak, adapted for hunting.", "Kites often display a distinctive \"V\" shape when soaring, with their wings held in a shallow angle."], "bald eagle": ["They possess a large, hooked beak and sharp talons, adapted for hunting and scavenging.", "In flight, bald eagles display a broad wingspan, often soaring gracefully with their wings held in a slight V-shape."], "vulture": ["Vultures have long, broad wings, often with a slight dihedral, and a long tail, which can be used to steer in flight.", "Vultures have a large, powerful beak, adapted for tearing apart carrion, and long, strong legs, which can be used to stand on carrion while feeding."], "great grey owl": ["They possess a large, round head with a prominent ear tuft, and a long, broad wingspan.", "Great grey owls have a mottled grey and white plumage, with a lighter underside, and a barred tail."], "fire salamander": ["They possess a stout body with short legs and a long tail, adapted for burrowing and climbing.", "Fire salamanders have a flattened head with small eyes and a wide mouth, adapted for catching prey."], "smooth newt": ["They have a smooth, slimy skin, often with a yellow or orange coloration, and a dark stripe running along the back.", "Smooth newts have a flattened head with a pointed snout and small eyes, and they often display a distinctive, jerky swimming motion."], "eft": ["Efts possess a flattened body with short legs and a long tail, adapted for crawling and burrowing.", "Efts have small eyes and a wide head, with a pointed snout and a wide mouth, adapted for feeding on small insects and other invertebrates."], "spotted salamander": ["They possess a long, slender body with short legs and a long tail, adapted for burrowing and swimming.", "Spotted salamanders have a wide, flat head with small eyes and a wide, rounded snout."], "axolotl": ["Axolotls have a unique coloration, ranging from shades of brown, black, and gray to bright pink, yellow, and green.", "Axolotls have short, stout legs and a long, powerful tail, adapted for swimming in their aquatic habitats."], "American bullfrog": ["They have a distinct, deep croak, which can be heard from a distance.", "They have a green or brown coloration with dark spots or stripes, and a yellow or white underside.", "They have a large, wide mouth with a protruding lower jaw, and long, webbed toes."], "tree frog": ["Tree frogs often have bright colors, such as green, yellow, or orange, which can help distinguish them from other animals.", "Tree frogs have large, bulging eyes with vertical pupils, which are adapted for nighttime activity."], "tailed frog": ["They have a slim body with long, slender legs and webbed feet, adapted for life in the water.", "Tailed frogs have large eyes with vertical pupils, adapted for seeing in low light. They also have a distinct pattern of spots or stripes on their backs."], "loggerhead sea turtle": ["They have a short, thick neck and a broad, paddle-like tail, which is used for swimming.", "Loggerhead sea turtles have large, flipper-like limbs, adapted for swimming in the ocean."], "leatherback sea turtle": ["Leatherback sea turtles have a long, tapered head and a pointed snout, distinguishing them from other sea turtles.", "Leatherback sea turtles have large, paddle-like flippers, adapted for swimming in open ocean waters."], "mud turtle": ["Mud turtles have a short neck and a small head, often with a yellow or orange stripe running down the center.", "Mud turtles have short, webbed feet, adapted for swimming, and a long, thick tail, which can be used as a rudder in the water."], "terrapin": ["Terrapins have a short neck and a broad, flat head, with a beak-like snout and small eyes.", "Terrapins have short, webbed feet, adapted for swimming, and a long tail, which can be used for balance and propulsion."], "box turtle": ["Box turtles have a short, thick neck and a head with a hooked upper jaw, adapted for feeding on vegetation.", "Box turtles have short, stout legs and toes, adapted for slow, deliberate movement on land."], "banded gecko": ["They possess a flattened body with large, round eyes and a short, pointed snout.", "Banded geckos have short, stubby legs and a long, thin tail, which can be used for defense."], "green iguana": ["They have a long, prehensile tail, often with a distinctive pattern of stripes or spots, which can be used to help distinguish them from other lizards.", "Green iguanas have a triangular head with a prominent crest of spines, and their eyes are typically yellow or orange."], "Carolina anole": ["They have a bright green body with a dark brown stripe running down the back, and a bright red or orange dewlap (throat fan) that is used for communication.", "Carolina anoles are also known for their ability to change color, ranging from green to brown, depending on their environment."], "desert grassland whiptail lizard": ["They have a distinct pattern of stripes or spots along their back and sides, often in shades of brown, tan, or yellow.", "They have a pointed snout and large eyes, adapted for hunting small insects.", "They have short legs and a long, whip-like tail, which they use to move quickly across the desert terrain."], "agama": ["They have a long, slender body with a short tail and four short legs.", "Agamas often display bright colors, such as blues, greens, and oranges, which can help distinguish them from other lizards."], "frilled-necked lizard": ["They have a long, slender body with short legs and a long tail, often with a pattern of stripes or spots.", "Frilled-necked lizards have large eyes and a pointed snout, adapted for hunting insects."], "alligator lizard": ["They have short legs and a long, powerful tail, which they use to swim and climb.", "Alligator lizards have a distinct pattern of dark spots and stripes on their back, which can be used to identify them."], "Gila monster": ["They have a unique pattern of black, pink, orange, and yellow scales, often with a banded pattern along the back.", "Gila monsters have a short, wide head with a pointed snout and small, beady eyes. They also possess a forked tongue, which they use to sense their environment."], "European green lizard": ["They possess a long, pointed snout and a long, thin tail, which can be twice as long as their body.", "European green lizards have a distinct pattern of scales on their back, with a row of spines running down the center of their back."], "chameleon": ["Chameleons possess a long, prehensile tail, often with stripes or spots, which can be used for balance and gripping.", "Chameleons have a unique ability to change color, often in response to their environment or mood, making them easy to spot."], "Komodo dragon": ["They have short, powerful legs with sharp claws, adapted for climbing and digging.", "Komodo dragons have a unique, scaly skin pattern, often with yellow, orange, or reddish hues."], "Nile crocodile": ["They possess a long, pointed snout with large, sharp teeth, and their eyes and nostrils are located on the top of their head, allowing them to remain submerged while still being able to breathe.", "Nile crocodiles have a distinctive pattern of scales on their back and tail, often with a yellowish-brown coloration."], "American alligator": ["They have a distinctive pattern of overlapping scales, often with a dark olive-green or black coloration.", "Alligators have short, stocky legs and webbed feet, adapted for swimming in water."], "triceratops": ["Triceratops have a large, frill-like structure behind the head, often with intricate patterns or spikes.", "Triceratops have a bulky body with four short legs, adapted for walking on land."], "worm snake": ["They are usually a uniform brown or gray color, with a smooth, glossy appearance.", "Worm snakes have small eyes and lack the external ear openings of other snakes, making them difficult to spot."], "ring-necked snake": ["They have a slender body with smooth scales and a pointed head, often with a black line running down the back.", "Ring-necked snakes have a short tail, usually with a black tip, and can be found in a variety of habitats."], "eastern hog-nosed snake": ["They have a thick body with a light-colored belly and a dark back, often with a pattern of blotches or stripes.", "Eastern hog-nosed snakes possess a distinctive defensive behavior, flattening their necks and hissing loudly when threatened."], "smooth green snake": ["Smooth green snakes have a pointed head and a long, thin tail, which can be used to distinguish them from other snakes.", "Smooth green snakes have smooth scales, which can be seen when viewed up close."], "kingsnake": ["Kingsnakes have a long, slender body with a smooth, glossy texture, and a pointed tail.", "Kingsnakes have a unique defensive behavior of vibrating their tails when threatened, which can be seen in a photo."], "garter snake": ["Garter snakes have a short, pointed head and a long, thin tail, often with a black tip.", "Garter snakes have small, smooth scales, which can be used to distinguish them from other snakes."], "water snake": ["They often have a pattern of dark bands or blotches along their back, which can be used to distinguish them from other snakes.", "Water snakes have a flattened tail, which helps them swim and maneuver in the water."], "vine snake": ["They have a distinct pattern of alternating light and dark bands along their length, often with a yellow or white underside.", "Vine snakes have large eyes with vertical pupils, adapted for hunting in low light."], "night snake": ["They have a distinct pattern of dark spots or stripes on their back, often with a light-colored belly.", "Night snakes have a smooth, glossy scales and a shiny black or dark brown coloration, which helps them blend in with their environment."], "boa constrictor": ["Boas have a distinct head shape, with a triangular snout and two heat-sensing pits located between the eyes and nostrils.", "Boas have a long tail, often with a pattern of stripes or spots, which can be used to distinguish them from other snakes."], "African rock python": ["They possess a large, triangular head with a long, thick body and short tail.", "African rock pythons have a unique pattern of scales on their bellies, which can be used to identify individual snakes."], "Indian cobra": ["Indian cobras have a long, slender body with a distinct yellow-brown or olive-green coloration, often with darker bands or spots.", "Indian cobras have a short, rounded snout and a pair of large, round eyes, which can be used to identify them."], "green mamba": ["They have a long, thin head with a pointed snout and large eyes.", "They have a long, thin tail that is often coiled when resting.", "They have a distinctive pattern of black and white scales on their back."], "sea snake": ["They possess a distinct head shape, often with a pointed snout and small eyes.", "Sea snakes are typically brightly colored, with patterns of stripes, spots, or bands, which can help distinguish them from other aquatic creatures."], "Saharan horned viper": ["They possess a stout body with a pattern of dark and light bands, often with a light-colored stripe running down the back.", "They have a short tail with a distinct rattle, which is used to warn potential predators."], "eastern diamondback rattlesnake": ["They have a large, triangular head and a thick body, often with a yellowish-brown coloration.", "Eastern diamondback rattlesnakes possess a heat-sensing pit between their eyes and nostrils, allowing them to detect prey in the dark."], "sidewinder rattlesnake": ["They possess a unique form of locomotion, moving sideways in a series of S-shaped curves, which can be seen in the sand.", "Sidewinder rattlesnakes have a rattle at the end of their tail, which can be heard when they are disturbed."], "trilobite": ["Trilobites possess a hard exoskeleton with a variety of spines, ridges, and bumps, which can be used to identify different species.", "Trilobites have two antennae and two to three pairs of jointed legs, which can be seen in fossilized specimens."], "harvestman": ["They possess two long, thin legs per body segment, giving them a spider-like appearance.", "Harvestmen have two eyes, located on the front of their head, and two antennae, located on the back of their head."], "scorpion": [" Scorpions have eight legs, two of which are longer than the others and are used for sensing.", " Scorpions have two large, curved claws at the front of their body, which are used for catching prey.", " Scorpions have a pair of eyes on the top of their head, which are used for navigation."], "yellow garden spider": ["They possess long, spindly legs with a bulbous abdomen, often with a white or yellow spot in the center.", "Yellow garden spiders often build large, circular webs with a distinct spiral pattern, making them easy to spot."], "barn spider": ["They possess long, spindly legs, often with a reddish hue, and a small head with two large eyes.", "Barn spiders often build large webs in barns and other structures, making them easy to spot."], "European garden spider": ["They possess long, spindly legs with a bulbous abdomen, and often display a characteristic \"X\" pattern on their backs.", "European garden spiders typically build large, circular webs with a distinct spiral pattern, making them easy to spot."], "southern black widow": ["They possess long, spindly legs, often with a glossy black coloration.", "Southern black widows have a bulbous abdomen, often with a pattern of red or orange spots."], "tarantula": ["They possess large, bulbous eyes, often with a reflective sheen, and a pair of large, forward-facing fangs.", "Tarantulas have a large, bulbous abdomen, often with a distinct pattern, and a pair of spinnerets at the end of their abdomen."], "wolf spider": ["Wolf spiders have eight eyes arranged in three rows, with two large eyes in the center and four smaller eyes on either side.", "Wolf spiders are typically dark brown or black in color, with some species displaying stripes or patterns on their bodies."], "tick": ["Ticks possess eight legs, which can be seen when magnified, and two distinct body parts, the head and the abdomen.", "Ticks have a pair of antennae and a pair of mouthparts, which can be seen when magnified."], "centipede": ["Centipedes have a pair of antennae on their head, used for sensing their environment.", "Centipedes have a pair of modified legs near their head, known as forcipules, which are used to capture prey.", "Centipedes have a flattened body shape, often with a yellowish or brownish coloration, and can be found in a variety"], "black grouse": ["They have a long, pointed tail and a short, rounded wingspan, adapted for quick flight.", "Males have a bright red wattle on the neck, which is used for display during courtship."], "ptarmigan": ["Ptarmigans have feathered feet, which help them stay warm and move easily through snow.", "Ptarmigans have short, rounded wings, which are adapted for short bursts of flight.", "Ptarmigans have a short, stout bill, which is adapted for eating seeds and other vegetation."], "ruffed grouse": ["They have a short, rounded tail, often with a white band at the tip, and a short, stout bill.", "Ruffed grouse have a distinctive \"drumming\" behavior, where they beat their wings rapidly against the air to create a loud sound. This behavior can be seen in photos."], "prairie grouse": ["They have a mottled brown and gray plumage, often with a white patch on the throat.", "Prairie grouse have a long, pointed tail, which they often fan out when displaying.", "Males have a bright yellow or orange patch on their neck, which they puff up during courtship displays."], "peafowl": ["Peafowl have a distinct head shape, with a crest of feathers on top and a bare facial area.", "Peafowl have long legs and a long neck, and they often have a strutting gait."], "quail": ["Quails have a distinctive pattern of mottled brown and white feathers, often with a black patch on the throat.", "Quails have short, strong legs and feet adapted for running, and they often display a hunched posture."], "partridge": ["They have a mottled brown and white plumage, often with a black or grey head and neck.", "Partridges have a short, stout bill and a short crest on the top of their head."], "african grey parrot": ["They have a large, curved beak and a prominent head crest, which can be raised or lowered depending on the bird's mood.", "African grey parrots have a unique vocal range, often mimicking human speech, which can be used to identify them."], "macaw": ["Macaws have long, pointed tails and long wings, allowing them to fly with agility and grace.", "Macaws have a large head and a short neck, and often display a hunched posture."], "sulphur-crested cockatoo": ["They have a white body with a yellow wash on the wings and tail, and a black beak.", "They have a large wingspan and a long tail, and are often seen perched on branches or flying in flocks."], "lorikeet": ["They possess a long, curved beak, adapted for feeding on nectar and pollen from flowers.", "Lorikeets have a small, compact body with short legs and a long, brush-tipped tail, often with a bright yellow tip."], "coucal": ["They have a large, round head with a short, thick bill and a long, curved neck.", "Coucals have long, powerful legs and feet adapted for walking on the ground, and often display a hunched posture."], "bee eater": ["They possess a long, curved bill adapted for catching insects, and often have a bright patch of feathers around the eyes.", "Bee eaters are known for their aerial acrobatics, often hovering in the air to catch their prey."], "hornbill": ["Hornbills have a long tail, often with a white tip, and a large wingspan, allowing them to soar gracefully.", "Hornbills have a compact body with short legs and a long neck, often held in a slightly hunched posture."], "hummingbird": ["Hummingbirds are known for their rapid wing beats, which can be seen when they hover in mid-air.", "Hummingbirds have a unique flight pattern, often darting from flower to flower in search of nectar."], "jacamar": ["They have a bright, glossy plumage, often with iridescent colors, and a crest of feathers on their head.", "Jacamars have a compact body and long wings, adapted for fast, agile flight, and often perch on branches or wires."], "toucan": ["Toucans have a distinct body shape, with a short, stout body and long tail, often with a bright yellow or orange tip.", "Toucans have short legs and long, curved toes, adapted for gripping branches and aiding in climbing."], "duck": ["Ducks have a compact body with short legs and webbed feet, adapted for swimming.", "Ducks often have a distinctive plumage, with bright colors and patterns, which can help to identify them."], "red-breasted merganser": ["They have a glossy green head with a white neck and chest, and a reddish-brown breast.", "The males have a black back and tail, while the females have a brown back and tail.", "They have a long, slender body and long, pointed wings, adapted for diving and swimming."], "goose": ["Geese have a distinctive honking call, which can be heard from a distance.", "Geese have a long, slender body with long legs and webbed feet, adapted for swimming. They often display a V-shaped formation when flying."], "black swan": ["Black swans have a long, curved neck and a distinctive red bill with a yellow tip.", "Black swans have a large, powerful wingspan and a long, slender body, adapted for swimming and flying."], "tusker": ["Tuskers have a large, bulky body with thick skin and short, rounded ears.", "Tuskers have a distinctive gait, with a slow, swaying walk and a tendency to swing their heads from side to side."], "echidna": ["They have a long, slender snout and a short, stubby tail.", "Echidnas have short, strong legs with sharp claws, adapted for digging and burrowing.", "They have a distinctive, egg-shaped body with a low profile, making them difficult to spot in their natural habitats."], "platypus": ["Platypuses have a streamlined body with short legs and webbed feet, adapted for swimming.", "Platypuses have a thick, waterproof fur coat, often with a light brown or dark brown coloration."], "wallaby": ["Wallabies have a distinct facial appearance with large, round eyes and a pointed muzzle.", "Wallabies have a unique, hopping gait, with their back legs propelling them forward in a series of jumps."], "koala": ["They have a thick, gray-brown fur coat, often with lighter patches on the chest and stomach.", "Koalas have a short, stocky body with short, stubby legs and long, curved claws adapted for climbing trees."], "wombat": ["Wombats have a broad, flat head with small ears and a short, pointed snout.", "Wombats have a thick, coarse coat of fur, often with a light-colored patch on the chest."], "jellyfish": ["Jellyfish are typically transparent or translucent, allowing them to blend in with their environment.", "Jellyfish often display a pulsing, rhythmic movement, which can be seen in photos."], "sea anemone": ["Sea anemones are typically attached to a hard surface, such as a rock or coral, and can be found in a variety of shapes and sizes.", "Sea anemones often display a pulsing or swaying motion, which can be used to distinguish them from other aquatic organisms."], "brain coral": ["Brain corals are typically found in a variety of colors, ranging from browns and grays to bright pinks and purples.", "Brain corals often have a hard, calcareous skeleton, which can be seen when the coral is exposed at low tide."], "flatworm": ["They possess a smooth, slimy surface, often with a mottled pattern of spots or stripes.", "Flatworms have a distinct lack of legs or other appendages, setting them apart from other animals."], "nematode": ["Nematodes have a distinct cuticle, or outer layer, which can be smooth or ridged and often displays a variety of colors.", "Nematodes possess a single, long, thread-like body, with no visible appendages or legs."], "conch": ["The shell is typically brightly colored, often with stripes or spots, and may have a glossy or matte finish.", "The shell is often found with a large, fleshy foot protruding from the opening, which is used for locomotion."], "snail": ["Snails possess a slimy, mucus-covered body, which helps them move and protects them from predators.", "Snails have two pairs of tentacles, one pair for sensing and the other for eating, which can be seen protruding from the shell."], "slug": ["Slugs possess two pairs of retractable tentacles, one pair for sensing light and the other for sensing smell.", "Slugs have a single, broad foot adapted for crawling and leaving a slimy trail behind them."], "sea slug": ["Sea slugs possess two pairs of antennae, one pair of rhinophores, and a pair of parapodia, which are used for locomotion and respiration.", "Sea slugs often have a distinctively shaped head, with two eyespots and a mouth at the front."], "chiton": ["Chitons possess a row of small, fleshy tentacles along the edge of their shells, which they use to sense their environment.", "Chitons have a muscular foot that they use to cling to rocks and other surfaces, and they often display a bright, mottled pattern on their shells."], "chambered nautilus": ["The shell is divided into chambers, connected by a tube-like siphuncle, which allows the nautilus to control its buoyancy.", "Chambered nautiluses have two tentacles, each with a distinct eye at the end, used for navigation and hunting prey."], "Dungeness crab": ["They possess five pairs of legs, with the front pair ending in large claws.", "Dungeness crabs have a short, broad abdomen and a long, spiny tail, which can be tucked under the carapace."], "rock crab": ["Rock crabs possess five pairs of legs, with the front pair ending in large claws used for defense and foraging.", "Rock crabs have a short, triangular tail tucked beneath their carapace, which is often hidden from view."], "fiddler crab": ["Fiddler crabs have a small, round body with short legs and a short, broad carapace.", "Fiddler crabs are often seen waving their large claw in the air, a behavior used to attract mates or ward off predators."], "red king crab": ["They have five pairs of legs, with the first pair ending in large claws, which are used for defense and foraging.", "Red king crabs have a long, slender abdomen and a short, broad tail, which is often tucked under the body."], "American lobster": ["The body of the American lobster is typically a mottled greenish-brown color, with lighter spots and stripes.", "The tail of the American lobster is long and tapered, with a fan-like shape when spread."], "spiny lobster": ["They have two large, spiny claws, one of which is typically larger than the other, and five pairs of walking legs.", "Spiny lobsters have a distinctively long, segmented tail, which can be used to propel them through the water."], "crayfish": ["Crayfish are typically a reddish-brown color, with lighter spots or stripes along their body.", "Crayfish have two antennae, which are used to sense their environment and detect food."], "hermit crab": ["Hermit crabs have two pairs of antennae, one pair short and one pair long, which they use to sense their environment.", "Hermit crabs have five pairs of legs, the last pair of which is modified into a pair of claws, which they use to grip onto their shells."], "isopod": ["Isopods have two antennae and two pairs of eyes, which can be used to distinguish them from other small invertebrates.", "Isopods have a pair of pincers at the end of their abdomen, which can be used to identify them."], "white stork": ["They have a large wingspan, often with black flight feathers, and long legs that trail behind them in flight.", "White storks have a white plumage with black wingtips, and a red bill and legs."], "black stork": ["They have a long neck and long legs, often standing in a hunched posture.", "In flight, black storks display a broad wingspan and a long, forked tail."], "spoonbill": ["Spoonbills have a long neck and a slender body, with long legs and webbed feet adapted for wading in shallow water.", "Spoonbills have a unique flight pattern, with their wings held in a shallow V-shape and their necks curved in an S-shape."], "flamingo": ["Flamingos have a distinct pink or reddish coloration, often with black or white accents, which can be seen from a distance.", "Flamingos possess a unique bill shape, with a downward-curving upper mandible and a spoon-shaped lower mandible, adapted for filter-feeding."], "little blue heron": ["They have long legs and a long neck, often held in an S-shape when in flight.", "Little blue herons have a white patch on their wings, visible when in flight, and a white line along their back."], "great egret": ["They have a white plumage with black legs and yellow feet.", "Great egrets have a long, broad wingspan and a distinctive, slow, heron-like flight pattern.", "They also have a long, thin tail with a black tip."], "bittern bird": ["Bitterns have a distinctive, mottled brown and black plumage, which helps them blend in with their marshy habitats.", "Bitterns have a hunched posture, often standing motionless in reeds and grasses, and have long legs adapted for wading."], "crane bird": ["Cranes have a distinctive, pointed bill and a large wingspan, often with a V-shaped neck when in flight.", "Cranes have a unique, loud call, which can be heard from a distance and is a useful identifier."], "limpkin": ["Limpkins have a long neck and a long, slender body, often with a hunched posture.", "Limpkins have long legs and feet, adapted for wading in shallow water, and often display a distinctive, upright stance."], "common gallinule": ["They have a dark gray body with white undertail coverts, and a white stripe running along the sides of their neck.", "Common gallinules have long legs and toes, adapted for walking on floating vegetation, and a short tail."], "American coot": ["They have a short, thick body and short legs, with a white patch on the back of the neck.", "American coots have a large, lobed, white-tipped tail, which is often held up in flight."], "bustard": ["They have a distinctive, upright stance, often with their wings held out to the sides.", "Bustards have a mottled brown and white plumage, with a white head and neck and a dark brown back.", "They have long legs and a long, curved bill, adapted for foraging on the ground."], "ruddy turnstone": ["They have a short, stout bill and short legs, adapted for foraging on rocky shores and mudflats.", "Ruddy turnstones are often seen in pairs, walking in a distinctive bobbing motion, turning over stones and other objects to find food."], "dunlin": ["They have a short, straight bill and short legs, adapted for foraging in shallow waters.", "Dunlins have a distinctive, rapid, bobbing motion when walking, which can be seen in photos."], "common redshank": ["They have long, bright orange legs and a long, thin, black bill.", "Common redshanks have a distinctive, upright stance, often standing on one leg with the other tucked up against their body."], "dowitcher": ["Dowitchers have a distinctive, upright posture, often with their heads held high and their tails pointed down.", "Dowitchers have a mottled brown and white plumage, with a white belly and dark stripes on their wings."], "oystercatcher": ["They have a long, slender bill adapted for prying open mollusks and other shellfish.", "Oystercatchers have a long, pointed tail and long, red legs, which they use to wade in shallow water."], "pelican": ["In flight, pelicans display a broad wingspan, often gliding gracefully with a slight V-shaped neck.", "Pelicans possess stout bodies and short legs with fully webbed feet, adapting them to aquatic habitats and aiding in swimming.", "They have a distinctive white head and neck, with a black or grey back and wings. The"], "king penguin": ["They have a large, upright posture, with a long, slender neck and a large, pointed head.", "King penguins have a long, bright orange bill and a bright orange patch on the side of their head. They also have a distinctive, bright yellow patch on their chest."], "albatross": ["Albatrosses have a large, hooked bill, often with a yellow or pinkish tinge, and a long, slender neck.", "Albatrosses have long, slender legs and webbed feet, adapted for swimming and walking on land."], "grey whale": ["Grey whales have a small dorsal fin located near the tail, and a series of bumps or knuckles along the back.", "Grey whales have a wide, flat head with a distinctive V-shaped blowhole, which is visible when the whale surfaces to breathe."], "killer whale": ["Killer whales have a large, robust body with a tall, curved dorsal fin, making them easily distinguishable from other marine mammals.", "Killer whales have a distinctive, pointed head and a large, curved mouth, which can be seen when they surface to breathe."], "dugong": ["They have a large, paddle-shaped tail and two flippers, adapted for swimming in shallow waters.", "Dugongs have a thick, grayish-brown hide, often with white spots, and a large, rounded body."], "sea lion": ["Sea lions have large, flipper-like front limbs and webbed hind feet, allowing them to move quickly in the water.", "Sea lions have a thick, muscular body with a long, tapered tail, often with a tuft of fur at the end."], "Chihuahua": ["They have a distinctive apple-shaped head with a short, pointed muzzle and large, erect ears.", "Chihuahuas have a long, thin tail that is often curved or curled over their back.", "They have a short, smooth coat that can come in a variety of colors and patterns."], "Japanese Chin": ["They have a long, silky coat with a distinctive mane around the neck and chest, often with a white blaze on the forehead.", "Japanese Chins have large, round eyes and a short, upturned nose, giving them a unique, expressive face."], "Maltese": ["They have a black nose and dark eyes, with a small, pointed muzzle and ears that hang close to the head.", "Maltese have a compact body with a long, plumed tail, and their legs are short and straight."], "Pekingese": ["They have a long, flowing coat of fur, often with a mane around the neck and shoulders.", "Pekingese have a flat face with a short muzzle, large eyes, and a black nose. They often have a topknot of fur on their head."], "Shih Tzu": ["They have a short muzzle and large, round eyes, giving them a sweet, gentle expression.", "Shih Tzus have a compact body with short legs and a long, fluffy tail, often curled over the back."], "King Charles Spaniel": ["They have a long, silky coat that is usually white with patches of black, tan, or red.", "King Charles Spaniels have a compact body with short legs and a long, feathered tail."], "Papillon": ["Papillons have a compact body with a long, feathered tail, often carried over the back.", "Papillons have a bright, alert expression, with large, round eyes and a short muzzle."], "toy terrier": ["They have a distinctive, pointed muzzle and large, round eyes, often with a bright, alert expression.", "Toy terriers have a thick, double coat of fur, usually in a variety of colors, with a soft, silky texture."], "Rhodesian Ridgeback": ["They have a muscular, athletic build with a deep chest and strong hindquarters, and a short, glossy coat.", "They have a long, pointed muzzle and large, alert ears, and their eyes are usually a deep, dark brown."], "Afghan Hound": ["They have a long, narrow head with a pointed muzzle and large, drooping ears.", "Afghan Hounds have a deep chest and a long, curved tail, which is often carried over the back. They have a unique, graceful gait, with a high-stepping, bouncy stride."], "Basset Hound": ["They have long, droopy ears that hang down to the sides of their face, and a short muzzle with a black nose.", "Basset Hounds have a short, smooth coat that is usually tri-colored, with a combination of black, tan, and white."], "Beagle": ["Beagles have a long, droopy ears and a short, square muzzle.", "Beagles have a sturdy, muscular body and a long, bushy tail, often carried high."], "Bloodhound": ["Bloodhounds have a large, muscular body with a deep chest and long, powerful legs, adapted for tracking and trailing.", "Bloodhounds have a short, dense coat, often with a black and tan or liver and tan coloration, and a long, pendulous tail."], "Bluetick Coonhound": ["Bluetick Coonhounds have a long, muscular body with a deep chest and long, pendulous ears.", "Bluetick Coonhounds have a distinctive bark, often described as a \"bawl,\" which is loud and resonant."], "Black and Tan Coonhound": ["They have a long, muscular body with a deep chest and long, drooping ears.", "They have a long, thin tail that is often carried low and has a slight curl at the end."], "Treeing Walker Coonhound": ["They have a short, glossy coat that is usually white with black or tan markings.", "They have long, drooping ears and a long, thin tail that is often carried high."], "English foxhound": ["They have a short, dense coat that is typically white with black, tan, or brown markings.", "English foxhounds have a long, narrow head with a long muzzle and large, drooping ears. They also have a long, bushy tail that is carried high when running."], "Redbone Coonhound": ["They have a long, muscular body with a deep chest and long, drooping ears.", "Redbone Coonhounds have a long, straight muzzle and a distinctive bark, which can help distinguish them from other breeds."], "borzoi": ["They have a long, silky coat that is often wavy or curly, and can be a variety of colors, including white, black, gray, and tan.", "Borzois have a long, curved tail and long, slender legs, which give them a graceful, elegant appearance."], "Irish Wolfhound": ["They have a long, shaggy coat that is usually gray, brindle, black, or red in color.", "Irish Wolfhounds have long, powerful legs and a long, curved tail that is carried low."], "Italian Greyhound": ["They have a short, fine coat that is usually grey, black, or fawn in color, and often have white markings.", "They have a long, thin tail that is usually carried low and curved slightly upward."], "Whippet": ["They have a short, smooth coat that is usually a solid color, such as black, white, or fawn.", "Whippets have long, slender legs and a deep chest, giving them a distinctive silhouette. They also have a long, thin tail that is often carried low."], "Ibizan Hound": ["They have a long, narrow head with large, pointed ears that stand erect and are often slightly curved.", "Ibizan Hounds have a short, smooth coat that is usually white with red or tan markings. They also have a long, thin tail that is often carried high."], "Norwegian Elkhound": ["They have a wedge-shaped head with a broad muzzle and pointed ears, and a thick, bushy tail that curves over their back.", "Norwegian Elkhounds have a muscular body with a deep chest and strong legs, adapted for hunting and tracking in the snow."], "Otterhound": ["They have a large, domed head with a long muzzle and drooping ears.", "Otterhounds have a muscular body with long legs and a deep chest, adapted for swimming and running."], "Saluki": ["Salukis have a long, narrow head with a pointed muzzle and large, erect ears.", "Salukis have a long, silky coat that is usually white, cream, or fawn in color, often with black or tan markings."], "Scottish Deerhound": ["They have a long, wiry coat that is usually gray or blue-gray in color, with a white chest and muzzle.", "They have a long, narrow head with a long muzzle and large, expressive eyes. Their ears are long and folded back against the head."], "Weimaraner": ["Weimaraners have a unique eye color, ranging from light amber to gray-blue, and often have a piercing gaze.", "Weimaraners have long, muscular legs and a deep chest, giving them a distinctive silhouette."], "Staffordshire Bull Terrier": ["They have a short, smooth coat that is typically brindle, black, or red in color.", "They have a distinctive, alert expression with small, dark eyes and a short muzzle.", "They have a wide, powerful jaw and a strong, muscular neck."], "American Staffordshire Terrier": ["They have a short, glossy coat that is typically brindle, black, or tan in color.", "They have a wide, flat head with a short muzzle, small ears, and dark, almond-shaped eyes."], "Bedlington Terrier": ["They have a long, narrow muzzle and small, triangular ears that are often folded forward.", "Bedlington Terriers have a distinctive, springy gait and a long, curved tail that is often carried over their back."], "Border Terrier": ["They have a short, broad head with a flat skull and a short muzzle, and their ears are small and V-shaped.", "Border Terriers have a muscular body with a deep chest and a long, straight tail. They have short legs and a distinctive, springy gait."], "Kerry Blue Terrier": ["They have a compact, muscular body with a deep chest and a long, tapered tail.", "Kerry Blue Terriers have a unique gait, with a high-stepping, prancing motion, and a lively, alert expression."], "Irish Terrier": ["They have a long, rectangular head with a pointed muzzle and small, triangular ears that fold forward.", "Irish Terriers have a muscular body with a deep chest and a long, straight tail that is usually carried high."], "Norfolk Terrier": ["They have a distinctive face with a short muzzle, large, round eyes, and a black nose.", "They have a long, shaggy tail that is often carried over the back."], "Norwich Terrier": ["They have a broad, flat head with a short muzzle and large, round eyes.", "They have a short, pointed tail that is often carried high and erect.", "They have a distinctive, V-shaped ears that are set high on the head."], "Yorkshire Terrier": ["They have a small, compact body with short legs and a long, straight tail.", "Yorkshire Terriers have a distinctive face with a long muzzle, large eyes, and erect ears."], "Wire Fox Terrier": ["They have a long, narrow muzzle and a pointed, fox-like face with dark, almond-shaped eyes.", "Wire Fox Terriers have a compact body with a deep chest and a long, bushy tail that is often carried high."], "Lakeland Terrier": ["They have a medium-length, wiry coat that is usually black and tan in color, with a white blaze on the forehead.", "Lakeland Terriers have a compact, muscular body with a deep chest and short, strong legs, giving them a sturdy, athletic appearance."], "Sealyham Terrier": ["They have a short, square muzzle and a broad head with a flat top, giving them a unique appearance.", "Sealyham Terriers have a short, thick neck and a deep chest, with a long, low-set tail that is often carried over the back."], "Airedale Terrier": ["They have a long, pointed muzzle and a strong, muscular body.", "They have a long, bushy tail that is usually carried high and is often wagged when excited.", "They have a distinctive, alert expression with bright, intelligent eyes."], "Cairn Terrier": ["They have a short muzzle and a broad head with small, triangular ears that stand erect.", "Cairn Terriers have a sturdy, compact body with short legs and a long, bushy tail that often curls over their back."], "Australian Terrier": ["They have a long, narrow muzzle and a short, erect tail.", "They have a compact, muscular body and short legs, giving them a sturdy, low-to-the-ground appearance.", "They have a distinctive, alert expression with bright, intelligent eyes."], "Dandie Dinmont Terrier": ["They have a double coat of soft, wiry fur, often in shades of gray, black, and tan, with a distinctive topknot of fur on the head.", "They have a short, upturned muzzle and large, dark eyes, giving them an alert, inquisitive expression."], "Boston Terrier": ["They have a short, smooth coat with a distinctive black and white pattern, often with a white blaze on the forehead.", "Boston Terriers have a compact body with short legs and a tail that is usually docked."], "Miniature Schnauzer": ["They have a square-shaped body with a short, muscular neck and a long, bushy tail.", "Miniature Schnauzers have a unique facial expression, with a long muzzle, dark eyes, and a beard and mustache."], "Giant Schnauzer": ["They have a strong, muscular body with a broad chest and a long, straight muzzle.", "Giant Schnauzers have a thick, bushy beard and eyebrows, as well as a long, feathered tail."], "Standard Schnauzer": ["They have a square-shaped body with a long, bushy beard and eyebrows, and a long, wiry tail.", "Standard Schnauzers have a distinctive, alert expression with a strong muzzle and a beard that frames their face."], "Scottish Terrier": ["They have a distinctive, pointed muzzle and ears that stand erect, giving them a unique facial appearance.", "They have a short, stumpy tail that is often carried high, and their legs are short and sturdy."], "Tibetan Terrier": ["They have a medium-sized, square-shaped body with a deep chest and a long, plumed tail that curls over the back.", "Tibetan Terriers have a distinctive facial expression with dark, almond-shaped eyes, a black nose, and a beard and mustache."], "Australian Silky Terrier": ["They have a distinctive wedge-shaped head with a long muzzle and pointed ears.", "They have a compact body with a long, low-set tail and short legs."], "Soft-coated Wheaten Terrier": ["They have a medium-sized, square-shaped body with a long, straight muzzle and a black nose.", "They have small, triangular ears that are set high on the head and a long, feathered tail that is carried low."], "West Highland White Terrier": ["They have a compact body with short legs and a long, fluffy tail, often carried over their back.", "West Highland White Terriers have a shaggy, double coat with a soft undercoat and a wiry outer coat, giving them a unique texture."], "Lhasa Apso": ["They have a distinctive face with a long, shaggy beard and mustache, and a topknot of fur on their head.", "Lhasa Apsos have a compact body with short legs and a long tail, often curled over their back."], "Flat-Coated Retriever": ["They have a distinctive, broad head with a long muzzle and a deep chest.", "They have a strong, muscular body with a long, straight tail and long, feathered legs."], "Curly-coated Retriever": ["They have a long, lean body with a deep chest and long legs, giving them a graceful, athletic appearance.", "Curly-coated Retrievers have a long, narrow head with a broad muzzle and a distinctive, high-set tail that is often carried in a slight curve."], "Golden Retriever": ["They have a broad head with a long muzzle, floppy ears, and a thick, feathered tail.", "Golden Retrievers have a muscular, athletic build with a deep chest and strong legs, adapted for swimming and retrieving."], "Labrador Retriever": ["They have a characteristic \"otter tail\" with a thick base and tapered tip, often carried high.", "Labrador Retrievers have a friendly, intelligent expression with dark, almond-shaped eyes and a black nose."], "Chesapeake Bay Retriever": ["They have a broad head with a deep muzzle and a strong, muscular neck.", "They have a strong, muscular body with a deep chest and a tail that is usually docked.", "They have webbed feet, which help them swim in the water."], "German Shorthaired Pointer": ["They have a short, dense coat with a distinctive speckled pattern, often with a solid color on the head and ears.", "German Shorthaired Pointers have long, feathered ears and a long, docked tail, which is often carried high when alert."], "Vizsla": ["They have a lean, muscular body with a long, tapered muzzle and pointed ears.", "Vizslas have a characteristic tail that is usually docked, giving them a unique silhouette."], "English Setter": ["They have a distinctive head shape with a long muzzle, large eyes, and long, drooping ears.", "English Setters have a graceful, athletic build with a long, muscular neck and a deep chest. They have long legs and a tail that is usually carried in a slight curve."], "Irish Setter": ["They have a long, muscular body with a deep chest and long legs, giving them a graceful, athletic appearance.", "Irish Setters have a distinctive, feathered tail that curves over their back, and a long, pointed muzzle."], "Gordon Setter": ["They have a distinctive, long muzzle and a deep chest.", "They have long, feathered ears and a long, feathered tail that is usually carried low.", "They have a strong, muscular build and a proud, alert stance."], "Brittany dog": ["They have a medium-length, wavy coat that is usually white with orange or liver-colored markings.", "Brittany dogs have long, feathered ears that hang down and a long, feathered tail that curves slightly upward."], "Clumber Spaniel": ["They have a long, silky coat that is usually white with orange or lemon markings.", "Clumber Spaniels have a unique gait, with a slow, rolling, and effortless stride."], "English Springer Spaniel": ["They have a distinctive, long muzzle and ears that hang down close to the cheeks.", "They have a long, feathered tail that is usually carried low and often wags when excited.", "They have a friendly, alert expression with dark, round eyes and a black nose."], "Welsh Springer Spaniel": ["They have a long, feathered tail and a broad, flat head with a short muzzle and large, dark eyes.", "Welsh Springer Spaniels have a muscular, athletic build with a deep chest and strong, well-muscled legs."], "Cocker Spaniel": ["They have a long, feathered tail and ears that hang down, framing their face.", "Cocker Spaniels have a round, expressive face with large, dark eyes and a short muzzle."], "Sussex Spaniel": ["They have a long, low-set body with a deep chest and a tail that is usually docked.", "Sussex Spaniels have a long, broad head with a flat skull, large, round eyes, and a long, square muzzle. They also have long, drooping ears that hang close to the cheeks."], "Irish Water Spaniel": ["They possess a long, wavy tail, often with a white tip, and a broad head with a long muzzle and large, drooping ears.", "Irish Water Spaniels have a muscular body with a deep chest and long, powerful legs, adapted for swimming and retrieving."], "Kuvasz": ["Kuvasz have a large, muscular body with a broad chest and a deep chest, and a strong, square muzzle.", "Kuvasz have a distinctive, alert expression with dark, almond-shaped eyes and erect, triangular ears."], "Schipperke": ["They have a thick, double coat of fur, often with a ruff around the neck and a plumed tail.", "Schipperkes have a compact body with short legs and a long, narrow muzzle, adapted for hunting small prey."], "Groenendael dog": ["They have a distinctive, pointed muzzle and erect ears, and a long, bushy tail that curves over their back.", "Groenendael dogs have a muscular, athletic build, with a deep chest and strong legs, adapted for agility and endurance."], "Malinois": ["They have a short, dense coat that is usually fawn or mahogany in color, with a black mask and ears.", "Malinois have a muscular, athletic build with a deep chest and a long, tapered tail."], "Briard": ["Briards have a long, shaggy head with a beard and moustache, and a long, pointed muzzle.", "Briards have a muscular body with a deep chest and strong legs, and a long, thick tail that is often carried low."], "Australian Kelpie": ["They have a pointed muzzle, erect ears, and a long, bushy tail that is often carried low.", "Australian Kelpies are known for their intelligence and energy, often displaying alert, attentive expressions."], "Komondor": ["They have a large, muscular body with a broad chest and a deep chest cavity, and a long, thick tail that curls over their back.", "Komondors have a distinctive facial appearance with a long, pointed muzzle, dark eyes, and long, drooping ears."], "Old English Sheepdog": ["They have a large, square head with a long muzzle and drooping ears, and a broad chest and shoulders.", "Old English Sheepdogs have a long, thick tail that is often curled over their back."], "Shetland Sheepdog": ["They have a long, pointed muzzle and erect ears, giving them a fox-like appearance.", "Shetland Sheepdogs have a long, bushy tail that curves over their back, and a thick mane around their neck."], "collie": ["Collies have a long, bushy tail that curves over their back, and their ears are usually erect and pointed.", "Collies have a lithe, athletic build, with long legs and a deep chest, adapted for herding and agility."], "Border Collie": ["They have a thick, double coat of fur, often with a black and white pattern, and a long, bushy tail.", "Border Collies are known for their intense gaze and alert posture, often with their head held high and ears perked."], "Bouvier des Flandres dog": ["They have a large, square head with a broad muzzle and a black nose, and their eyes are dark and almond-shaped.", "Bouvier des Flandres dogs have a muscular body with a deep chest and a long, thick tail that is carried low."], "Rottweiler": ["They have a distinctive black and tan coat, with a black mask and tan markings on the legs, chest, and muzzle.", "Rottweilers have a deep bark and a powerful, confident gait, often with a slight roll in the shoulders."], "German Shepherd Dog": ["They have a wedge-shaped head with a long muzzle, pointed ears, and dark, almond-shaped eyes.", "German Shepherds have a thick, double coat with a dense undercoat and a longer, harsher outer coat, often with a black and tan or black and silver pattern."], "Dobermann": ["They have a short, glossy coat that is usually black and tan, with a black mask and tan markings on the muzzle, chest, and legs.", "Dobermanns have a long, thin tail that is usually docked, and a confident, alert posture."], "Miniature Pinscher": ["They have a short, glossy coat that is typically black, brown, or red in color.", "Miniature Pinschers have a high-stepping gait, with their front legs moving in a straight line and their hind legs moving in a wide arc."], "Greater Swiss Mountain Dog": ["They have a distinctive black mask around their eyes and muzzle, and their ears are triangular and erect.", "They have a long, bushy tail that is carried low and curved slightly upward."], "Bernese Mountain Dog": ["They have a large, muscular body with a broad chest and strong legs, adapted for working in the mountains.", "Bernese Mountain Dogs have a distinctive, triangular-shaped head with a long muzzle and dark eyes."], "Appenzeller Sennenhund": ["They have a thick, double coat with a long, wavy outer coat and a dense, wooly undercoat.", "Appenzeller Sennenhunds have a strong, muscular body with a broad chest and a long, straight tail. They have a square-shaped head with a black mask and a short muzzle."], "Entlebucher Sennenhund": ["They have a medium-length, double coat with a thick undercoat and a wiry topcoat.", "Entlebucher Sennenhunds have a square-shaped body with a broad chest and muscular legs, and a long, bushy tail."], "Boxer": ["They have a short, smooth coat with a distinctive brindle pattern, often with white markings on the face, chest, and feet.", "Boxers have a square-shaped head with a short muzzle, a black nose, and a wide, expressive face."], "Bullmastiff": ["They have a short, dense coat that is typically fawn or brindle in color, with a black mask around the eyes and muzzle.", "Bullmastiffs have a distinctive, powerful gait, with a slow, rolling trot and a confident, alert posture."], "Tibetan Mastiff": ["They have a broad, flat head with a distinctive black mask around the eyes and muzzle, and a thick mane of fur around the neck.", "Tibetan Mastiffs have a deep, loud bark and a powerful, intimidating presence, making them easily recognizable."], "French Bulldog": ["They have a short, flat muzzle with large, round eyes and a wide, flat head.", "French Bulldogs have a short, smooth coat with a variety of colors, often with a white chest and face. They also have distinctive bat-like ears that stand erect."], "Great Dane": ["They have a long, straight tail and a thick, short coat that can be a variety of colors, including black, brindle, fawn, and blue.", "Great Danes have a tall, proud stance, with their ears often standing erect and their heads held high."], "St. Bernard": ["They have a distinctive, broad head with a short muzzle and a black nose, and a long tail that hangs low.", "St. Bernards have a deep chest and short, strong legs, giving them a powerful, sturdy appearance."], "husky": ["Huskies have a pointed muzzle and erect ears, and often display a wolf-like appearance.", "Huskies have a thick, bushy tail that curls over their back, and their eyes are often blue or brown."], "Alaskan Malamute": ["Alaskan Malamutes have a broad, wedge-shaped head with a strong muzzle and small, triangular ears.", "Alaskan Malamutes have a muscular body with a deep chest and a thick, bushy tail that is often carried over their back."], "Siberian Husky": ["They have a distinctive facial mask, with almond-shaped eyes and pointed ears, and a thick, bushy tail that curls over their back.", "Siberian Huskies have a compact, muscular body with a deep chest and strong legs, adapted for running and pulling sleds."], "Dalmatian": ["Dalmatians have a muscular, athletic build with a long, slender muzzle and a short, tapering tail.", "Dalmatians have long, strong legs and a deep chest, adapted for running and endurance."], "Affenpinscher": ["They have a compact body with a short muzzle and a distinctive, monkey-like face.", "Affenpinschers have a high-set tail that is often carried over their back, and their ears are typically cropped."], "Basenji": ["Basenjis have a unique, wrinkled forehead and a tightly curled tail, setting them apart from other breeds.", "Basenjis have a compact, muscular body with a deep chest and long, slender legs, adapted for running and agility."], "pug": ["Pugs have a compact body with short legs and a curled tail, often with a distinctive \"pug\" shape.", "Pugs have a thick, double coat of fur, often with a black mask and a fawn or apricot-colored body."], "Leonberger": ["They have a distinctive lion-like mane around their neck and chest, and a long, bushy tail.", "Leonbergers have a broad, deep chest and a strong, muscular body, with a large head and a broad muzzle."], "Newfoundland dog": ["They have a broad, deep chest and a large, powerful head with a long, broad muzzle and a black nose.", "Newfoundland dogs have a thick, long tail that hangs low and is often carried in a gentle curve. They also have large, webbed feet, adapted for swimming."], "Great Pyrenees dog": ["They have a large, muscular body with a broad chest and a thick, plumed tail that curls over their back.", "Great Pyrenees dogs have a distinctive facial appearance with a black mask around their eyes and a black nose."], "Samoyed": ["Samoyeds have a strong, muscular build with a broad chest and a thick, curled tail.", "Samoyeds have a thick, fluffy mane around their neck and shoulders, and their ears are often erect and pointed."], "Pomeranian": ["They have a small, compact body with a short muzzle and a fox-like face, often with a black nose and dark eyes.", "Pomeranians have a thick, bushy tail that curls over their back, and their ears are typically erect and triangular."], "Chow Chow": ["They have a thick, double coat of fur, often in shades of red, black, blue, or cream, and a curled tail.", "Chow Chows have a unique gait, walking with a slow, shuffling motion, and often appear to be smiling."], "Keeshond": ["They have a thick, double coat of fur, with a long, straight outer coat and a soft, dense undercoat.", "Keeshonds have a thick, bushy tail that curls over their back, and their ears are erect and pointed."], "brussels griffon": ["They have a compact body with a short, square-shaped back and a long, shaggy coat, often with a beard and mustache.", "Brussels griffons have a unique gait, with a high-stepping, prancing motion, and their ears are often cropped to a point."], "Pembroke Welsh Corgi": ["They have a thick, double coat of fur, usually in shades of red, sable, fawn, or black and tan.", "Pembroke Welsh Corgis have a short, fox-like face with large, pointed ears and a long, bushy tail."], "Cardigan Welsh Corgi": ["They have a long, fox-like face with large, pointed ears and a short, stubby tail.", "Cardigan Welsh Corgis have a thick, double coat of fur, usually in shades of red, sable, brindle, or black and tan."], "Toy Poodle": ["Toy Poodles have a compact body with a long, straight muzzle and a high-set tail.", "Toy Poodles have a distinctive gait, with a high-stepping, prancing motion."], "Miniature Poodle": ["They have a long, slender muzzle and a high-set tail that is often docked.", "Miniature Poodles have a compact body with long, slender legs and a proud, upright posture."], "Standard Poodle": ["They have a long, straight muzzle and a high-set tail, often carried in a curl over their back.", "Standard Poodles have a proud, upright posture, with a long neck and well-defined chest."], "Mexican hairless dog (xoloitzcuintli)": ["They have a long, slender muzzle and large, erect ears, often with a slight curl.", "Xoloitzcuintlis have a long, muscular neck and a deep chest, with a long, tapered tail. They often have a distinctive, graceful gait."], "grey wolf": ["Grey wolves have a thick, grey-brown coat with a lighter underside, often with a black tip on the tail.", "Grey wolves have a large, powerful build with long legs and a deep chest, adapted for endurance and speed."], "Alaskan tundra wolf": ["They have a large, broad head with a pointed muzzle, and long, bushy tails.", "Alaskan tundra wolves have large, powerful legs and feet, adapted for running and hunting in the snow."], "red wolf or maned wolf": ["Maned wolves have a long, reddish-brown coat with a black mane running down the back of the neck and shoulders.", "Both species have long, pointed ears and a bushy tail, often with a white tip.", "Red wolves have a more slender build than maned wolves, with a narrower muzzle and shorter legs."], "coyote": ["Coyotes have a slender, athletic build with long legs and a narrow chest, adapted for running and chasing prey.", "Coyotes are typically grayish-brown in color, with lighter fur on their underbelly and legs."], "dingo": ["Dingoes have a lean, muscular body with short legs and a long, thick coat of fur, often with a yellowish-brown or reddish-brown color.", "Dingoes are known for their distinctive howl, which can be heard in the wild and can help identify them in photos."], "dhole": ["They possess a long, bushy tail, often with a black tip, and a thick mane of fur along the neck and back.", "Dholes have a compact body with short legs and a long snout, adapted for hunting in dense vegetation."], "African wild dog": ["They have long legs and a lean body, with a long, bushy tail that is often held low to the ground.", "African wild dogs have large, rounded ears that are set high on the head, and a muzzle that is shorter than other canids."], "hyena": ["They possess a powerful, muscular body with a long, bushy tail and short, stocky legs.", "Hyenas have a unique, striped coat pattern, often with a mane of fur around the neck and shoulders."], "red fox": ["They have a pointed muzzle and large, pointed ears, which are often held erect.", "Red foxes have a long, bushy tail, which is often held in a curved position when running."], "kit fox": ["They have a sandy-gray coat with a white underside, often with black patches on the face and legs.", "Kit foxes are small, typically weighing less than 5 pounds, and have short legs adapted for digging burrows."], "Arctic fox": ["They have a small, triangular face with a pointed muzzle, small ears, and a bushy tail.", "Arctic foxes have short legs and a compact body, adapted for life in the cold."], "grey fox": ["They have a slender, agile body with long legs and a pointed muzzle, adapted for climbing trees and hunting small prey.", "Grey foxes have large, pointed ears and a bushy tail, which can be used to distinguish them from other fox species."], "tabby cat": ["Tabby cats have a distinctive facial shape, with large, round eyes and a short, pointed muzzle.", "Tabby cats have a medium-length tail, often with a distinctive \"ticked\" pattern, and a thick, muscular body."], "tiger cat": ["They have a medium-sized body with a long, thick tail, and their ears are typically pointed and tufted.", "Tiger cats have a unique facial structure, with a broad forehead, wide-set eyes, and a short muzzle."], "Persian cat": ["They have a broad, round face with large, round eyes and a short, flat nose.", "Persian cats have a compact body with short legs and a long, thick neck, giving them a regal appearance."], "Siamese cat": ["Siamese cats have a slender body with long legs and a long, tapering tail.", "Siamese cats have a unique coat pattern, with a light-colored body and darker points on the face, ears, legs, and tail."], "Egyptian Mau": ["They have a slender, muscular body with a long, graceful neck and a short, rounded muzzle.", "Egyptian Maus have large, almond-shaped eyes and a short, tufted tail. They also have long, slender legs and small, rounded ears."], "cougar": ["They possess a long, muscular body with a long tail, often with a black tip.", "Cougars have a large head with a pointed muzzle, small ears, and powerful jaws."], "lynx": ["Lynx have a compact body with long legs and large, padded paws, adapted for walking on snow and climbing trees.", "Lynx have a thick, spotted coat, often with a ruff of fur around the neck, which helps them blend into their environment."], "leopard": ["Leopards have a long, muscular body with short legs and a long tail, adapted for climbing and leaping.", "Leopards have a wide, rounded head with small ears and large eyes, adapted for nighttime hunting."], "snow leopard": ["They possess a long, thick tail, often with a black tip, which helps them balance when climbing and jumping.", "Snow leopards have a wide, flat head with small ears, short legs, and a stocky body, adapted for life in cold climates."], "jaguar": ["Jaguars have a large, muscular body with a short tail and long legs, adapted for climbing and leaping.", "Jaguars have a broad head with a short muzzle and powerful jaws, adapted for hunting large prey."], "lion": ["Lions have a large, muscular body with a short tail and long legs, adapted for running and hunting.", "Lions have a unique facial structure, with a broad muzzle, long whiskers, and a tuft of fur on the chin."], "tiger": ["Tigers have a large, muscular body with a long tail and powerful legs, adapted for hunting and leaping.", "Tigers have a characteristic facial structure, with a broad forehead, small ears, and a wide, rounded muzzle."], "cheetah": ["Cheetahs have a slender, long-legged body, with a small head and a long tail.", "Cheetahs have a distinctive facial pattern, with black tear-like lines running from the eyes to the mouth."], "brown bear": ["They have long, curved claws adapted for digging and tearing, and a thick coat of fur, often with a lighter muzzle and chest.", "Brown bears are typically solitary animals, and can be identified by their slow, lumbering gait."], "American black bear": ["They have a large, round head with small ears and a short, pointed snout.", "American black bears have short, curved claws adapted for climbing trees and digging for food.", "They have a large, muscular body and a short, bushy tail."], "polar bear": ["Polar bears have a large, bulky body with a short, rounded snout and small ears, distinguishing them from other bear species.", "Polar bears have long, curved claws adapted for gripping ice and snow, and their hind legs are longer than their front legs, allowing them to stand upright."], "sloth bear": ["Sloth bears have long, curved claws adapted for digging and foraging for termites and ants.", "Sloth bears have a long snout and small ears, and their heads are often held low to the ground when foraging."], "mongoose": ["Mongooses have short legs and a long tail, often with a distinctive tuft at the end.", "Mongooses are known for their agility and quick reflexes, often seen darting around and leaping between objects."], "meerkat": ["They have a light-colored face with dark patches around the eyes, often with a white stripe running from the nose to the back of the head.", "Meerkats have short legs and long claws adapted for digging, and they often stand upright on their hind legs to survey their surroundings."], "tiger beetle": ["They possess a bright, metallic coloration, often with stripes or spots, which can range from green to blue to red.", "Tiger beetles have long, curved mandibles, which they use to capture prey, and are often seen running quickly across the ground."], "ladybug": ["Ladybugs have a distinct oval shape, with two antennae and six legs, and are typically quite small, ranging from 1-10mm in length.", "Ladybugs have a hard, protective shell, which can be smooth or ridged, and may have a glossy or matte finish."], "ground beetle": ["They possess short antennae and long legs, adapted for running quickly across the ground.", "Ground beetles often display a range of colors, from black to metallic green or blue, and may have stripes or spots."], "longhorn beetle": ["Longhorn beetles have a distinct body shape, with a long, cylindrical body and short legs.", "Longhorn beetles often display bright colors, such as red, yellow, or black, and may have stripes or spots."], "leaf beetle": ["Leaf beetles have long antennae and short legs, and often display a metallic sheen.", "Leaf beetles possess a hardened exoskeleton, which can be seen in the form of ridges or bumps on their backs."], "dung beetle": ["Dung beetles possess short antennae and six legs, with the front pair adapted for digging and rolling dung.", "Dung beetles often display a variety of colors, ranging from black to brown to metallic green or blue."], "rhinoceros beetle": ["They possess a large, oval-shaped body with a hard, shiny exoskeleton, often displaying a range of colors from black to brown.", "Rhinoceros beetles have short, powerful legs adapted for digging and climbing, and long antennae used for sensing their environment."], "weevil": ["Weevils have a small, compact body, often with a hard, shiny exoskeleton, and short legs adapted for burrowing.", "Weevils may display a variety of colors, from black to brown to red, and may have stripes or spots on their bodies."], "fly": ["Flies have a distinct head shape, with large compound eyes and a pair of antennae.", "Flies have a slender body with short legs, often with a pattern of stripes or spots."], "bee": ["Bees possess two pairs of wings, with the hind pair smaller than the front pair, and a pair of antennae on their heads.", "Bees have a slender, segmented body with three pairs of legs, adapted for crawling and clinging to surfaces."], "ant": ["Ants have two antennae, used for sensing their environment, and six legs, adapted for walking and digging.", "Ants come in a variety of sizes and colors, ranging from black to red to yellow, and can be identified by their distinct mandibles."], "grasshopper": ["They possess two pairs of wings, with the front pair being larger and more rigid than the hind pair.", "Grasshoppers have long, spindly legs adapted for jumping, and their bodies are typically green or brown in color."], "cricket insect": ["Crickets have three pairs of legs, with the front pair adapted for jumping.", "Crickets have a distinct chirping sound, which can be heard when they rub their wings together.", "Crickets have a slender body with a humped back, and are typically brown or black in color."], "stick insect": ["They possess long antennae and legs, often with spines or spikes, and may have wings or be wingless.", "Stick insects may display a variety of colors, from green to brown, and may have stripes or spots to further aid in camouflage."], "cockroach": ["They have two sets of wings, with the front pair being longer and thicker than the back pair.", "Cockroaches are typically dark brown or black in color, with some species having lighter stripes or patterns."], "praying mantis": ["They possess long, spindly legs with raptorial forelegs adapted for grasping prey, often held in a characteristic \"praying\" posture.", "Praying mantises have a slender body with a narrow waist and a pair of wings, often with a mottled pattern."], "cicada": ["They possess two pairs of wings, with the front pair being larger and more transparent than the back pair.", "Cicadas have a stout body with short legs, and are often seen clinging to trees or other surfaces."], "leafhopper": ["Leafhoppers have a wide range of colors, from green to brown to yellow, and often display patterns of stripes or spots.", "Leafhoppers are known for their jumping ability, and can often be seen leaping from leaf to leaf."], "lacewing": ["Lacewings have large, compound eyes, and their bodies are usually green or brown in color.", "Lacewings have long, slender abdomens, and their wings are often held in a tent-like position when at rest."], "dragonfly": ["Dragonflies possess two large compound eyes, which are often visible from the side, and three small ocelli eyes on the top of the head.", "Dragonflies have long, thin antennae and a pair of short, jointed legs, adapted for perching on vegetation."], "damselfly": ["Damselflies have large, compound eyes, which are often brightly colored and can be seen from the side of the head.", "Damselflies have long, thin antennae and three pairs of legs, which are often held close to the body."], "red admiral butterfly": ["They have a wingspan of about 2.5 inches, and their wings are held in a V-shape when at rest.", "Red admiral butterflies have a long, slender body with antennae that are clubbed at the end."], "ringlet butterfly": ["They have a small, compact body with short antennae and a wingspan of about 2.5-3.5 cm.", "The underside of the wings is usually a light brown or gray color, with a pattern of small spots."], "monarch butterfly": ["Monarchs have a long, slender body with two pairs of wings, which are held together when at rest.", "Monarchs have a slow, fluttering flight pattern, often seen in large groups, which can help distinguish them from other butterflies."], "small white butterfly": ["They have a small, slender body with long antennae and a pair of small, clubbed tails.", "They have a slow, fluttering flight pattern, often hovering in one spot for a few seconds before moving on."], "sulphur butterfly": ["They have a medium-sized wingspan, typically between 2-3 inches, and a slender body.", "The wings of a sulphur butterfly are often held in a V-shape when at rest, and they often display a slow, fluttering flight pattern."], "gossamer-winged butterfly": ["The wings are often transparent or translucent, with a metallic sheen, and the antennae are long and thin.", "The wingspan of gossamer-winged butterflies is typically small, ranging from 1.5 to 2.5 inches."], "starfish": ["Starfish possess a hard, spiny exterior, often with a bumpy texture, and can range in color from bright orange to deep purple.", "Starfish have a wide range of sizes, from a few centimeters to over a meter in diameter."], "sea urchin": ["Sea urchins have a distinct five-part symmetry, with a central mouth surrounded by five rows of tube feet.", "Sea urchins have a hard, calcareous shell, often with a pattern of bumps or spines, which can be used to distinguish them from other sea creatures."], "sea cucumber": ["They possess a unique set of tube feet, which are used for locomotion and feeding.", "Sea cucumbers often display a range of colors, from browns and grays to bright oranges and reds."], "cottontail rabbit": ["Cottontail rabbits have large, round ears, often with a black tip, and a short muzzle.", "Cottontail rabbits have a compact body with short legs, adapted for hopping and running, and often display a hunched posture."], "hare": ["Hares have a distinct coloration, often with a grayish-brown back and white underside, and may have a black line running down their back.", "Hares have a compact body with a short tail, often with a white tip, and long, powerful claws adapted for digging."], "Angora rabbit": ["They have a long, slender body with a short neck and a small head, and their ears are often long and upright.", "Angora rabbits have a unique, tufted tail, which is often longer than their body and stands out from their fur."], "hamster": ["They have small ears and eyes, and a short snout with a small nose.", "Hamsters have thick fur, often with a light-colored belly, and a dark stripe running down their back."], "porcupine": ["Porcupines have long, curved claws adapted for climbing trees, and a short, bushy tail with a tuft of quills at the end.", "Porcupines have small eyes and ears, and a pointed snout, which can be seen in profile."], "fox squirrel": ["They have a long, bushy tail with a white tip, which is often held upright when running or climbing.", "Fox squirrels have large, round ears and a pointed muzzle, distinguishing them from other squirrel species."], "marmot": ["Marmots have a distinct facial appearance with small eyes and ears, and a short, rounded muzzle.", "Marmots have long, thick fur, often with a grizzled pattern of light and dark colors, which helps them blend into their environment."], "beaver": ["Beavers have a large, broad head with small eyes and ears, and a wide, flat muzzle.", "Beavers have short, thick legs with webbed feet, adapted for swimming and building dams."], "guinea pig": ["They have a short, dense coat of fur, often with a variety of colors and patterns, and long, erect ears.", "Guinea pigs have a short muzzle with a wide, flat nose, and small, dark eyes."], "common sorrel horse": ["They have a long, muscular neck and a broad chest, with a short back and sloping croup.", "They have a short, thick head with large, expressive eyes, and a short muzzle.", "They have long, strong legs with well-defined tendons and a deep girth."], "zebra": ["Zebras have long, erect ears and a short, stocky body with a long, tufted tail.", "Zebras have a thick mane of hair running along their neck and back, and often have a white muzzle and white underbelly."], "pig": ["Pigs have a characteristic snout, with a flat, upturned nose and long, curved upper lip.", "Pigs have short, bristly hair, often in shades of black, gray, or brown. They also have a short, curly tail."], "wild boar": ["They have a thick, bristly coat of fur, often with a black or brown coloration, and a long, pointed snout.", "Wild boars have a distinctive set of tusks, which are curved and sharp, and can be seen when the animal is in profile."], "warthog": ["Warthogs have a stocky body with short legs and a long tail, often with a tuft of hair at the end.", "Warthogs have a distinctive mane of bristly hair running along their backs, which stands up when they are alarmed."], "hippopotamus": ["They have a thick, grayish-brown hide, often with a pinkish tinge, and short, sparse hair.", "Hippos have large, curved tusks and long, sharp incisors, which can be seen when their mouths are open."], "ox": ["Oxen have a thick, shaggy coat of fur, usually in shades of brown or black.", "Oxen have long, powerful legs and hooves adapted for walking on rough terrain."], "water buffalo": ["They have long, curved horns that can reach up to two meters in length.", "Water buffaloes have a shaggy coat of fur, often black or dark brown in color, and a long, thick tail."], "bison": ["Bison have short, curved horns and a shaggy coat of fur, often brown or black in color.", "Bison have a short, thick tail and a large head with a wide muzzle, adapted for grazing on grasses."], "ram (adult male sheep)": ["Rams have a thick, woolly coat, often with a darker coloration than female sheep.", "Rams have a muscular, stocky body with a short tail, and often display a proud, upright posture."], "bighorn sheep": ["They have a thick, woolly coat, often with a light-colored underside, and a short tail.", "Bighorn sheep have a muscular body and short legs, adapted for climbing steep, rocky terrain."], "Alpine ibex": ["They have a stocky body with short legs and a thick, shaggy coat, often with a light brown or gray coloration.", "Alpine ibex are adapted to mountainous terrain, and can often be seen scaling steep cliffs and rocky outcrops."], "hartebeest": ["They have a large, muscular body with a sloping back and long, thin legs.", "Hartebeests have a distinctive, lyre-shaped horns that curve backwards and upwards."], "impala (antelope)": ["Impalas have long, slender legs and a short tail, and are known for their impressive leaps, often clearing distances of up to 10 meters.", "Impalas have a characteristic tuft of black hair on the tip of their tails, which is often visible when they are running."], "gazelle": ["They have a distinctive facial appearance, with large eyes, long ears, and a short muzzle.", "Gazelles have a light-colored coat with dark stripes or spots, which can be used to distinguish them from other animals."], "arabian camel": ["They have long, curved necks and long legs, adapted for walking in the desert.", "Arabian camels have two rows of long eyelashes, which help protect their eyes from sand and dust.", "They have two large, wide feet, which help them walk on sand and other soft surfaces."], "llama": ["Llamas have a long, slender neck and a compact body with a short, tufted tail.", "Llamas have long, slender legs and a thick, woolly coat, often with a distinct pattern of light and dark patches."], "weasel": ["Weasels have a distinct facial appearance with small, round eyes and a pointed snout.", "Weasels have a light brown or reddish-brown fur, often with white or yellowish markings on the face, chest, and underside."], "mink": ["They have a glossy, dark brown coat with a white patch on their throat and chin.", "Minks have small, rounded ears and a pointed muzzle, with a black nose and small eyes."], "European polecat": ["They have a thick, dense coat of fur, usually brown or black in color, with white patches on the face and chest.", "European polecats have a long, bushy tail with a black tip, which is often held upright when alert."], "black-footed ferret": ["They have a light-colored coat with dark legs and feet, and a black tip on their tail.", "They have long, sharp claws adapted for digging and burrowing, and a long neck and head with a pointed snout."], "otter": ["Otters have a long, tapered tail, often with a white tip, which is used for propulsion and steering in the water.", "Otters have a thick, dense fur coat, often with a lighter color on the underside, which helps keep them warm and dry in the water."], "skunk": ["Skunks have a short, stocky body with short legs and a long, bushy tail.", "Skunks have a pointed snout and small ears, and are often seen with their tail raised in a defensive posture."], "badger": ["Badgers have short, stocky legs and a long, thick body, often with a grayish-brown fur.", "Badgers have long, sharp claws adapted for digging, which can be seen when they are walking or digging."], "armadillo": ["Armadillos have short legs and a long, pointed snout, adapted for digging and foraging.", "Armadillos have a low-slung body, often with a hunched posture, and a short, stubby tail."], "three-toed sloth": ["They possess three long claws on each hand and foot, adapted for gripping branches and hanging upside down.", "Sloths have a slow, deliberate movement, often seen hanging from branches or slowly climbing."], "orangutan": ["They have long, shaggy hair, often with a distinctive crest on the head.", "Orangutans have long, powerful arms and short legs, adapted for swinging through trees. They also have a distinctive, stooped posture."], "gorilla": ["Gorillas have a distinctive face with a prominent brow ridge, small ears, and a wide, flat nose.", "Gorillas have a thick, dark coat of fur, often with a silver or white patch on the back."], "chimpanzee": ["Chimpanzees have long arms and legs, with hands and feet adapted for grasping and climbing.", "Chimpanzees have a thick, shaggy coat of fur, often with a lighter color on the face, chest, and hands."], "gibbon": ["Gibbons have a distinct facial appearance with large, round eyes, often surrounded by dark patches or \"masks.\"", "Gibbons possess a long, thick tail, which is often used for balance when moving through trees."], "siamang": ["They have long arms and legs, with hands and feet adapted for gripping branches, and a long tail for balance.", "Siamangs are known for their loud, distinctive vocalizations, which can be heard from far away and help to identify them."], "guenon": ["They possess a long, bushy tail, often with stripes or bands, which can be longer than their bodies.", "Guenons have a compact body with elongated limbs, adapted for leaping between trees, and often display a hunched posture."], "patas monkey": ["They have long, slender limbs and a long tail, which is often held upright when running.", "Patas monkeys have a distinctive facial appearance, with a wide, flat nose and large eyes."], "baboon": ["Baboons have a long, dog-like tail, often with a tuft of hair at the end, and a hunched posture when walking.", "Baboons have long, powerful arms and legs, adapted for climbing and leaping, and often display a distinctive, upright posture when standing."], "macaque": ["Macaques have a compact body with long, slender limbs and a long tail, often with a tuft of fur at the end.", "Macaques often display a hunched posture, with their hands and feet adapted for climbing and grasping."], "langur": ["Langurs have a long, bushy tail, often with a white tip, which can be longer than their bodies.", "Langurs have a compact body with long limbs, adapted for leaping between trees, and often display a hunched posture."], "black-and-white colobus": ["They have a long, white tail with a tuft of black fur at the end, which is often held upright when the colobus is moving.", "Black-and-white colobus have long, slender arms and legs, adapted for leaping between trees, and often"], "proboscis monkey": ["They have long, shaggy fur, often with a reddish-brown hue, and a long, bushy tail.", "Proboscis monkeys have long, powerful legs adapted for leaping between trees, and often display a hunched posture."], "marmoset": ["Marmosets possess a compact body with elongated limbs, often displaying a hunched posture.", "Marmosets have a long, bushy tail, often with stripes or bands, which can be longer than their bodies.", "Marmosets have a distinctive call, which can be heard in the background of a photo."], "white-headed capuchin": ["They have a long, prehensile tail, which they use to hang from branches and swing between trees.", "White-headed capuchins have a compact body with long, slender limbs, adapted for climbing and leaping."], "howler monkey": ["They possess a long, prehensile tail, often with a tuft of fur at the end, which they use to hang from branches.", "Howler monkeys have a loud, deep call, which can be heard up to three miles away, making them easy to identify."], "titi monkey": ["Titi monkeys have a long, bushy tail, often with a white tip, which can be longer than their bodies.", "Titi monkeys have a compact body with elongated limbs, adapted for leaping between trees, and often display a hunched posture."], "Geoffroy's spider monkey": ["They have long, slender arms and legs, adapted for swinging and climbing through trees.", "Geoffroy's spider monkeys have a unique, shaggy coat of fur, ranging from light brown to black, with a white or yellowish underside."], "common squirrel monkey": ["They have a slender body with long, thin limbs and a long, bushy tail, often with a white tip.", "Common squirrel monkeys are often seen in groups, with their social behavior and vocalizations helping to identify them."], "ring-tailed lemur": ["They have a compact body with elongated limbs, especially rear legs, adapted for leaping between trees, and often display a hunched posture.", "Ring-tailed lemurs have a distinct facial appearance with large, round, reflective eyes adapted for nighttime activity, often surrounded by dark patches or \"masks.\""], "indri": ["They have a long, bushy tail, which is usually held upright when walking.", "Indris have long, powerful hind legs, adapted for leaping between trees, and often display a hunched posture.", "They have large, round eyes, adapted for nighttime activity, often surrounded by dark patches or \"masks.\""], "Asian elephant": ["They have large, round ears, often with a distinctive pattern of wrinkles, and a long tail with a tuft of hair at the end.", "Asian elephants have four short, thick legs and a large, bulky body, with a grayish-brown hide and sparse hair."], "African bush elephant": ["They have large, curved tusks, which are used for digging and defense, and are unique to each individual.", "African bush elephants have large ears, which are used to regulate body temperature, and are often shaped like the continent of Africa."], "red panda": ["They have a long, bushy tail, often with black and white rings, which can be longer than their bodies.", "Red pandas have a compact body with short legs and a round face, often with a black mask around the eyes."], "giant panda": ["They have a large, round head with small ears, and a short snout with a distinctive black nose.", "Giant pandas have a large, stocky body with short legs and a long, bushy tail."], "snoek fish": ["They have a distinctive dark stripe running along their sides, often with a lighter stripe above it.", "They have a large, fan-like dorsal fin and a small, rounded anal fin."], "eel": ["Eels have a distinct coloration, ranging from yellow to brown to black, often with stripes or spots.", "Eels have a unique swimming style, undulating their bodies to move through the water."], "silver salmon": ["Silver salmon have a long, streamlined body with a large head and a forked tail.", "Silver salmon have a distinctively large, hooked jaw, which is used to catch prey."], "rock beauty fish": ["They have a bright yellow body with a black stripe running along the length of their body, and a bright blue stripe running along the top of their head.", "Rock beauty fish have a large, fan-like tail with a yellow and black pattern, and two long, flowing fins on either side of their body."], "clownfish": ["Clownfish have a small, rounded body with a single dorsal fin and a long, flowing tail.", "Clownfish are often found in anemones, which can be used to identify them in a photo."], "sturgeon": ["They have a long, pointed snout and a wide, flat mouth adapted for bottom-feeding.", "Sturgeons have four barbels, or whiskers, near their mouths, which they use to detect prey.", "They also have a long, paddle-like tail, which is often used for propulsion in the water."], "gar fish": ["They possess long, pointed snouts and large, toothy jaws, often with a protruding lower jaw.", "Gar fish have a unique set of ganoid scales, which are diamond-shaped and often have a glossy sheen.", "They also have long, pointed fins, including a large dorsal fin and a long, whip-like tail fin."], "lionfish": ["They possess a wide, flat head with a large, protruding mouth and a pair of long, feathery tentacles above the eyes.", "Lionfish are typically brightly colored, with stripes or spots of red, orange, yellow, and white."], "pufferfish": ["They possess a large, protruding mouth with sharp teeth, and their eyes are often located on the top of their head.", "Pufferfish have a patterned skin with bright colors, often featuring stripes, spots, or other designs."], "abacus": ["The beads are usually arranged in two rows, with the upper row containing five beads and the lower row containing four.", "The beads are often brightly colored, making them easily distinguishable from other objects."], "abaya": ["Abayas often feature intricate embroidery or beading along the neckline, sleeves, and hem.", "Abayas are often worn with a hijab or headscarf, which can be used to distinguish them from other garments."], "academic gown": ["The gowns often have a velvet trim along the edges, and the hoods are usually lined with a different color to indicate the wearer's degree.", "Academic gowns are typically worn with a mortarboard hat, which is a flat, square cap with a tassel attached to the top."], "accordion": ["Accordions are typically brightly colored, often with intricate designs or patterns.", "Accordions have two straps, one for the left hand and one for the right, allowing them to be held and played."], "acoustic guitar": ["The strings are usually visible, often with a bridge and saddle at the bottom of the body.", "The headstock is typically visible, with tuning pegs and strings extending from it."], "aircraft carrier": ["Aircraft carriers are typically accompanied by several other vessels, such as destroyers and cruisers, which can help identify them.", "Aircraft carriers are usually equipped with several large guns and other weapons, which can be seen in the photo."], "airliner": ["Airliners typically have two or more engines, often visible from the side or rear, and a tail fin with a recognizable logo.", "Airliners have multiple windows along the fuselage, and may have a distinctive livery or paint scheme."], "airship": ["Airships are typically brightly colored, often with a logo or design painted on the side.", "Airships are usually suspended in the air by a network of cables and gondolas, which can be seen in the photo."], "altar": ["Altars often have a distinct shape, such as a square, rectangle, or circle, and may be decorated with candles, flowers, or other items.", "Altars may also have a canopy or roof, and may be surrounded by other religious items, such as statues or icons."], "ambulance": ["Ambulances are usually equipped with flashing lights, which can be seen from a distance.", "Ambulances are typically larger than other vehicles, and often feature a raised roof and back doors for easy access."], "amphibious vehicle": ["Amphibious vehicles have a unique propulsion system, typically featuring a propeller or jet drive for aquatic travel, and a separate engine for land travel.", "Amphibious vehicles often have a snorkel-like exhaust pipe, allowing them to travel underwater for extended periods of time."], "analog clock": ["The clock face is often surrounded by a metal or plastic frame, and the hands are usually made of metal.", "The clock may also have a pendulum or a winding key, which further distinguishes it from other objects."], "apiary": ["The hives are typically made of wood, with a removable lid or entrance for the bees.", "The area around the hives is often surrounded by a fence or other protective barrier, such as netting, to keep out predators."], "apron": ["Aprons often have pockets, which can be used to store tools or other items.", "Aprons are usually made of a durable material, such as cotton or canvas, and may have a pattern or design printed on them."], "trash can": ["Trash cans are often made of metal or plastic, and may be decorated with a variety of colors or patterns.", "Trash cans may also have handles or wheels, making them easier to move and distinguish from other objects."], "assault rifle": ["Assault rifles possess a box-shaped magazine, often located beneath the barrel, which can be used to distinguish them from other firearms.", "Assault rifles often have a collapsible stock, allowing them to be adjusted to fit the user, and a pistol grip for improved control."], "backpack": ["Backpacks often have several compartments, pockets, and zippers, allowing for easy organization and access to items.", "Backpacks are usually made of a durable material, such as canvas or nylon, and come in a variety of colors and patterns."], "bakery": ["The exterior of a bakery may be decorated with signs or logos, indicating the type of goods sold.", "The interior of a bakery may feature counters, shelves, and display cases filled with cakes, breads, and other baked goods."], "balance beam": ["Balance beams are often brightly colored, with a distinct pattern of alternating colors along the length of the beam.", "Balance beams are typically raised off the ground, either on a stand or suspended from the ceiling, making them easily distinguishable from other objects."], "balloon": ["Balloons are often filled with air or helium, giving them a distinct shape and buoyancy.", "Balloons are often tied to a string or ribbon, making them easy to identify."], "ballpoint pen": ["The tip of a ballpoint pen is usually made of metal and has a small ball at the end, which is used to dispense ink.", "Ballpoint pens often have a logo or brand name printed on the body, making them easily identifiable."], "Band-Aid": ["Band-Aids have a distinct adhesive backing, which can be seen when the Band-Aid is removed from its packaging.", "Band-Aids often feature a logo or other identifying marks, such as the red cross, which can help distinguish them from other objects."], "banjo": ["Banjos typically have four or five strings, with a bridge and tailpiece at the bottom of the body.", "Banjos are often decorated with ornate inlays, often featuring intricate designs or images."], "baluster / handrail": ["Handrails are typically curved or straight, and are often made of metal or wood. They are usually wider than the balusters and are designed to provide support and stability.", "Balusters and handrails are often found in staircases, balconies, and decks, and can be used to distinguish them from other objects in a photo."], "barbell": ["The weighted ends are usually circular and feature a knurled grip, allowing for a secure hold.", "Barbells are often accompanied by plates of varying sizes, which can be used to adjust the weight of the barbell."], "barber chair": ["Barber chairs often have a distinct, round base with a hydraulic pump for height adjustment.", "Barber chairs are often upholstered in leather or vinyl, with armrests and a headrest for comfort."], "barbershop": ["Inside, barbershops are often filled with chairs, mirrors, and other equipment used for grooming.", "Barbershops often have a distinct atmosphere, with customers waiting in line or conversing with the barber."], "barn": ["Barns are often painted red, though other colors are also common.", "Barns often have large doors, either sliding or hinged, and may have windows or other openings."], "barometer": ["Barometers are often mounted on a wall or stand, and may have a glass or plastic cover protecting the face.", "Barometers may also have additional features such as a thermometer or hygrometer, allowing them to measure temperature and humidity in addition to pressure."], "barrel": ["Barrels often have metal bands around them, which can be used to distinguish them from other objects.", "Barrels may have a distinct lid or plug, which can be used to identify them."], "wheelbarrow": ["The wheelbarrow is often filled with materials, such as soil, gravel, or mulch, which can help to identify it.", "Wheelbarrows are typically made of metal or plastic, and often feature a tray or bucket for carrying materials."], "baseball": ["Baseballs are usually white with red stitching, although other colors are available.", "Baseballs have a distinct shape, with a raised seam and a smooth, leathery surface."], "basketball": ["Basketballs have a unique texture, with a slightly pebbled surface and a raised, rubberized grip.", "Basketballs are often seen in motion, bouncing or being held by a person, making them easy to identify."], "bassinet": ["They often have a hood or canopy to provide shade and protection from the elements.", "Bassinets are often decorated with colorful fabrics, blankets, and pillows, making them easily distinguishable from other objects."], "bassoon": ["The bassoon has a double reed mouthpiece, which is a distinguishing feature from other woodwind instruments.", "Bassoons have a range of keys and levers, which are used to change the pitch of the instrument."], "swimming cap": ["Swimming caps are usually shaped like a dome, with a tight fit around the head and ears.", "Swimming caps often have a chin strap to keep them in place, which can be a useful visual feature for identification."], "bath towel": ["Bath towels are usually made of absorbent materials such as cotton or terry cloth, which can be identified by their texture.", "Bath towels often have a loop or hanger at one end, making them easy to identify."], "bathtub": ["Bathtubs often have a distinct faucet and spout, as well as a drain, which can be used to identify them.", "Bathtubs are often surrounded by tile or other materials, which can help distinguish them from other objects."], "station wagon": ["Station wagons often have a distinct rear hatch, which opens to reveal a large cargo area.", "Station wagons typically have four doors, with two on each side, and a large rear window."], "lighthouse": ["The top of the lighthouse is often marked with a bright light, which can be seen from a distance.", "Lighthouses are often situated on rocky outcrops or cliffs, making them stand out from the surrounding landscape."], "beaker": ["Beakers often have a scale or markings on the side, indicating the volume of liquid inside.", "Beakers are usually made of glass or plastic, and may have a lid or stopper for sealing."], "military hat (bearskin or shako)": ["Shako hats are tall, cylindrical hats with a wide brim and a tall, cylindrical plume on top.", "Both hats are typically adorned with a badge or insignia, often featuring a crest or coat of arms."], "beer bottle": ["The bottle is usually made of glass and has a distinct label with the brand name and logo.", "The bottle is often topped with a metal or plastic cap, which can be used to distinguish it from other containers."], "beer glass": ["Beer glasses often have a handle, allowing for easy gripping and drinking.", "Beer glasses may have a logo or design etched into the glass, such as a brewery's logo or a decorative pattern."], "bell tower": ["Bell towers often have a pointed roof, often with a cross or other religious symbol at the peak.", "Bell towers may have multiple levels, with windows or other openings, and often feature a staircase or ramp leading up to the bell."], "baby bib": ["Baby bibs often have a distinct shape, such as a triangle or rectangle, with a wide neck opening and fastening at the back.", "Baby bibs often feature bright colors and patterns, such as cartoon characters or animals, making them easily distinguishable."], "tandem bicycle": ["The handlebars are typically connected to the frame, allowing both riders to steer the bike.", "The tandem bike has two sets of pedals, one for each rider, and two sets of brakes, allowing both riders to control the speed.", "The tandem bike has two wheels, one in front of the other, and two sets of tires, allowing both riders to ride in tandem."], "bikini": ["Bikinis are often brightly colored or patterned, with a variety of cuts and styles.", "Bikinis are often made of lightweight, stretchy fabrics, such as spandex or nylon, which hug the body and show off curves."], "ring binder": ["The rings are often covered with a plastic or metal cover, which can be decorated with a logo or design.", "The rings are usually connected to a spine, which can be made of plastic or metal, and may have a label holder."], "binoculars": ["Binoculars often have a distinct shape, with a curved body and two eyepieces, and may have a strap or handle for easy carrying.", "Binoculars may also have a focusing knob or wheel, allowing the user to adjust the lenses for a clearer view."], "birdhouse": ["Birdhouses often have a slanted roof, which helps protect the interior from the elements.", "Birdhouses may also have perches or other features, such as a hinged door, to make them more attractive to birds."], "boathouse": ["Boathouses often have large windows, allowing for natural light and views of the water.", "Boathouses may also have a distinctive boathouse door, which is typically wide and tall to accommodate boats."], "bobsleigh": ["Bobsleighs have two sets of runners, one in the front and one in the back, which are used to steer the sled.", "Bobsleighs are often brightly colored, with a driver and two passengers sitting in the sled."], "bolo tie": ["The cord is usually worn around the neck, with the clasp and ornament resting at the center of the chest.", "Bolo ties are often associated with western fashion, and may feature designs such as cowboy hats, horseshoes, or other western-themed motifs."], "poke bonnet": ["The brim is often decorated with ribbons, flowers, or other adornments, and the bonnet is often worn with a veil.", "Poke bonnets are often worn with a dress or other formal attire, setting them apart from other hats."], "bookcase": ["Bookcases are often made of wood, metal, or plastic, and may have a distinct finish or color.", "Bookcases may have doors or drawers, and may be freestanding or wall-mounted, setting them apart from other furniture."], "bookstore": ["Inside, bookstores are filled with shelves of books, often arranged by genre or topic.", "Bookstores often have a distinct atmosphere, with comfortable seating areas and reading nooks, as well as a checkout counter."], "bottle cap": ["Bottle caps often have a distinct logo or design printed on them, making them easily identifiable.", "Bottle caps are usually made of metal or plastic, and may have a ridged or threaded edge for easy removal."], "hunting bow": ["The limbs are often made of composite materials, such as carbon fiber or fiberglass, and may be decorated with patterns or colors.", "The bowstring is usually made of a strong material, such as Dacron, and is connected to the limbs at the tips.", "The bow may also have a stabilizer, a weight attached to the riser to reduce vibration and improve accuracy."], "bow tie": ["Bow ties are usually made of fabric, often with a pattern or texture, and are often brightly colored.", "Bow ties are usually worn around the neck, either with a shirt or a suit, and can be tied in a variety of ways."], "brass memorial plaque": ["Memorial plaques often feature a raised border, with a flat surface in the center for engraving.", "Memorial plaques often feature a distinct shape, such as a rectangle, oval, or circle, which can help distinguish them from other objects."], "bra": ["Bras often have a closure in the back, such as a hook-and-eye or clasp, which can be used to distinguish them from other clothing items.", "Bras may also have decorative features, such as lace, bows, or embroidery, which can help to identify them."], "breakwater": ["Breakwaters often have a distinct shape, such as a curved line or a crescent, and may be visible from a distance.", "Breakwaters may also have a sloping surface, allowing waves to break against it and dissipate their energy."], "breastplate": ["Breastplates often have intricate designs, such as embossed patterns or engravings, which can help to identify them.", "Breastplates are often worn with other pieces of armor, such as a helmet or gauntlets, which can help to distinguish them from other objects."], "broom": ["The handle is usually made of wood or plastic, and may have a loop at the end for hanging.", "Brooms may also have a dustpan attached to the handle, making them easy to identify."], "bucket": ["The handle is often curved or looped, making it easy to carry.", "Buckets often have a distinct lip or rim around the top, which helps to contain the contents."], "buckle": ["Buckles often have a distinct shape, such as a circle, rectangle, or oval, and may be decorated with patterns or designs.", "Buckles may also have a distinct texture, such as a smooth or brushed finish, or be adorned with jewels or other embellishments."], "bulletproof vest": ["The vest may have a distinct pattern of straps and buckles, often with a zipper or Velcro closure.", "The vest may also have pockets or pouches for carrying items, such as magazines or ammunition."], "high-speed train": ["High-speed trains are often brightly colored, with distinct logos or branding, making them stand out from other trains.", "High-speed trains are usually equipped with multiple engines, allowing them to reach higher speeds than traditional trains."], "butcher shop": ["Butcher shops often have a large cutting board and a variety of knives and other tools used for cutting and preparing meat.", "Butcher shops may also have a variety of scales and other weighing equipment, as well as a cash register, to help customers purchase their desired items."], "taxicab": ["Taxicabs have a distinct shape, with a large, boxy body and four doors.", "Taxicabs are often equipped with a light on the roof, which is illuminated when the cab is available for hire."], "cauldron": ["Cauldrons often have a distinct shape, with a wide base and a narrower neck, and may be decorated with symbols or designs.", "Cauldrons are often used for cooking, so they may be seen with flames or smoke coming from them."], "candle": ["Candles often have distinct scents, which can be used to identify them.", "Candles may be decorated with patterns or colors, making them stand out from other objects."], "cannon": ["Cannons are typically mounted on a wheeled carriage, allowing them to be moved and aimed.", "Cannons often have a large, rectangular base plate, which helps to stabilize them when firing."], "canoe": ["Canoes often have a distinct seating arrangement, with two or more benches running along the length of the boat.", "Canoes are often decorated with colorful designs, such as stripes or geometric shapes, which can help to identify them."], "can opener": ["The cutting wheel is usually curved, with a pointed tip, and is designed to puncture the lid of a can.", "The turning knob is usually round and is used to rotate the cutting wheel, allowing it to cut through the lid."], "cardigan": ["Cardigans often have a collar, cuffs, and a waistband, and may feature pockets or other decorative details.", "Cardigans come in a variety of colors, patterns, and textures, making them easy to distinguish from other garments."], "car mirror": [" Car mirrors often have a reflective surface, allowing them to be easily distinguished from other objects.", " Car mirrors are usually mounted on a swivel, allowing them to be adjusted to different angles."], "carousel": ["Carousels often have brightly colored decorations, such as flags, banners, and lights, which can help distinguish them from other objects.", "Carousels are often accompanied by music, which can be heard in the background of the photo."], "tool kit": ["The tools are often arranged in a neat and organized manner, with each tool having its own designated spot.", "Tool kits often have a handle or strap for easy carrying, and may also have pockets or compartments for additional storage."], "cardboard box / carton": ["The sides of the box are often printed with text or images, such as a company logo or product information.", "Cardboard boxes / cartons are usually made of corrugated cardboard, which has a distinct texture and pattern of ridges and grooves."], "car wheel": ["The wheel is usually mounted on a metal rim, which is often painted or decorated with a logo or design.", "The wheel is usually connected to the car's suspension system with lug nuts, which can be seen in the photo."], "automated teller machine": ["They are typically mounted on a wall or stand, and have a slot for inserting cards and a slot for dispensing cash.", "Automated teller machines also have a variety of buttons and labels, such as \"withdrawal\" or \"deposit,\" which can help identify them."], "cassette": ["The cassette has a distinct hinged lid, which can be opened to reveal the tape inside.", "The cassette also has two small holes at the top, which are used to wind the tape."], "cassette player": ["The player has a series of buttons and knobs to control the playback, such as play, pause, fast forward, and rewind.", "The cassette player also has a headphone jack and a speaker, allowing it to be used with headphones or connected to an external speaker."], "castle": ["Castles often have a distinct gatehouse or drawbridge, allowing access to the inner courtyard.", "Castles are often surrounded by a moat, a deep ditch filled with water, which serves as a defensive measure."], "catamaran": ["Catamarans typically have two masts, with sails or awnings, and a large cockpit area for passengers.", "Catamarans are often brightly colored, with a variety of designs and patterns, making them easily distinguishable from other boats."], "CD player": [" They often have a display screen, buttons, and knobs for controlling the device.", " CD players may have visible cables, such as an audio cable, connecting to other devices."], "cello": ["Cellos have four strings, which are typically tuned to the notes C, G, D, and A.", "Cellos have a bridge, which holds the strings in place and transmits their vibrations to the body of the instrument.", "Cellos have a tailpiece, which anchors the strings to the body of the instrument."], "mobile phone": ["Mobile phones typically have a camera lens on the back, and a speaker and microphone on the front, allowing for audio and video communication.", "Mobile phones often have buttons on the side or top for power, volume, and other functions, setting them apart from other objects."], "chain": ["Chains may be of varying lengths, and may be held together by a clasp or padlock.", "Chains may be used to secure items, such as bicycles or gates, and may be visible in the photo."], "chain-link fence": ["The metal wires are typically galvanized, meaning they are coated in a protective layer of zinc, giving them a silvery-gray color.", "Chain-link fences are often topped with barbed wire, adding an extra layer of security and further distinguishing them from other fences."], "chain mail": ["Chain mail is often seen in a variety of colors, including silver, gold, and black, and can be worn as a protective garment or armor.", "Chain mail is often seen with other pieces of armor, such as helmets, shields, and gauntlets, which can help distinguish it from other objects."], "chainsaw": ["Chainsaws are often brightly colored, with a distinct handle and trigger for operation.", "Chainsaws are often accompanied by a protective guard or cover, which can help distinguish them from other tools."], "storage chest": ["They often have distinct handles on the sides, making them easier to move.", "Storage chests may have decorative features, such as carvings, metal accents, or painted designs, which can help distinguish them from other objects."], "chiffonier": ["Chiffoniers often have ornate carvings or decorations, such as curved legs, decorative handles, and intricate inlays.", "Chiffoniers are typically made of wood, and may be painted or stained in a variety of colors."], "bell or wind chime": ["Bells and wind chimes often have a series of hanging elements, such as metal rods or tubes, which produce a unique sound when struck by the clapper or wind.", "Bells and wind chimes are often brightly colored, with intricate patterns or designs, making them stand out from other objects."], "china cabinet": ["The cabinet often has ornate carvings or designs, such as intricate moldings or decorative hardware, which can help distinguish it from other furniture.", "China cabinets often have a distinct finish, such as a glossy lacquer or a distressed wood, which can help identify them."], "Christmas stocking": ["They are usually shaped like a sock, with a wide opening at the top and a pointed toe at the bottom.", "Christmas stockings often feature festive decorations such as snowflakes, holly, or candy canes."], "church": ["Churches often have large stained glass windows, which can be seen from the outside.", "Churches often have a large cross or crucifix prominently displayed on the outside of the building."], "movie theater": ["Inside, movie theaters have rows of seating, often with armrests and cup holders, and a large projection screen at the front.", "Movie theaters also have concession stands, often with recognizable logos, and a ticket booth, which can help identify the location."], "cleaver": ["The blade is usually sharpened on one side and has a blunt edge on the other, allowing it to be used for chopping and slicing.", "The handle is often made of wood or plastic and is designed to provide a secure grip when in use."], "cliff dwelling": ["The dwellings are often constructed with stone or adobe, and may have visible windows, doors, and other openings.", "The dwellings may also have distinct features such as balconies, towers, and other architectural elements, which can help distinguish them from other structures."], "cloak": ["Cloaks often have distinct closures, such as buttons, ties, or clasps, and may be decorated with embroidery or other embellishments.", "Cloaks may be made of a variety of fabrics, such as wool, velvet, or silk, and may be dyed in a variety of colors."], "clogs": ["Clogs often have a distinct heel, which can be either flat or curved.", "Clogs are often brightly colored and decorated with patterns, making them stand out from other footwear."], "cocktail shaker": ["The lid is often hinged, allowing for easy access to the contents, and the strainer is usually a metal mesh or perforated disc.", "The container is often made of stainless steel or glass, and may have a handle or spout for pouring."], "coffee mug": ["Coffee mugs often have a glossy finish, and may be decorated with patterns or logos.", "Coffee mugs may have a lid or lid-like feature, such as a sipping hole, which further distinguishes them from other objects."], "coffeemaker": ["They often have a control panel with buttons or knobs for setting the brewing cycle.", "Coffeemakers may have a visible power cord, as well as a light indicator to show when the machine is on or off."], "spiral or coil": ["The shape of the spiral or coil can vary, from tight, concentric circles to more open, winding curves.", "The number of turns or loops in the spiral or coil can also be used to distinguish it from other shapes."], "combination lock": ["The dial or keypad is often surrounded by a metal frame, with a latch or shackle for attaching the lock to an object.", "Combination locks often have a distinct pattern of numbers or symbols, allowing them to be easily identified."], "computer keyboard": ["The keys are often labeled with letters, numbers, and symbols, and may have a distinct color or texture.", "The keyboard may also have additional buttons or features, such as a trackpad or media keys, which can help distinguish it from other objects."], "candy store": ["Many candy stores have large signs or banners advertising their products, often with images of candy or other sweets.", "Candy stores often have a wide variety of candy-related items, such as lollipops, chocolates, and gummies, which can be seen in the photo."], "container ship": ["They typically have a large superstructure at the stern, with a bridge and other navigation equipment.", "Container ships are often loaded with large, rectangular containers, stacked in rows and columns, which can be seen from a distance."], "convertible": ["Convertibles typically have a shorter wheelbase than other cars, with a lower center of gravity for improved handling.", "Convertibles often have a unique interior, with a lack of a rear seat or a smaller trunk, to accommodate the folding roof."], "corkscrew": ["The spiral is designed to fit into the cork of a bottle, allowing it to be pulled out.", "Corkscrews often have a lever or other mechanism to help pull the cork out of the bottle."], "cornet": ["The valves are typically arranged in a circle, and the instrument is often decorated with intricate designs.", "Cornets are usually made of brass, giving them a bright, shiny appearance."], "cowboy boot": ["The shaft of the boot is often decorated with intricate designs, such as floral patterns, stars, or geometric shapes.", "Cowboy boots often have a distinct pull tab at the back of the heel, allowing for easy removal."], "cowboy hat": ["The brim of a cowboy hat is often curved up on the sides, and the crown is often pinched in the front and back.", "Cowboy hats are often decorated with a bandana, feathers, or other adornments, making them stand out from other hats."], "cradle": ["Cradles are often made of wood, with a curved headboard and footboard, and may have decorative features such as carvings or painted designs.", "Cradles often have a mattress or cushion, and may be decorated with blankets, pillows, or stuffed animals."], "construction crane": ["The arm of the crane is typically hinged at the base and can be extended and retracted, allowing it to move materials from one place to another.", "The cab at the top of the crane is typically enclosed and contains the controls for the crane's operation."], "crash helmet": ["The helmet's shape is usually rounded and aerodynamic, with a visor or face shield for protection.", "Crash helmets often feature bright colors and graphics, making them easily distinguishable from other objects."], "crate": ["Crates often have a lid or door, which can be opened or closed, and may have handles or straps for carrying.", "Crates are usually made of wood, metal, or plastic, and may have a distinct texture or color, such as a wooden crate with slats or a metal crate with rivets."], "infant bed": ["Infant beds often have a distinct shape, such as a rectangular frame with curved edges, or a circular frame with a canopy.", "Infant beds may also feature decorative elements, such as colorful bedding, stuffed animals, or mobiles, which can help distinguish them from other furniture."], "Crock Pot": ["Crock Pots have a control panel with knobs or buttons for setting the temperature and cooking time.", "Crock Pots have a removable inner pot, often made of ceramic or metal, which can be used for serving."], "croquet ball": ["Croquet balls are usually made of hardwood, plastic, or metal, and have a distinct weight and feel when held.", "Croquet balls are often found in groups, with each ball having a different color, making them easy to distinguish from other objects."], "crutch": ["Crutches have a distinct shape, with a long, straight shaft and a curved handle at the top.", "Crutches often have rubber tips at the bottom of the base, which provide traction and stability when walking."], "cuirass": ["Cuirasses often have intricate designs, such as embossed patterns or engravings, which can help to distinguish them from other objects.", "Cuirasses are often accompanied by other pieces of armor, such as pauldrons, gauntlets, and greaves, which can help to identify them."], "dam": ["Dams often have a spillway, a channel for excess water to flow over or around the dam, and a sluice gate, a device used to control the flow of water.", "Dams may also have a hydroelectric power station, a structure used to generate electricity from the water's flow, which can be identified by its turbines and other machinery."], "desk": ["Desks often have a distinct shape, such as rectangular or L-shaped, and may have a hutch or other features.", "Desks are usually supported by legs or a frame, and may have a chair or other furniture nearby."], "desktop computer": ["The monitor is usually the most prominent feature, with a flat-screen display and a stand or mount.", "The keyboard and mouse are usually connected to the computer via cables, and the computer itself is often connected to a power source."], "rotary dial telephone": ["The handset of a rotary dial telephone is typically connected to the base by a coiled cord, which can be seen in the photo.", "The base of a rotary dial telephone is typically made of plastic or metal, and may have a distinct shape or design."], "diaper": ["Diapers often have a pattern or design, such as cartoon characters or colorful shapes, which can help distinguish them from other objects.", "Diapers are often made of a soft, absorbent material, such as cotton or polyester, which can be seen in the photo."], "digital clock": ["Digital clocks often have a distinct shape, such as a rectangular or circular display, and may be wall-mounted or stand-alone.", "Digital clocks may have additional features, such as an alarm or timer, which can help distinguish them from other objects."], "digital watch": ["Digital watches often have buttons or a touchscreen for controlling the watch's functions, such as setting the time or activating alarms.", "Digital watches may have a wristband or a metal or plastic casing, depending on the model."], "dining table": ["Tables often have a distinct edge or lip around the perimeter, and may feature a patterned top or decorative accents.", "Dining tables are often accompanied by chairs, which can help distinguish them from other furniture."], "dishcloth": ["They often have a loop or string for hanging, and may be brightly colored or patterned.", "Dishcloths are usually made of absorbent materials like cotton or microfiber, which can be seen in the photo."], "dishwasher": ["Dishwashers often have a control panel with buttons or a digital display, setting them apart from other appliances.", "Dishwashers are usually connected to a water supply and drainage system, which can be seen in the photo."], "disc brake": ["Disc brakes have a rotor, which is a metal disc that rotates with the wheel, and a caliper, which is a metal housing that contains the brake pads.", "Disc brakes also have a brake pad, which is a metal or composite material that presses against the rotor to slow or stop the wheel."], "dock": ["Docks often have a railing or fence along the edge, providing safety and security.", "Docks may also have a ramp or stairs leading down to the water, allowing for easy access."], "dog sled": ["The sled is often decorated with colorful blankets, harnesses, and bells, making it stand out from other objects.", "The dogs are typically harnessed in pairs, with a lead dog in front, and the sled is often accompanied by a musher."], "dome": ["Domes often have distinct windows or openings, often in a pattern, that allow light to enter the interior.", "Domes are often constructed of stone, brick, or concrete, and may be decorated with intricate designs or patterns."], "doormat": ["Doormats often feature a distinct pattern or design, such as a welcome message or a logo, to distinguish them from other objects.", "Doormats are usually placed near the entrance of a home or building, making them easy to spot."], "drilling rig": ["Drilling rigs are often composed of a derrick, a large metal frame used to support the drill string and hoist the drill pipe.", "Drilling rigs are usually accompanied by a large drilling rig floor, a platform used to house the drillers and other personnel."], "drum": ["Drums often have distinct hardware, such as lugs, tension rods, and rims, which can be used to identify them.", "Drums may also have a distinct pattern of lines or symbols painted on the skin, which can be used to distinguish them from other objects."], "drumstick": ["Drumsticks are usually made of wood, and may have a lacquered finish or be painted with a design.", "Drumsticks often have a rubber or plastic tip at the end, which helps to produce a distinct sound when striking a drum."], "dumbbell": ["The weighted ends are usually made of metal, often with a rubber or plastic coating, and are usually of equal size.", "The handle is usually made of metal or plastic, and is usually shorter than the weighted ends."], "Dutch oven": ["The lid of a Dutch oven often has a handle, and the walls may have a lip or rim for easy gripping.", "Dutch ovens are usually made of cast iron, giving them a distinct matte black or dark grey color."], "electric fan": ["Electric fans often have a switch or knob to control the speed of the fan, as well as a power cord to connect to an outlet.", "Electric fans may also have a grill or guard to protect the fan blades from damage."], "electric guitar": ["Electric guitars have a variety of pickups, knobs, and switches, which can be used to adjust the sound.", "Electric guitars have strings, which are typically made of metal and can be seen when the guitar is held up."], "electric locomotive": ["Electric locomotives are often brightly colored, with a variety of logos and markings to distinguish them from other trains.", "Electric locomotives have multiple sets of wheels, often with a pantograph on the roof to collect power from overhead lines."], "entertainment center": ["Entertainment centers often have a distinct wood grain or other decorative features, such as glass doors or metal accents.", "Entertainment centers may also have visible cables, connecting to ports like HDMI or USB, highlighting its function as an entertainment hub."], "envelope": ["The paper used for envelopes is often thinner than other paper products, and may have a glossy finish.", "Envelopes often have a printed address on the front, which can help distinguish them from other objects."], "espresso machine": ["The portafilter is often accompanied by a handle, and the machine may have a pressure gauge or other indicators of its function.", "Espresso machines often have a variety of buttons and knobs, allowing users to customize their drinks, and may have a cup warmer or other accessories."], "face powder": ["It is often packaged in a compact or jar, with a lid or sifter, and may be available in a variety of colors.", "Face powder may also be applied with a brush, puff, or sponge, which can be seen in the photo."], "feather boa": ["The feathers are usually arranged in a spiral pattern, with the longest feathers at the ends.", "Feather boas often have a distinct sheen, reflecting light and making them stand out from other objects."], "filing cabinet": ["The drawers are often labeled with a filing system, such as alphabetical or numerical, to help organize documents.", "Filing cabinets are usually made of metal, with a distinct industrial look, and often have a lock for added security."], "fireboat": ["Fireboats are often brightly colored, with red, white, and blue being common, and often feature a large water cannon mounted on the bow.", "Fireboats are equipped with multiple hoses and pumps, and may have ladders or platforms for firefighters to access the deck."], "fire truck": ["Fire trucks often have a distinct siren and flashing lights, making them easily recognizable.", "Fire trucks are often labeled with the name of the fire department, making them easy to identify."], "fire screen": ["They are designed to protect a fireplace from sparks and embers, and often feature a hinged door or panel that can be opened and closed.", "Fire screens are usually placed in front of a fireplace, and may feature a handle or knob for easy movement."], "flagpole": ["Flagpoles often have a halyard, a rope or cable used to raise and lower the flag, which can be seen in the photo.", "Flagpoles may also have a finial, a decorative ornament at the top, which can help distinguish it from other objects."], "flute": ["Flutes typically have a series of finger holes along the body, allowing for the production of different notes.", "Flutes often have a curved head joint, which is used to adjust the pitch of the instrument."], "folding chair": ["The seat and backrest of a folding chair are usually made of fabric or plastic, and are connected to the frame with hinges.", "Folding chairs often have a handle or latch on the back of the seat, allowing them to be easily carried and stored."], "football helmet": ["Football helmets often have a logo or team name printed on the front, making them easily identifiable.", "Football helmets are often brightly colored, with a variety of designs and patterns, making them stand out from other objects."], "forklift": ["Forklifts are typically powered by a motor, and often have a visible exhaust pipe.", "Forklifts are usually brightly colored, often yellow or orange, to make them more visible in industrial settings."], "fountain": ["Fountains often have ornate designs, such as sculptures, statues, or other decorations, which can help distinguish them from other objects.", "Fountains may also be surrounded by benches or other seating, making them stand out from their surroundings."], "fountain pen": ["Fountain pens often have a cap, which can be removed to reveal the nib and ink reservoir.", "Fountain pens may have a clip attached to the cap, allowing them to be easily secured to pockets or notebooks."], "four-poster bed": ["The posts are often ornately carved or decorated, and may be topped with finials or other decorative elements.", "The bed may be draped with curtains or fabric, creating a canopy-like effect."], "freight car": ["Freight cars often have distinct markings, such as logos, numbers, or letters, which can help identify them.", "Freight cars are often connected to other cars, forming a long train, and may have a variety of cargo, such as containers, logs, or coal, visible in the photo."], "French horn": ["The instrument has a series of valves and slides, which are used to change the pitch of the sound.", "French horns are typically made of brass, giving them a bright, shiny appearance."], "frying pan": ["The handle of a frying pan is usually long and curved, allowing for a secure grip when cooking.", "Frying pans are often made of metal, such as stainless steel or cast iron, and may have a non-stick coating."], "fur coat": ["Fur coats often have a long, loose fit, with wide lapels and a large collar.", "Fur coats are often decorated with fur trims, such as cuffs, collars, and pockets, which can help distinguish them from other garments."], "garbage truck": ["Garbage trucks are often brightly colored, with a variety of markings and logos, making them easily identifiable.", "Garbage trucks are usually equipped with a hydraulic arm for lifting and dumping bins, as well as a compactor for crushing waste."], "gas mask or respirator": ["The filter is often a bright color, such as white or yellow, and is connected to the mask by a hose or tube.", "Gas masks and respirators also have straps or bands to secure them to the face, and may have additional features such as eye protection or voice amplifiers."], "gas pump": ["The nozzle is often brightly colored and has a handle for gripping, while the hose is typically black and has a trigger for dispensing fuel.", "The pump is usually mounted on a base, which may have a digital display or other features, such as a card reader."], "goblet": ["The cup is often decorated with intricate designs, such as etchings, carvings, or engravings.", "The stem of a goblet is often thicker at the base, tapering to a thinner neck at the top."], "go-kart": ["Go-karts are often brightly colored, with a variety of decals and designs.", "Go-karts are usually powered by small engines, and may have a visible exhaust pipe."], "golf ball": ["The dimples on a golf ball are designed to reduce drag and increase lift, allowing the ball to travel farther.", "Golf balls are usually smaller than other balls, such as tennis balls, and can be distinguished by their size."], "golf cart": ["They have a distinct steering wheel and dashboard, often with a speedometer and other gauges.", "Golf carts are usually powered by an electric motor, and have a battery pack and charger port visible.", "They have four wheels, often with a raised suspension, and a distinctive golf bag holder on the back."], "gondola": ["Gondolas are propelled by a single oar, held by a gondolier, and are typically seen in canals or other waterways.", "Gondolas often feature a canopy or awning, providing shade for passengers and distinguishing them from other boats."], "gong": ["Gongs are often decorated with intricate designs, such as patterns or symbols, which can help to identify them.", "Gongs are usually suspended from a frame or stand, allowing them to be struck with a mallet or beater."], "gown": ["Gowns often feature intricate details such as lace, beading, or embroidery, which can be used to distinguish them from other garments.", "Gowns are often made of luxurious fabrics such as silk, satin, or velvet, which can be identified by their distinct textures and colors."], "grand piano": ["Grand pianos have three pedals, typically located at the base of the instrument, which are used to control the sound.", "Grand pianos have a large, flat keyboard with black and white keys, which can be used to play a variety of musical notes."], "greenhouse": ["The walls of a greenhouse are often transparent, allowing sunlight to enter and warm the interior.", "Greenhouses often have vents or fans to regulate temperature and humidity, as well as shelves or benches for growing plants."], "radiator grille": ["The grille is often framed by a metal or plastic border, and may feature a logo or other design elements.", "Radiator grilles are usually mounted in the front of a vehicle, near the headlights, and may be accompanied by a hood ornament."], "grocery store": ["Grocery stores often have large parking lots with cars, carts, and other vehicles, setting them apart from other buildings.", "Inside, grocery stores are filled with aisles of food and other products, making them distinct from other types of stores."], "guillotine": ["The blade is usually suspended by a rope or chain, and the frame is often decorated with carvings or other embellishments.", "The base of the guillotine is typically a large, flat platform, often with a curved edge."], "hair clip": ["Hair clips often have a distinct pattern or design, such as a bow, flower, or geometric shape.", "Hair clips are usually brightly colored, making them stand out from other objects in the photo."], "hair spray": ["The cans are often brightly colored and feature a label with the product name and instructions for use.", "Hair sprays often have a distinct smell, which can be used to identify them in a photo."], "half-track": ["Half-tracks often have a large, open-topped cargo area, allowing for the transport of personnel and equipment.", "Half-tracks typically have a large, boxy engine compartment, often with a visible exhaust pipe, and a tall, sloping hood."], "hammer": ["The handle of a hammer is typically long and cylindrical, often with a textured grip for better control.", "Hammers are usually made of metal, making them appear shiny or reflective in photos."], "hamper": ["Hampers often have handles on either side, making them easy to carry.", "Hampers are often made of woven materials, such as wicker or bamboo, which can help distinguish them from other objects."], "hair dryer": ["Hair dryers often have a switch or button to turn them on and off, as well as a temperature control dial.", "Hair dryers are usually connected to a power cord, which can be used to identify them."], "hand-held computer": ["Hand-held computers are usually smaller than laptops, with a more compact design and portability.", "Hand-held computers often have visible ports, such as USB or HDMI, and may have a camera or microphone, distinguishing them from other devices."], "handkerchief": ["Handkerchiefs are often made of lightweight, thin fabric, such as cotton or silk, and can be folded or bunched up in various ways.", "Handkerchiefs may have a hemmed edge, or a decorative border, which can help distinguish them from other objects."], "hard disk drive": [" They have a distinct set of ports, such as SATA or IDE, for connecting to a computer.", " Hard disk drives have a spinning disk inside, which is visible through a small hole in the casing.", " They also have a motor and several other components, such as a read/write head, which can be seen when the casing is opened."], "harmonica": ["The reeds are often visible, and the instrument is usually held in the hands, distinguishing it from other objects.", "Harmonicas are often brightly colored, with a variety of designs and patterns, making them easy to spot."], "harp": ["The strings are typically arranged in a symmetrical pattern, with the highest strings at the top and the lowest strings at the bottom.", "Harps often have ornate carvings or decorations on the neck and pillar, making them stand out from other instruments."], "combine harvester": ["The harvester is typically equipped with a rotating threshing drum and a large, rotating reel at the front, used to cut and collect crops.", "The harvester is often accompanied by a large grain tank, used to store the harvested crop, and a conveyor belt, used to transport the crop to the tank."], "hatchet": ["Hatchets often have a bright, reflective metal head, which stands out against other objects.", "Hatchets are typically small and lightweight, making them easy to identify in a photo."], "holster": ["Holsters are often shaped like a half-moon, with a belt loop or clip for attaching to a belt or waistband.", "Holsters often have a distinct flap or strap to secure the firearm in place, and may have additional pockets or compartments for ammunition or other accessories."], "home theater": ["Home theaters often have a variety of media devices, such as gaming consoles, DVD players, and streaming devices, connected to the television.", "Home theaters may also feature comfortable seating, such as couches or recliners, and a variety of other accessories, such as popcorn machines or snack trays."], "honeycomb": ["The cells are typically made of beeswax, giving them a distinct yellowish hue.", "Honeycombs are often found in clusters, with multiple combs connected to each other."], "hook": ["Hooks may have a distinct eye or loop at the top, allowing them to be attached to other objects.", "Hooks may be made of metal, plastic, or other materials, and may be painted or decorated in a variety of colors."], "hoop skirt": ["The skirt is supported by a series of metal or plastic hoops, which are often visible from the side.", "The skirt may also feature decorative elements such as lace, ruffles, or pleats, which can help distinguish it from other garments."], "gymnastic horizontal bar": ["The bars are often brightly colored, often with a distinct pattern, and are usually padded for safety.", "The bars are typically mounted on a wall or floor, with a set of adjustable supports for height and angle."], "horse-drawn vehicle": ["The vehicle is pulled by one or more horses, often with a harness and reins.", "The vehicle may have a canopy or roof, and may be decorated with ornamental features such as tassels or bells."], "hourglass": ["Hourglasses are often made of glass, with a sand-filled chamber in the middle.", "Hourglasses often have a distinct stand, allowing them to be placed upright."], "iPod": ["iPods have a signature home button at the bottom of the device, often with a distinct color or logo.", "iPods have a variety of ports, such as a headphone jack, lightning port, and volume buttons, which can be used to identify the device."], "clothes iron": ["The base of the iron is typically metal, with a steam vent and temperature control dials.", "The handle is often plastic, with a trigger for releasing steam and a button for activating the iron's soleplate."], "carved pumpkin": ["The carved pumpkin will have a face or design carved into it, often with eyes, a nose, and a mouth.", "The carved pumpkin will have a lit candle or light source inside, illuminating the design and making it stand out from other objects."], "jeans": ["Jeans often have a recognizable silhouette, with a tapered leg and a low-rise waist.", "Jeans often have visible pockets, rivets, and belt loops, as well as a zipper fly."], "jeep": ["Jeeps typically have four-wheel drive, with large, off-road tires and a high ground clearance.", "Jeeps often have a removable roof, allowing for open-air driving, and a spare tire mounted on the back."], "T-shirt": ["T-shirts often have a logo or design printed on the front, making them easily distinguishable from other clothing items.", "T-shirts are usually made of lightweight, breathable fabrics, such as cotton or polyester, which can be seen in the photo."], "jigsaw puzzle": ["The pieces of a jigsaw puzzle are often arranged in a flat, rectangular shape, with the edges of the puzzle forming a frame.", "The image on the puzzle pieces often forms a recognizable picture when the puzzle is completed."], "rickshaw": ["Rickshaws often have a distinct seating area, typically with two benches facing each other, and a platform for the driver.", "Rickshaws are often brightly colored and decorated with intricate designs, making them stand out from other vehicles."], "joystick": ["Joysticks often have a range of colors, from bright and vibrant to muted and subtle, making them stand out from other objects.", "Joysticks may have a variety of cables, such as USB or audio, connecting them to other devices, making them easily identifiable."], "kimono": ["Kimonos are often brightly colored and patterned, with intricate designs and motifs, such as flowers, birds, and geometric shapes.", "Kimonos are typically tied with a sash or obi belt, which can be a contrasting color or pattern."], "knee pad": ["They often have a textured surface to provide grip and cushioning.", "Knee pads are usually made of a flexible material, such as neoprene or foam, and may have straps or Velcro closures to secure them in place."], "knot": ["Knots may be tied in a variety of ways, such as a bowline, figure-eight, or clove hitch, each with its own unique shape and structure.", "Knots may also be tied with a variety of materials, such as rope, string, or wire, and may be decorated with beads or other adornments."], "lab coat": ["Lab coats often have pockets on the chest and sides, and may have a belt or tie at the waist.", "Lab coats may also have a distinct collar, and may be embroidered with a name or logo."], "ladle": ["The handle is typically curved, allowing for a comfortable grip, and the scoop is often wide and shallow.", "Ladles are often made of metal, plastic, or wood, and may have a decorative pattern or design."], "lampshade": ["Lampshades are often made of fabric, paper, or metal, and may be decorated with patterns or designs.", "Lampshades are usually attached to a lamp base, such as a table lamp or floor lamp, and may be adjustable in height."], "laptop computer": ["Laptops often have a trackpad or touchpad, as well as a variety of ports, such as USB, HDMI, and audio jacks, which can be used to identify them.", "Laptops are usually thinner and lighter than desktop computers, making them easier to carry and transport."], "lawn mower": ["The cutting deck is typically rectangular, with a blade or blades protruding from the bottom.", "Lawn mowers are often brightly colored, with a variety of hues, and may have a logo or other branding on the side."], "lens cap": ["Lens caps are often labeled with the manufacturer's logo or name, making them easily identifiable.", "Lens caps are usually made of plastic or metal, and may have a textured or smooth surface."], "letter opener": ["The blade may be serrated or smooth, and may have a decorative design or logo.", "Letter openers may also have a hole or loop at the end of the handle, allowing them to be hung or stored."], "library": ["Libraries often have distinct furniture, such as tables and chairs, for studying and reading.", "Libraries may also have computers, desks, and other equipment, such as printers, scanners, and photocopiers."], "lifeboat": ["Lifeboats are typically long and narrow, with a pointed bow and stern, and are equipped with oars or motors for propulsion.", "Lifeboats are often equipped with safety features such as life jackets, flares, and radios, which can be seen in the photo."], "lighter": ["The lid often has a distinct design, such as a brand logo or a pattern, which can help identify the object.", "Lighters are often brightly colored, making them stand out from other objects in the photo."], "limousine": ["Limousines often have a partition between the driver and passenger compartments, as well as tinted windows for privacy.", "Limousines are often equipped with luxury features such as a bar, television, and sound system, making them stand out from other vehicles."], "ocean liner": ["Ocean liners typically have a long, sleek profile with a pointed bow and a flat stern, allowing them to cut through the waves.", "Ocean liners often have large windows, balconies, and other features that distinguish them from other ships."], "lipstick": ["Lipsticks often have a glossy finish, reflecting light and making them stand out from other objects.", "Lipsticks may have a distinct color, such as red or pink, which can help to identify them."], "slip-on shoe": ["Slip-on shoes often have a distinct shape, with a rounded toe and a slightly raised heel.", "Slip-on shoes may have a variety of decorative features, such as tassels, buckles, or embroidery, which can help to identify them."], "lotion": ["Lotions often have a distinct texture, appearing creamy or oily, and can be identified by their sheen.", "Lotions may also have a distinct scent, which can be used to identify them in a photo."], "music speaker": ["Music speakers often have visible ports, such as 3.5mm jacks or USB ports, which can be used to connect to other devices.", "Music speakers may have distinct branding or logos, such as the Apple logo, which can help identify them."], "loupe magnifying glass": ["The lens is usually convex, with a magnifying power of up to 10x, allowing for detailed inspection of small objects.", "Loupes are often used in combination with a light source, such as a flashlight, to further enhance visibility."], "sawmill": ["Sawmills are often surrounded by stacks of logs, ready to be cut, and piles of lumber, freshly cut.", "Sawmills are often located near bodies of water, such as rivers or lakes, to facilitate the transport of logs."], "magnetic compass": ["The base is often marked with cardinal directions, such as N, S, E, and W, and may have a transparent cover or lid.", "The needle is usually colored red or black, and may have a small magnetized ball at its center."], "messenger bag": ["Messenger bags often have a flap closure, with buckles or straps to secure the bag.", "Messenger bags often have multiple pockets and compartments, allowing for easy organization of items."], "mailbox": ["Mailboxes are often painted in bright colors, such as red, blue, or yellow, to make them easily identifiable.", "Mailboxes are typically mounted on a post or wall, and may have a flag to indicate when mail has been delivered."], "maillot": ["Maillots often feature a distinct pattern or design, such as stripes, polka dots, or floral prints.", "Maillots are usually made of lightweight, stretchy fabrics, such as lycra or spandex, which hug the body and move with the wearer."], "one-piece bathing suit": ["The suit is usually form-fitting, hugging the body and highlighting curves.", "One-piece bathing suits often have a low-cut back, with straps that criss-cross or tie at the neck."], "manhole cover": ["They often feature a distinct pattern of holes or slots, allowing for easy removal with a special tool.", "Manhole covers are usually made of metal, such as cast iron or steel, and are often painted a distinct color, such as yellow or orange."], "maraca": ["Maracas possess a distinct shape, with a curved handle and two round, hollow gourds at the end.", "The gourds are filled with small objects, such as seeds or beads, which create a rattling sound when shaken."], "marimba": ["The bars are typically arranged in a curved pattern, with the highest notes at the center and the lowest notes at the edges.", "Marimbas are often accompanied by a set of mallets, which are used to strike the bars and produce sound."], "mask": ["Masks often have decorative features, such as patterns, colors, or symbols, that make them stand out from other objects.", "Masks are often made of fabric, plastic, or other materials, and may have straps or ties to secure them to the face."], "matchstick": ["Matchsticks often have a distinctive \"strike strip\" on the side, which is used to ignite the match.", "Matchsticks are usually found in boxes or packs, which can help to identify them in a photo."], "maypole": ["The ribbons are often woven together in intricate patterns, creating a colorful display.", "Maypoles are typically surrounded by a circle of people, often dancing or singing around the pole."], "maze": ["The walls of a maze are usually distinct from the paths, often with a different color or texture.", "Mazes often have a goal or destination, such as a center point or a prize, which can be used to identify them."], "measuring cup": ["The cup is often marked with measurements, such as cups, ounces, milliliters, or teaspoons, to indicate the volume of the cup.", "The cup is usually made of a durable material, such as plastic or metal, and is often brightly colored or transparent."], "medicine cabinet": ["Inside, medicine cabinets are divided into shelves or compartments, allowing for the storage of various items.", "Medicine cabinets are often mounted on the wall, either recessed or surface-mounted, and may be accompanied by a light fixture."], "megalith": ["Megaliths often have distinct carvings or symbols, such as spirals, circles, or zigzags, which can help identify them.", "Megaliths are often found in groups, with some larger than others, and may be surrounded by smaller stones or earthworks."], "microphone": ["Microphones often have a distinct cable or cord attached to the body, connecting to an amplifier or recording device.", "Microphones may have a logo or brand name printed on the body, helping to identify the make and model."], "microwave oven": ["The door is often made of glass, allowing the user to see inside, and is usually surrounded by a metal frame.", "The oven is usually mounted on a countertop or shelf, and may have visible buttons or a digital display."], "military uniform": [" They often have a variety of pockets, insignia, and badges, which can be used to identify the branch of service.", " Military uniforms often feature a variety of hats, helmets, and other headgear, which can be used to distinguish them from civilian clothing."], "milk can": ["Milk cans are often made of metal, such as stainless steel, and may have a distinct sheen or shine.", "Milk cans may have a handle or two on the sides, allowing for easy transport."], "minibus": ["Minibuses are usually taller than regular cars, with a higher roofline and more headroom.", "Minibuses often have a distinct livery, such as a company logo or school colors, which can help to identify them."], "miniskirt": ["Miniskirts often have a distinct silhouette, with a narrow waist and flared hem.", "Miniskirts are often made of lightweight fabrics, such as cotton, linen, or polyester, and may feature patterns or prints."], "minivan": ["Minivans often have sliding side doors, allowing for easy access to the interior, and a large rear hatch, making loading and unloading cargo easier.", "Minivans typically have a distinct grille and headlights, as well as a higher ground clearance than a sedan, making them easier to identify."], "missile": ["Missiles often have a pointed nose cone, which can be either blunt or sharp depending on the type of missile.", "Missiles may also have visible exhaust ports, which are used to propel the missile forward."], "mitten": ["Mittens often have a cuff at the wrist, which can be ribbed or plain.", "Mittens are usually made of a soft material, such as wool or fleece, and often have a pattern or design on them."], "mixing bowl": ["The sides of the bowl are often curved, and the bowl may have a handle or two for easy carrying.", "Mixing bowls are often made of metal, glass, or ceramic, and may have a pattern or design on the outside."], "mobile home": ["Mobile homes often have a distinct exterior, with siding, skirting, and awnings, as well as windows and doors.", "Mobile homes are typically set on a trailer frame, with wheels and axles visible from the side."], "ford model t": ["The Model T has a unique two-pedal system, with a single pedal for both accelerating and braking, and a lever for shifting gears.", "The Model T has a large, round headlamp mounted on the front of the car, and a small, round tail lamp mounted on the rear."], "modem": ["Modems often have a distinct antenna, either external or internal, which is used to receive and transmit signals.", "Modems may also have a series of LED lights, indicating power, connection, and other status information."], "monastery": ["Monasteries often have large courtyards, gardens, and other outdoor spaces, often with religious symbols or statues.", "Monasteries often have a large bell tower, which can be seen from a distance."], "monitor": ["Monitors are typically connected to a computer or laptop via cables, such as HDMI or USB, which can be seen in the photo.", "Monitors often sit on distinct stands, such as central pillars or side feet, or are wall-mounted using brackets, setting them apart."], "moped": ["Mopeds are usually equipped with a low-powered engine, often with a distinctive exhaust pipe, and a manual transmission.", "Mopeds often have small, low-profile tires, and may have a headlight, tail light, and turn signals, distinguishing them from other vehicles."], "mortar and pestle": ["The pestle is a cylindrical tool with a rounded end, used to grind ingredients in the mortar.", "Mortar and pestles often have a distinct handle or knob on the side, allowing for easy gripping and maneuvering."], "graduation cap": ["The cap is usually made of a stiff material and has a square shape with a pointed top.", "The tassel is usually a different color than the cap and is often adorned with a school logo or other insignia."], "mosque": ["The walls of a mosque are often decorated with intricate patterns and designs, often featuring geometric shapes and Islamic calligraphy.", "Mosques often have a large open courtyard, surrounded by a colonnade of arches and pillars."], "mosquito net": ["The mesh is often held up by a frame, such as a hoop or pole, which can be seen in the photo.", "The netting is often draped over a bed or other furniture, making it distinct from other objects in the photo."], "vespa": ["Vespas have a single-sided front fork, with the wheel hub and brake assembly visible from the side.", "Vespas have a flat, wide seat, often with a storage compartment underneath, and a wide handlebar with a round headlight."], "mountain bike": ["Mountain bikes often have suspension systems, such as front forks or rear shocks, to absorb the impact of rough terrain.", "Mountain bikes also have a wide range of gears, allowing riders to adjust their speed and power output for different terrain."], "tent": ["Tents are often brightly colored, with visible poles and stakes used to secure them to the ground.", "Tents often have a visible entrance, such as a zipper or flap, which can be used to distinguish them from other objects."], "computer mouse": ["The mouse is connected to the computer by a cord or wire, which can be seen in the photo.", "The mouse also has a small wheel or trackball on the underside, which is used to move the cursor on the screen."], "mousetrap": ["The arm is often baited with food, such as cheese or peanut butter, to attract mice.", "The arm is connected to a trigger plate, which is designed to snap shut when the mouse steps on it, trapping the animal."], "moving van": ["Moving vans often have large, visible logos or lettering on the side, indicating the company or service.", "Moving vans typically have a large, wide door at the back, allowing for easy loading and unloading of items."], "muzzle": ["Muzzles are designed to fit snugly around the snout of an animal, with straps or buckles to secure it in place.", "Muzzles often have holes or slots to allow the animal to breathe and eat, as well as a noseband to prevent the animal from biting."], "metal nail": ["The metal surface of the nail is usually shiny and reflective, distinguishing it from other objects.", "Nails are typically thin and long, with a cylindrical shape, and may have ridges or grooves along the length."], "neck brace": ["They often have adjustable straps and buckles to secure the brace in place, as well as padding for comfort.", "Neck braces may also have a chin support or other features to provide additional stability and support."], "necklace": ["Necklaces often have a distinct shape or pattern, such as a circle, heart, or cross.", "Necklaces may be made of a variety of materials, such as metal, plastic, or beads, and may be adorned with gems or other decorations."], "baby pacifier": ["They often have a handle or ring attached to the base, allowing babies to easily grasp and hold the pacifier.", "Pacifiers are usually brightly colored, often with cartoon characters or other designs, making them easily distinguishable."], "notebook computer": ["Notebook computers are usually much thinner and lighter than desktop computers, and often have a distinct logo or branding on the lid.", "Notebook computers often have a touchpad or trackpad, as well as ports for connecting peripherals like USB or HDMI."], "obelisk": ["Obelisks often feature inscriptions or hieroglyphs, which can be used to identify them.", "Obelisks typically have a square or rectangular base, and may be decorated with carvings or statues."], "oboe": ["Oboes have a double reed mouthpiece, which is a small, thin piece of metal or plastic that vibrates when air is blown through it.", "Oboes have a series of keys and holes along the body, which are used to change the pitch of the instrument."], "ocarina": ["Ocarinas often have a distinct, curved shape with a flat base, allowing them to be held in the hands.", "Ocarinas are often decorated with intricate designs, such as carvings or painted patterns, which can help to identify them."], "odometer": ["Odometers are usually mounted on the dashboard of a vehicle, often in a prominent position, and may be surrounded by other gauges or indicators.", "Odometers are usually connected to the vehicle's power source, and may have a cable or wire running from the back of the unit."], "oil filter": ["Oil filters have a distinct metal mesh or paper element, often with a plastic or metal casing, which is used to filter out contaminants from the oil.", "Oil filters often have a bypass valve, which allows unfiltered oil to flow through when the filter becomes clogged."], "pipe organ": ["The pipes are typically made of metal or wood, and can range in size from a few inches to several feet.", "The console, or keyboard, of a pipe organ is typically situated at the front of the instrument, and is often decorated with ornate carvings."], "oscilloscope": ["Oscilloscopes have several knobs and buttons, allowing users to adjust settings and control the device.", "Oscilloscopes are often connected to other devices, such as probes or cables, which can be seen in the photo."], "overskirt": ["Overskirts are often made of lightweight fabrics, such as tulle or organza, and feature intricate details like lace, ruffles, or pleats.", "Overskirts are often decorated with embellishments such as beading, sequins, or embroidery, which can help distinguish them from other garments."], "bullock cart": ["The cart is usually made of wood, with a large platform for carrying goods, and a yoke connecting the animals to the cart.", "The wheels are often large and solid, with spokes radiating from the center, and the cart is often decorated with colorful fabrics or patterns."], "oxygen mask": ["The mask is connected to a tube, which is connected to an oxygen tank or other source of oxygen.", "The mask may also have a valve to regulate the flow of oxygen, and a filter to remove impurities from the air."], "product packet / packaging": ["Product packets / packaging often have a distinct color, such as a bright hue or a metallic sheen.", "Product packets / packaging often have text or images printed on them, such as a brand name, product name, or instructions."], "paddle": ["The blade is often curved or angled, and may have a textured surface for better grip.", "Paddles are often brightly colored, making them stand out from other objects in the photo."], "paddle wheel": ["The paddles are often angled to the direction of rotation, allowing them to catch and move water.", "Paddle wheels are often connected to a central hub, which is usually visible in the photo."], "padlock": ["Padlocks often have a unique pattern of grooves or ridges on the body, allowing for easy identification.", "Padlocks are often found attached to a chain or other object, making them easily distinguishable from other objects."], "paintbrush": ["The bristles of a paintbrush are usually made of natural or synthetic fibers, often in a fan-like shape.", "Paintbrushes come in a variety of sizes and shapes, from small, thin brushes for detail work to large, flat brushes for covering large areas."], "pajamas": ["Pajamas often have a distinct pattern, such as stripes, polka dots, or floral designs, which can help distinguish them from other clothing items.", "Pajamas may also feature pockets, buttons, or other closures, which can help identify them."], "palace": ["Palaces often have large, open courtyards surrounded by walls or gardens, and may have multiple wings or towers.", "Palaces often have distinct architectural features, such as intricate carvings, stained glass windows, and decorative balconies."], "pan flute": ["The tubes are often made of bamboo or wood, and may be decorated with intricate carvings or patterns.", "The tubes are connected to a mouthpiece, which is used to blow air into the instrument and produce sound."], "paper towel": ["Paper towels are often found in rolls, with perforations between each sheet, or folded in stacks.", "Paper towels are often found near sinks or other wet areas, and may be used to dry hands or clean up spills."], "parachute": ["Parachutes are often seen with multiple suspension lines, connecting the canopy to the harness, and a single control line, used to steer the parachute.", "Parachutes are often seen with a pilot chute, a small, round canopy used to deploy the main parachute, attached to the harness."], "parallel bars": ["The bars are usually supported by two metal posts, which can be seen in the photo.", "The bars are often brightly colored, making them stand out from the background."], "park bench": ["Park benches often have armrests on either side, and may be decorated with carvings or other embellishments.", "Park benches are usually situated in public spaces, such as parks, gardens, or plazas, and may be surrounded by trees or other vegetation."], "parking meter": ["Parking meters often have a distinct color, such as yellow or green, and may have a sign or logo indicating their purpose.", "Parking meters are often found in groups, with multiple meters in a row, making them easier to identify."], "railroad car": ["Railroad cars often have distinct markings, such as logos, numbers, and lettering, which can help identify them.", "Railroad cars are often connected to other cars, forming a train, and may have visible couplings between them."], "patio": ["Patios are often surrounded by walls, fences, or other barriers, such as shrubs or trees, which can help distinguish them from other outdoor spaces.", "Patios often feature furniture, such as tables and chairs, and other decorative elements, such as potted plants or outdoor lighting, which can help identify them."], "payphone": ["Payphones often have a coin slot and a keypad for entering phone numbers.", "Payphones are usually mounted on a wall or stand, and may have a sign or logo indicating the service provider."], "pedestal": ["Pedestals often have a distinct base, such as a plinth or column, which can be ornately decorated.", "Pedestals are often used to display sculptures or other artwork, making them easily identifiable."], "pencil case": ["They often have a handle or strap for easy carrying, and may be decorated with colorful designs or patterns.", "Pencil cases may also have pockets or compartments for organizing supplies, such as pens, pencils, erasers, and other items."], "pencil sharpener": ["The sharpening mechanism is usually visible, with a blade or hole for inserting the pencil.", "Pencil sharpeners often have a receptacle for collecting the shavings, which can be used to identify the object."], "perfume": ["The bottle may be decorated with a variety of colors, shapes, and designs, making it stand out from other objects.", "Perfumes often have a strong, sweet scent, which can be detected in the photo."], "Petri dish": ["The dishes are often transparent, allowing for observation of the contents, and have a raised lip around the edge.", "The lid is often slightly concave, allowing for condensation to form and collect on the underside."], "photocopier": ["Photocopiers often have a paper tray or feeder on the top, as well as a paper output tray on the bottom.", "Photocopiers may also have a scanner lid, which can be opened to place documents on the glass platen for copying."], "plectrum": ["They often have a distinct shape, such as a triangle, diamond, or teardrop, and may be decorated with patterns or logos.", "Plectrums are usually small, so they may appear as a tiny object in the photo."], "Pickelhaube": ["The helmets are typically made of leather or metal, and often feature a chin strap and decorative trim.", "Pickelhaubes are often associated with German military uniforms, and may feature a metal spike or a plume of feathers."], "picket fence": ["The posts are often pointed at the top, giving the fence a distinctive look.", "The gaps between the posts are usually uniform, allowing for a clear view of the fence's structure."], "pickup truck": ["Pickup trucks typically have four doors, two in the front and two in the back, and a cab in the front.", "Pickup trucks have large tires and a higher ground clearance than other vehicles, allowing them to traverse rough terrain."], "pier": ["Piers are often made of wood or concrete, and may have a roof or canopy to provide shade.", "Piers may have benches, lights, or other features, such as a dock or boat launch, that can help distinguish them from other structures."], "piggy bank": ["Piggy banks are often made of ceramic or plastic, and may be decorated with colorful designs.", "Piggy banks have a slot at the top for coins, and a stopper at the bottom for retrieving the money."], "pill bottle": ["Pill bottles often have a label with information about the contents, such as the name of the medication, dosage, and expiration date.", "Pill bottles may also have a safety seal or tamper-evident feature, such as a shrink wrap or foil seal, to indicate if the bottle has been opened."], "pillow": ["Pillows often have a distinct pattern or texture, such as stripes, polka dots, or quilting.", "Pillows may have a visible zipper or other closure, allowing them to be filled with stuffing or other materials."], "ping-pong ball": ["The surface of a ping-pong ball is smooth and glossy, with a slight dimple pattern.", "The ball is usually seen in motion, bouncing off a paddle or table, making it easy to identify."], "pinwheel": ["The blades are often curved and may have patterns or designs on them.", "Pinwheels are often seen spinning in the wind, with the blades rotating around a central axis."], "pirate ship": ["Pirate ships often have a distinctive black hull, with a raised bow and stern, and multiple decks.", "Pirate ships often have a large number of cannons, visible on the sides of the ship, as well as a crow's nest at the top of the main mast."], "drink pitcher": ["The body of the pitcher is often decorated with patterns or designs, making it stand out from other objects.", "Drink pitchers often have a lid, which can be used to identify them."], "block plane": ["The blade is typically set at a low angle, allowing for precise control when planing wood.", "Block planes often have a wooden handle, which is usually curved and ergonomically designed for comfortable use."], "planetarium": ["Inside, the walls are often painted with stars and other celestial objects, creating a realistic night sky.", "Planetariums often have a projector in the center, used to display images of the night sky onto the dome."], "plastic bag": ["Plastic bags often have handles or drawstrings, making them easy to carry.", "Plastic bags are often printed with logos or text, making them easily identifiable."], "plate rack": ["Plate racks often have a distinct design, such as a curved or scalloped shape, to add visual interest.", "Plate racks may also have additional features, such as hooks for hanging mugs or other items, or a decorative top shelf."], "farm plow": ["Plows are often attached to a tractor or other vehicle, with a visible hitch connecting the two.", "Plows may also have a wheel or other support structure at the back, helping to guide the implement."], "plunger": ["The rubber cup is usually bell-shaped, with a flat base and ridges along the sides.", "Plungers are often brightly colored, making them stand out from other objects in the photo."], "Polaroid camera": ["They have a large lens on the front, often with a flash, and a small handle on the side.", "Polaroid cameras have a unique film ejection mechanism, which is often visible when the camera is open."], "pole": ["Poles are often made of metal or wood, and may have a distinct texture or color.", "Poles may have visible attachments, such as wires, flags, or signs, which can help distinguish them from other objects."], "police van": ["Police vans often have a variety of external features, such as spotlights, sirens, and external cameras, which can help to identify them.", "Police vans may also have external cages or compartments, which are used to transport prisoners or equipment."], "poncho": ["Ponchos often feature distinct patterns, such as stripes, checks, or geometric shapes, which can help to identify them.", "Ponchos are often made of brightly colored fabrics, such as wool or cotton, which can help to distinguish them from other garments."], "pool table": ["Pool tables have six pockets, usually located at the corners and in the middle of each side.", "Pool tables have a raised edge around the playing surface, which helps keep the balls on the table."], "soda bottle": ["The bottle is often made of clear or tinted glass, with a label or logo printed on the front.", "The bottle may also have a distinct shape, such as a curved or angular design, which can help distinguish it from other objects."], "plant pot": ["Plant pots often have drainage holes in the bottom, allowing excess water to escape.", "Plant pots come in a variety of colors, textures, and materials, such as terracotta, ceramic, plastic, or metal."], "potter's wheel": ["The wheel is often connected to a motor, which can be seen in the photo.", "The wheel is usually accompanied by a foot pedal, which is used to control the speed of the wheel.", "The wheel is often surrounded by tools such as a rib, a sponge, and a trimming knife."], "power drill": ["The drill bit is usually visible, either extended or retracted, and is often a different color than the drill itself.", "Power drills are often accompanied by a power cord, which can be used to identify the tool."], "prayer rug": ["Prayer rugs are often decorated with intricate designs, such as floral motifs, calligraphy, or geometric shapes.", "Prayer rugs are usually made of soft materials, such as wool or cotton, and often feature a fringe along the edges."], "printer": ["Printers often have visible ports, such as USB or Ethernet, and may have a power cord or other cables connected to them.", "Printers may have a distinct logo or branding, such as HP or Canon, which can help identify them."], "prison": ["Prisons often have guard towers, with armed personnel surveying the area.", "Prisons may have distinct entrances, such as large gates or security checkpoints, as well as other features like searchlights or surveillance cameras."], "projectile": ["Projectiles often have a pointed tip, which helps them penetrate targets and maintain their trajectory.", "Projectiles may also have fins or wings, which help them stabilize in flight and increase their accuracy."], "projector": ["Projectors are often mounted on a stand or wall bracket, setting them apart from other objects.", "Projectors are usually connected to a power source and other devices, such as a laptop or DVD player, via cables, which can be seen in the photo."], "hockey puck": ["The surface of a hockey puck is smooth and slightly textured, with a raised logo in the center.", "Hockey pucks are often seen in motion, as they are used in the game of ice hockey."], "punching bag": ["Punching bags are often filled with sand or other materials, and are usually covered in a thick, durable material such as leather or vinyl.", "Punching bags are often hung from the ceiling or a stand, and may have straps or handles for easy movement."], "purse": ["Purses often have a closure, such as a zipper, snap, or buckle, to secure the contents.", "Purses may have decorative features, such as tassels, embroidery, or sequins, which can help to identify them."], "quill": ["Quills often have a distinct pattern of barbs or ridges along the shaft, which help to hold ink.", "Quills are often made from feathers, and the feather pattern can be seen on the surface of the quill."], "quilt": ["Quilts often have a distinct texture, with visible stitching or quilting patterns.", "Quilts may also have a distinct shape, such as a square, rectangle, or hexagon, which can help distinguish them from other objects."], "race car": ["Race cars typically have large, wide tires with deep treads, allowing for better grip on the track.", "Race cars often have a large rear spoiler, designed to increase downforce and improve stability at high speeds."], "racket": ["The head of the racket is usually oval or teardrop-shaped, with a distinct pattern of strings or holes.", "Rackets often have a grip at the end of the handle, allowing for a secure hold."], "radiator": ["Radiators are often mounted on walls or floors, and may be connected to pipes or other fixtures.", "Radiators are usually painted in a distinct color, such as white or silver, to help distinguish them from other objects."], "radio": ["Radios often have a speaker grille, which can be used to distinguish them from other objects.", "Radios may have visible ports, such as headphone jacks or antennae, which can be used to identify them."], "radio telescope": ["Radio telescopes are often located in remote, dark locations, away from light pollution, and may be surrounded by other radio telescopes.", "Radio telescopes are often pointed towards the sky, with the dish angled towards a particular point in the sky."], "rain barrel": ["Rain barrels often have a lid or cover to keep out debris and animals, and may be decorated with designs or colors.", "Rain barrels are often connected to downspouts or gutters, which can be seen in the photo."], "recreational vehicle": ["They often have large windows, awnings, and other features that make them stand out from other vehicles.", "Recreational vehicles often have external storage compartments, ladders, and other features that make them easily identifiable."], "fishing casting reel": ["The spool is often marked with a line capacity indicator, and the handle is usually connected to a star-shaped drag adjustment knob.", "Fishing casting reels are often brightly colored, with a variety of designs and patterns, making them easy to spot."], "reflex camera": ["Reflex cameras often have a variety of buttons and dials on the top and sides, allowing for manual control of settings.", "Reflex cameras have a large, rectangular body with a handgrip on the side, making them easy to distinguish from other cameras."], "refrigerator": ["Refrigerators often have a distinct color, such as white or stainless steel, and may have a visible water dispenser or ice maker.", "Visible shelves, drawers, and compartments inside the refrigerator can help distinguish it from other objects."], "remote control": ["They often have a distinct antenna, which can be used to identify them.", "Remote controls may also have a display screen, which can be used to distinguish them from other objects."], "restaurant": ["Restaurants typically have large windows, allowing customers to view the interior.", "Restaurants often have outdoor seating, such as tables and chairs, which can be used to identify them.", "Restaurants may also have a distinct entrance, such as a door or archway, which can be used to identify them."], "revolver": ["Revolvers have a rotating cylinder, which holds the ammunition, and a barrel, which is the tube through which the bullet is fired.", "Revolvers often have a distinct hammer, which is used to cock the gun and fire the bullet."], "rifle": ["Rifles often have a distinct sight at the top of the barrel, used for aiming.", "Rifles may also have a magazine at the bottom, used to store ammunition."], "rocking chair": ["The chair is supported by two curved rockers, allowing it to move back and forth.", "The seat is typically upholstered or cushioned, and the chair may have a footrest for added comfort."], "rotisserie": ["The spit is often visible, with a variety of food items, such as chickens, roasting on it.", "Rotisseries often have a glass door or window, allowing the user to monitor the cooking process."], "eraser": ["Erasers are often brightly colored, often with a logo or design, making them stand out from other objects.", "Erasers have a distinct rubber smell, which can be used to identify them in a photo."], "rugby ball": ["Rugby balls are typically made of leather or synthetic materials, and have a textured surface for better grip.", "Rugby balls are often seen with a distinctive black and white checkered pattern, which helps to distinguish them from other sports balls."], "ruler measuring stick": ["The markings are usually in a linear pattern, with numbers and lines indicating different units of measurement.", "The end of the ruler is often pointed, allowing for precise measurements."], "sneaker": ["They often have a recognizable logo or design, such as the Nike swoosh or Adidas stripes.", "Sneakers are usually made of a combination of materials, such as leather, canvas, or synthetic fabrics, and often feature bright colors or patterns."], "safe": ["Safes are often made of metal, giving them a distinct sheen or texture.", "Safes are often heavy and bulky, making them stand out from other objects in the photo."], "safety pin": ["Safety pins often have a bright, metallic finish, making them stand out from other objects in the photo.", "Safety pins are usually small, so they may appear as a tiny glint in the photo, depending on the size of the pin and the resolution of the image."], "salt shaker": ["Salt shakers often have a distinct lid, either a screw-on cap or a flip-top, which can be used to identify them.", "Salt shakers are often decorated with patterns or designs, making them easily distinguishable from other objects."], "sandal": ["Sandals come in a variety of styles, from open-toed to closed-toe, and may have a heel or be completely flat.", "Sandals may be made of a variety of materials, such as leather, rubber, or synthetic fabrics, and often feature decorative accents like buckles or beads."], "sarong": ["Sarongs are usually rectangular in shape, with one end wider than the other, and are often worn with the wider end draped over the shoulder.", "Sarongs are often made of lightweight, breathable fabrics, such as cotton or rayon, and are often accessorized with a belt or sash."], "saxophone": ["Saxophones have a series of keys along the body, used to change the pitch of the instrument.", "Saxophones have a mouthpiece with a single reed, which vibrates when air is blown through it, producing sound."], "scabbard": ["Scabbards often have a distinct shape, with a curved or angled tip and a wide, flat body.", "Scabbards may also have decorative features, such as embossed designs, tassels, or straps, which can help to identify them."], "weighing scale": ["Weighing scales often have a digital display, either on the platform or on a separate arm, which shows the weight of the item.", "Weighing scales may also have a dial or other indicator, such as a needle, to show the weight of the item."], "school bus": ["They often have a large, rectangular windshield and a flat front end, with a raised hood and headlights.", "School buses have a wide, hinged door at the rear, and often feature a sign or logo on the side."], "schooner": ["Schooners have a long, narrow hull with a shallow draft, allowing them to sail in shallow waters.", "Schooners often have a distinctive bow with a sharp angle, and a large, open deck with a raised stern."], "scoreboard": ["Scoreboards are often mounted on a wall or stand, and may be accompanied by other equipment such as speakers or cameras.", "Scoreboards may also have additional features such as lights or buttons, which can help distinguish them from other objects."], "CRT monitor": ["CRT monitors are typically connected to a computer via a VGA cable, which is visible in the photo.", "CRT monitors have a large, boxy base, often with a handle, which sets them apart from other monitors."], "screw": ["The head of the screw is usually larger than the shaft, and the threads may be visible.", "Screws may be of various sizes and colors, depending on the material and purpose."], "screwdriver": ["The tip of the screwdriver is usually flat or cross-shaped, allowing it to fit into the head of a screw.", "The shaft of the screwdriver is often marked with measurements, allowing it to be used as a ruler."], "seat belt": ["The strap is usually made of a strong, durable material, such as nylon or polyester, and may be brightly colored for visibility.", "Seat belts are often found in cars, and may be attached to the seat or the door frame, making them easy to spot."], "sewing machine": ["The arm is often adjustable, allowing for different heights and angles, and is connected to a wheel or lever used to control the machine's speed.", "Sewing machines often have a variety of buttons, dials, and levers used to control the machine's settings, making them easily distinguishable."], "shield": ["Shields often feature a distinct design, such as a coat of arms, a crest, or a pattern of lines or shapes.", "Shields are usually made of metal, wood, or leather, and may have a raised rim or border."], "shoe store": ["Inside, shoe stores often have shelves and racks filled with shoes, as well as seating areas for customers to try them on.", "Signs and logos, such as those of popular shoe brands, are often visible, helping to identify the store."], "shoji screen / room divider": ["The panels are often arranged in a grid pattern, with a variety of designs and patterns, such as bamboo or cherry blossoms, to choose from.", "Shoji screens are often used as room dividers, with the panels connected by hinges, allowing them to be folded and stored away when not in use."], "shopping basket": ["Shopping baskets often have a distinct shape, such as a square or oval, with a wide opening at the top.", "Shopping baskets may have a variety of compartments or dividers, allowing for the separation of items."], "shopping cart": ["Shopping carts are often brightly colored, with a logo or other branding on the side.", "Shopping carts are often filled with items, such as groceries, making them easily identifiable."], "shovel": ["The blade is typically curved or angled, allowing for efficient digging and scooping.", "Shovels often have a pointed tip at the end of the blade, allowing for more precise digging."], "shower cap": ["The shape of a shower cap is usually round or oval, with a dome-like top.", "Shower caps often have a bright or colorful pattern, making them stand out from other objects in the photo."], "shower curtain": ["They are usually hung from a rod or rail, often with rings or hooks, and can be seen draped over the bathtub or shower area.", "Shower curtains are often transparent or semi-transparent, allowing light to pass through, and can be seen billowing in the breeze."], "ski": ["Skis often have a distinct pattern of grooves or ridges along the length of the ski, which helps with grip and stability.", "Skis are usually paired with bindings, which attach the ski to the skier's boots, and can be seen in the photo."], "balaclava ski mask": ["The masks often feature a distinct pattern or design, such as stripes or a logo, to help distinguish them from other objects.", "The masks are usually made of a lightweight material, such as fleece or wool, and are designed to be worn under a helmet or other headgear."], "sleeping bag": ["They are often brightly colored or patterned, making them stand out from other objects.", "Sleeping bags are often stuffed with insulation, giving them a distinct, puffy appearance."], "slide rule": ["Slide rules often have a variety of scales, including logarithmic, trigonometric, and other mathematical functions, which can be used to calculate equations.", "Slide rules are usually made of wood or plastic, and may have a metal or plastic cursor to help with calculations."], "sliding door": ["The panels are often made of glass, allowing light to pass through, and are framed by a metal or wooden frame.", "The door is usually mounted on a track, allowing it to slide open and closed, and is often accompanied by a handle or latch."], "slot machine": ["Slot machines often have a distinct handle on the side, used to spin the reels.", "Slot machines are often found in casinos, surrounded by other gaming machines and tables."], "snorkel": ["Snorkels often have a valve at the top of the tube, which helps to prevent water from entering the tube when submerged.", "Snorkels may also have a purge valve at the bottom of the tube, which allows for easy clearing of the tube."], "snowmobile": ["Snowmobiles typically have a large, powerful engine, often with a visible exhaust pipe, and a handlebar steering system.", "Snowmobiles are often brightly colored, with a variety of decals and designs, making them stand out in a photo."], "snowplow": ["Snowplows are often mounted on large, heavy-duty trucks, with a cab for the driver and a large plow blade at the front.", "Snowplows are often brightly colored, with reflective stripes and markings, to make them more visible in low-light conditions."], "soap dispenser": ["Soap dispensers often have a clear window or panel, allowing users to see the level of soap remaining.", "Soap dispensers may be wall-mounted or free-standing, and may be made of plastic, metal, or ceramic."], "soccer ball": ["Soccer balls have a distinct texture, with raised bumps or dimples, which help players grip the ball and control its trajectory.", "Soccer balls are often seen in motion, either being kicked or bouncing off the ground, making them easy to identify."], "sock": ["Socks are often made of stretchy materials, such as cotton or wool, and come in a variety of colors and patterns.", "Socks often have a distinct heel and toe, with a seam running along the top of the foot, distinguishing them from other clothing items."], "solar thermal collector": ["They are often mounted on a roof or other structure, and may be connected to a storage tank or other system components.", "Solar thermal collectors often have a reflective surface, such as a mirror or aluminum sheet, to maximize the amount of sunlight absorbed."], "sombrero": ["The brim of a sombrero is usually quite wide, often extending beyond the wearer's shoulders.", "The crown of a sombrero is typically quite tall, often with a distinctive band or ribbon around the base."], "soup bowl": ["Soup bowls often have a handle or two, allowing for easy gripping and carrying.", "Soup bowls may have a distinct pattern or design, such as a floral motif or a geometric pattern, which can help to identify them."], "keyboard space bar": ["It is usually a different color than the other keys, often white or gray.", "It is often slightly raised or indented, making it easier to identify."], "space heater": ["They often have a visible control panel with knobs or buttons for adjusting the temperature and other settings.", "Space heaters are usually equipped with a fan, which can be seen through the vents on the side or back of the unit."], "space shuttle": ["Space shuttles have two large, solid rocket boosters attached to the sides of the main body, and a large external fuel tank.", "Space shuttles have a large cargo bay door, which is often open during launch, and a tail fin with the NASA logo."], "spatula": ["The handle is usually made of plastic or metal, and the blade is usually made of metal, silicone, or rubber.", "Spatulas often have a hole in the handle for hanging or storage, distinguishing them from other kitchen utensils."], "motorboat": ["Motorboats are often equipped with an outboard motor, which is visible from the stern and can be used to identify the vessel.", "Motorboats often have a distinct seating arrangement, with a helm at the stern and seating for passengers in the bow."], "spider web": ["Webs often feature a distinct spiral pattern, with the center of the web being the densest.", "Webs may also feature a zig-zag pattern, known as the stabilimentum, which is thought to attract prey."], "spindle": ["Spindles often have a distinct pattern of grooves or ridges along their length, which can be used to identify them.", "Spindles are often made of wood, metal, or plastic, and may have a handle or knob at the top for easy spinning."], "sports car": ["Sports cars often have distinct aerodynamic features, such as spoilers, air intakes, and vents, to improve performance.", "Sports cars are usually equipped with large, wide tires and alloy wheels, giving them a unique look."], "spotlight": ["Spotlights often have a distinct housing, such as a metal or plastic casing, which can be used to identify them.", "Spotlights are often mounted on stands or tripods, or affixed to walls or ceilings, setting them apart from other objects."], "stage": ["Stages often have curtains or other decorations, such as banners or flags, to set the scene.", "Stages are often surrounded by seating, such as chairs or benches, and may have a podium or lectern in the center."], "steam locomotive": ["Steam locomotives are powered by a large smokestack, often with a spark arrestor, and a tall, cylindrical chimney.", "Steam locomotives have a large, four-wheeled drive system, with two sets of wheels connected by a connecting rod."], "through arch bridge": ["The arch is often supported by two or more columns, which can be visible in the photo.", "Through arch bridges often have a distinct, symmetrical shape, with the arch rising in the center and tapering off at the ends."], "steel drum": ["Steel drums are often brightly painted with colorful designs, making them stand out from other objects.", "Steel drums have a unique sound, which can be heard when the drum is struck with a mallet or other instrument."], "stethoscope": ["The chestpiece typically has two sides, one flat and one convex, used for different types of auscultation.", "Stethoscopes often have a bright color, such as red or blue, making them stand out in a photo."], "scarf": ["Scarves are often tied in a knot or looped around the neck, distinguishing them from other clothing items.", "Scarves can be made of a variety of materials, such as wool, silk, or cotton, and may have fringes or tassels at the ends."], "stone wall": ["The stones may be of different sizes and shapes, and may be arranged in a variety of patterns, such as horizontal, vertical, or herringbone.", "Stone walls often have a distinct texture, with rough surfaces and edges, and may be covered in moss or lichen."], "stopwatch": ["Stopwatches often have a distinct shape, with a long, thin body and a loop at the top for attaching to a belt or pocket.", "Stopwatches may also have a visible winding mechanism, such as a knob or lever, which can be used to set the time."], "stove": ["Stoves often have an oven below the burners, with a door for access.", "Stoves may have a backsplash or wall behind them, with a vent hood above for smoke and steam."], "strainer": ["The mesh or perforated surface is designed to allow liquid to pass through while trapping solids, making it distinct from other kitchen utensils.", "Strainers often have a hook or loop at the end of the handle, allowing them to be hung up for storage."], "tram": ["Trams are often brightly colored, with a variety of designs and logos, making them easily recognizable.", "Trams are usually connected to overhead power lines, which can be seen in the photo."], "stretcher": ["They are often made of metal or plastic, and feature a canvas or mesh material stretched across the frame.", "Stretchers are often equipped with handles, straps, or wheels, allowing them to be easily transported."], "couch": ["The upholstery of a couch is often a distinguishing feature, with a variety of colors, textures, and patterns available.", "Couches often have visible cushions, pillows, and other decorative elements, setting them apart from other furniture."], "stupa": ["Stupas often feature intricate carvings or decorations, such as prayer flags, bells, and symbols of the Buddha.", "Stupas are often surrounded by a fence or wall, and may be located in a courtyard or garden."], "submarine": ["Submarines are typically painted in a camouflage pattern, helping them blend in with the surrounding environment.", "Submarines often have visible periscopes, antennas, and other equipment, which can be used to identify them."], "suit": ["Suits often have distinct lapels, pockets, and buttons, as well as a tailored fit, setting them apart from other clothing.", "Suits are often worn with a dress shirt, tie, and dress shoes, further distinguishing them from other garments."], "sundial": ["The gnomon is often decorated with a sundial face, which is a set of markings that indicate the time of day.", "Sundials are often placed in open, sunny areas, such as gardens or parks, and may be surrounded by other decorative features."], "sunglass": ["Sunglasses often have tinted lenses, which can range from light to dark, and may be mirrored or polarized.", "Sunglasses may also have distinct features, such as arms or temples, which can be straight or curved."], "sunglasses": ["The lenses are usually tinted, often with a gradient or mirrored effect, and can be round, square, or aviator-style.", "Sunglasses often have a distinct shape or style, such as cat-eye, wayfarer, or aviator, which can help to identify them."], "sunscreen": ["Sunscreens often have a distinct label or logo, making them easily identifiable.", "Sunscreens often have a white or off-white color, helping to distinguish them from other objects."], "suspension bridge": ["The towers are typically tall and slender, with the cables extending from the top of each tower to the roadway below.", "The roadway is typically composed of a series of steel girders, which are connected to the cables and provide support for the bridge deck."], "mop": ["The head of the mop is often rectangular or oval in shape, with a looped or twisted design to hold the material in place.", "Mops are often brightly colored, making them stand out from other objects in the photo."], "sweatshirt": ["They are usually made of a thick, soft material, such as cotton or fleece, and often feature a drawstring at the neck.", "Sweatshirts often have a logo or design printed on the front, making them easily distinguishable from other clothing items."], "swim trunks / shorts": ["They are often brightly colored or patterned, with bold designs or logos.", "They are usually made of lightweight, quick-drying materials, such as nylon or polyester."], "swing": ["Swings are often found in playgrounds, with a frame or structure to support the seat.", "Swings may also be found in gardens or backyards, often with a tree or other sturdy post to hang the seat from."], "electrical switch": [" Electrical switches often have a distinct label or marking on the front, such as \"on/off\" or \"light/dark.\"", " Electrical switches are often connected to wires or cables, which can help to identify them."], "syringe": ["The needle is typically sharp and pointed, and may be covered with a protective cap.", "Syringes are often accompanied by a clear plastic or glass barrel, which holds the liquid to be injected."], "table lamp": ["The lampshade is usually the most recognizable feature, often made of fabric or paper and shaped like a cone, cylinder, or bell.", "Table lamps often have a switch or knob for turning the light on and off, making them easily distinguishable from other objects."], "tank": ["Tanks possess a distinct, boxy shape, with sloping sides and a flat bottom, and are usually painted in camouflage colors.", "Tanks are often accompanied by other military vehicles, such as jeeps or personnel carriers, which can help identify them."], "tape player": ["Tape players have a series of buttons and knobs for controlling playback, such as play, pause, fast-forward, and rewind.", "Tape players often have a headphone jack and a speaker, allowing for private or shared listening."], "teapot": ["Teapots often have a distinct shape, such as a pear or hourglass, and may be decorated with patterns or colors.", "Teapots may also have a spigot or tap at the bottom, allowing for easy pouring of the contents."], "teddy bear": ["They often have small, black, plastic eyes and a black, plastic nose, as well as a stitched mouth.", "Teddy bears typically have short, stubby arms and legs, and a large, round tummy. They often have a bow or ribbon tied around their neck."], "television": ["TVs either sit on distinct stands, such as central pillars or side feet, or are wall-mounted using brackets, setting them apart.", "Visible cables, connecting to ports like HDMI or USB, highlight the TV's function as an entertainment hub, aiding in its identification."], "tennis ball": ["Tennis balls have a distinct round shape, with a diameter of about 2.7 inches.", "Tennis balls are usually made of rubber, with a felt-like surface, and are often seen with a logo or brand name printed on them."], "thatched roof": ["Thatch roofs are usually rounded or conical in shape, with a steep pitch to allow for water runoff.", "Thatch roofs often have a distinct, rustic appearance, with visible gaps between the layers of material."], "front curtain": ["They are usually hung in a way that allows them to be opened and closed, either by hand or with a cord or pulley system.", "Front curtains often have a distinct pleated or gathered look, with folds or gathers along the top and bottom edges."], "thimble": ["Thimbles often have a distinct pattern or design on the outside, such as a floral motif or a raised texture.", "Thimbles are usually small, often no larger than a fingertip, and can be identified by their size and shape."], "threshing machine": ["The machine is often mounted on a frame with wheels, allowing it to be towed by a tractor or other vehicle.", "The threshing machine is usually accompanied by a collection bin or hopper, which collects the separated grain."], "throne": ["Thrones are often placed on a raised platform, setting them apart from other furniture.", "Thrones are often accompanied by a canopy or other drapery, further distinguishing them from other chairs."], "tile roof": ["Tile roofs often have a distinct, curved shape, with the tiles arranged in a pattern that slopes downward from the peak.", "Tile roofs are often accompanied by a parapet wall, which is a low wall that runs along the edge of the roof."], "toaster": ["Toasters often have a control knob for adjusting the toasting level, as well as a timer for setting the desired toasting time.", "Toasters may also have a crumb tray for collecting the toast crumbs, and a cord for connecting to an electrical outlet."], "tobacco shop": ["The shop may have a variety of tobacco products on display, such as cigarettes, cigars, pipes, and rolling papers.", "Tobacco shops often have a distinct smell, as well as a variety of ashtrays and lighters."], "toilet seat": ["Toilet seats are often made of plastic or porcelain, and may have a glossy or matte finish.", "Toilet seats are usually connected to the toilet bowl with two hinges, allowing them to be raised and lowered."], "torch": ["The flame or light source is usually bright and distinct, making it easy to identify.", "Torches often have a protective cage or guard around the flame or light source, which can help distinguish it from other objects."], "totem pole": ["Totem poles are often brightly painted with vivid colors, making them stand out from other objects.", "Totem poles are typically found in clusters, with multiple poles standing side by side, making them easier to identify."], "tow truck": ["Tow trucks are often brightly colored, with distinct markings and logos, and may have a light bar on the roof.", "Tow trucks are usually equipped with a winch and a tow bar, which can be seen in the photo."], "toy store": ["Toy stores often have large signs or banners advertising their products, as well as promotional displays.", "Toy stores may also have distinct decorations, such as balloons, posters, or other decorations, to attract customers."], "tractor": ["Tractors are typically equipped with large, wide tires, often with treads, and a three-point hitch for attaching implements.", "Tractors are often brightly colored, with a variety of logos and decals, making them easily recognizable."], "semi-trailer truck": ["The trailer is usually box-shaped, with a flat roof and sides, and is often decorated with logos or other markings.", "Semi-trailer trucks have large wheels and tires, and often have a fifth wheel coupling at the rear of the cab, connecting the trailer to the truck."], "tray": ["Trays often have handles on either side, making them easier to carry.", "Trays may be made of a variety of materials, such as wood, metal, or plastic, and may be decorated with patterns or designs."], "trench coat": ["Trench coats are usually made of a waterproof material, such as cotton gabardine, and feature a distinct collar and lapels.", "Trench coats often have epaulettes, straps, or buckles on the shoulders, and may have pockets, flaps, or vents at the bottom."], "tricycle": ["Tricycles often have a distinct frame, with a handlebar and seat for the rider, and pedals for propulsion.", "Tricycles may also have a basket or other storage area, which can be used to identify them."], "trimaran": ["Trimarans often have a large, open cockpit, allowing for easy access and visibility.", "Trimarans typically have a tall, slender mast, with a large sail, which can be seen from a distance."], "tripod": ["Tripods typically have a central column with a platform at the top, where a camera or other device can be mounted.", "Tripods often have a hook at the bottom of the central column, allowing additional weight to be added for stability."], "triumphal arch": ["The archways are often decorated with sculptures, reliefs, or inscriptions, which can be used to identify the structure.", "Triumphal arches are often situated at the entrance of a city or town, or at the end of a ceremonial route, making them easy to spot."], "trolleybus": ["Trolleybuses have two sets of doors, one at the front and one at the rear, and often have a distinctive livery or color scheme.", "Trolleybuses have a large, boxy shape with a flat roof, and often have a raised platform at the rear for passengers to board."], "trombone": ["Trombones have a distinct mouthpiece, typically made of brass, which is inserted into the top of the instrument.", "Trombones are often held in a horizontal position, with the bell facing up, and the slide mechanism extending outwards."], "hot tub": ["They often have a distinct cover, which can be either solid or mesh, and may be decorated with lights or jets.", "Hot tubs are usually filled with water and may have visible bubbles or steam rising from the surface."], "turnstile": ["Turnstiles are often found in public spaces, such as train stations, and are usually accompanied by a card reader or ticket machine.", "Turnstiles are usually painted in bright colors, such as yellow or red, to make them easily identifiable."], "typewriter keyboard": ["The keys are typically arranged in a staggered pattern, with the keys on the left side of the keyboard slightly higher than those on the right.", "The keys are often labeled with letters, numbers, and symbols, and may have a raised or embossed texture."], "umbrella": ["The canopy is often brightly colored or patterned, making it stand out from other objects.", "The handle is often curved or hooked, allowing it to be hung up or carried easily."], "unicycle": ["Unicycles have a distinct saddle, often with a handlebar or other support, and a pedal crank connected to the wheel.", "Unicycles are often brightly colored, with a unique shape that sets them apart from other objects."], "upright piano": ["The piano's keyboard is typically visible, with black and white keys arranged in a repeating pattern.", "Upright pianos have three pedals at the base, used to control the sound and volume of the instrument."], "vacuum cleaner": ["Vacuum cleaners often have a distinct wheeled base, allowing them to be moved around easily.", "Vacuum cleaners also have a variety of attachments, such as brushes, crevice tools, and dusting tools, which can help identify them."], "vase": ["Vases often have intricate designs, such as patterns, carvings, or painted images, which can help distinguish them from other objects.", "Vases are often made of glass, ceramic, or metal, and may have a glossy or matte finish, further aiding in their identification."], "vaulted or arched ceiling": ["The walls of the room may be curved or angled to match the ceiling, creating a distinct shape.", "The ceiling may be decorated with ornate moldings, such as dentils, corbels, or coffers, which can help to identify it."], "velvet fabric": ["Velvet fabric is usually made of a combination of silk, cotton, or synthetic fibers, and is often dyed in a variety of colors.", "Velvet fabric is often used to make clothing, upholstery, and drapery, and can be identified by its unique texture and appearance."], "vending machine": ["They often have a distinct control panel with buttons and a display screen, as well as a coin or card slot for payment.", "Vending machines are usually mounted on a wall or stand, and may have a logo or other branding visible."], "vestment": ["Vestments are often made of luxurious fabrics such as silk, velvet, or brocade, and may feature a variety of adornments such as crosses, buttons, or tassels.", "Vestments are typically worn over a cassock or surplice, and may include a stole, cope, or chasuble, all of which can be used to distinguish them from"], "viaduct": ["Viaducts are often elevated, allowing them to span valleys or other obstacles, and are often supported by pillars or buttresses.", "Viaducts often have distinct railings or parapets, which can be used to distinguish them from other structures."], "violin": ["The strings of a violin are typically visible, as well as the bridge and tailpiece.", "The strings are attached to a fingerboard, which is often decorated with inlays.", "The violin's body is usually made of wood, and may be decorated with ornate designs."], "volleyball": ["Volleyballs are usually brightly colored, often with a combination of white, yellow, and other colors.", "Volleyballs are often seen in the air, as they are used for a variety of sports, such as beach volleyball, indoor volleyball, and water polo."], "waffle iron": ["Waffle irons often have a handle, allowing them to be opened and closed, and a cord for plugging into an outlet.", "Waffle irons may have a light indicator to show when the appliance is on and ready to use."], "wall clock": ["Wall clocks often have two hands, a long and a short, which move in a circular motion to indicate the time.", "Wall clocks are usually mounted on a wall, either with a bracket or a hook, setting them apart from other objects."], "wallet": ["They often have a foldable design, with two or more compartments for cards and cash.", "Wallets may also have a distinct closure, such as a snap, zipper, or button, to keep contents secure."], "wardrobe": ["Wardrobes often have distinct handles or knobs, as well as hinges or other hardware, to open and close the doors.", "Wardrobes may also have a mirror attached to the front, making them easier to identify."], "military aircraft": ["They are typically painted in camouflage colors, helping them blend into their environment.", "Military aircraft often have additional features, such as weapons, radar, and other sensors, which can be used to identify them."], "sink": ["Sinks may have a single or double basin, and may be made of materials like stainless steel, porcelain, or granite.", "Visible pipes or plumbing fixtures, such as a shut-off valve, can help identify a sink in a photo."], "washing machine": ["They often have a control panel with buttons, dials, or a digital display, which can help distinguish them from other objects.", "Washing machines are usually connected to a water source and a drain, which can be seen in the photo."], "water bottle": ["Water bottles often have a distinct label or logo, making them easily identifiable.", "Water bottles may have a handle or strap for easy carrying, setting them apart from other objects."], "water jug": ["Water jugs are often made of plastic or metal, and may have a lid or cap.", "Water jugs may have a label or logo, distinguishing them from other objects."], "water tower": ["The tank is often painted with a distinct color or logo, making it stand out from the surrounding environment.", "Water towers are often situated on a raised platform, making them visible from a distance."], "whiskey jug": ["The jugs are often decorated with a variety of designs, such as embossed patterns, painted images, or text.", "The jugs are usually made of glass or ceramic, and may have a cork or screw-top lid."], "whistle": ["Whistles often have a distinct shape, such as a pea whistle, which has a round body and a narrow, pointed end.", "Whistles may also have a lanyard attached, allowing them to be worn around the neck or hung from a belt loop."], "hair wig": ["Hair wigs often have a uniform, unnatural texture, with a lack of natural movement or variation in color.", "Hair wigs are often styled in a particular way, such as a particular cut or color, which can help distinguish them from natural hair."], "window screen": ["The mesh is usually held in place by a frame, which is often visible in the photo.", "Window screens are usually installed in windows, so the presence of a window frame can also be a clue."], "window shade": ["When rolled up, window shades often have a distinct pleated or accordion-like appearance.", "Window shades are usually mounted on a window frame or wall, and may have a cord or chain for manual operation."], "Windsor tie": ["The tie is typically made of a thicker, more luxurious fabric than other ties, and often has a glossy sheen.", "The Windsor tie is usually wider than other ties, and is often accompanied by a pocket square or other accessories."], "wine bottle": ["The bottle is usually made of glass, and may have a distinct shape or color, such as a green or brown tint.", "The bottle may also have a cork or screw-top closure, which can help distinguish it from other containers."], "airplane wing": ["Airplane wings often have a distinct pattern of rivets along the surface, as well as ailerons and flaps that can be seen when the wings are extended.", "Airplane wings are usually painted with a unique design, such as a logo or stripes, that can help distinguish them from other objects."], "wok": ["The sides of the wok are often curved, allowing for easy stirring and tossing of ingredients.", "Woks are often used for stir-frying, so they may be seen with flames or smoke rising from them."], "wooden spoon": ["The handle is often curved or angled, and the bowl is usually round or oval.", "The surface of the spoon is usually smooth and light in color, with visible grain patterns."], "wool": ["Wool is often found in the form of yarn, which can be identified by its long, thin strands.", "Wool is also often found in the form of fabric, which can be identified by its woven texture and its tendency to wrinkle or fold."], "split-rail fence": ["The rails are often held together with wooden pegs or metal fasteners, and the fence is usually topped with a single rail or a line of wire.", "Split-rail fences are often used in rural settings, and can be seen in fields, pastures, and along roadsides."], "shipwreck": ["Rust and corrosion are common features of shipwrecks, as are barnacles and other marine life that have colonized the wreck.", "Shipwrecks often appear as jagged silhouettes against the horizon, with the remains of the ship's structure visible in the water."], "sailboat": ["Sailboats typically have a long, slender hull with a pointed bow and a flat stern, allowing them to cut through the water.", "Sailboats often have a cabin or cockpit, which can be used for shelter or storage, and a rudder for steering."], "yurt": ["Yurts often have a distinct door flap, which can be opened or closed, and a smoke hole at the top of the roof.", "Yurts are often decorated with colorful fabrics, rugs, and other decorations, making them stand out from other structures."], "website": [" The page is usually divided into sections, with text, images, and other media arranged in a grid or other pattern.", " Links to other pages or websites are often highlighted in a different color or font, making them easy to spot."], "comic book": ["Comic books are usually rectangular in shape, with a spine down the center and pages that can be flipped through.", "Comic books often have a barcode on the back cover, which can be used to identify the title and issue."], "crossword": ["The grid is often filled with words written in a variety of directions, including across and down.", "Crosswords often have a theme, with related words or phrases appearing in the puzzle."], "traffic or street sign": ["Signs often feature a distinct symbol or image, such as a stop sign with an octagonal shape and a red background.", "Signs are often mounted on poles or posts, setting them apart from other objects in the photo."], "traffic light": ["The lights are usually red, yellow, and green, and may be accompanied by a pedestrian crossing signal.", "Traffic lights are often mounted on a post or pole, and may be accompanied by other traffic signs or signals."], "dust jacket": ["Dust jackets are usually slightly larger than the book they cover, and often have flaps that fold over the edges of the book.", "Dust jackets are usually brightly colored and glossy, making them stand out from other objects in the photo."], "menu": ["Menus often have a distinct font and color scheme, making them stand out from other objects in the photo.", "Menus often contain a list of items, such as food or drinks, with prices and descriptions, making them easily identifiable."], "plate": ["Plates often have a raised rim, which helps contain food and liquids.", "Plates are usually made of ceramic, glass, or metal, and can be identified by their distinct textures and colors."], "guacamole": ["Guacamole is often served in a bowl or plate, with a spoon or scoop for scooping.", "Guacamole is often garnished with cilantro, lime, and other ingredients, making it easily distinguishable from other dishes."], "consomme": ["Consomme is usually a light golden color, with a glossy sheen, and is often garnished with vegetables or herbs.", "Consomme is usually served hot, and can be distinguished from other soups by its clear, transparent appearance."], "hot pot": ["Hot pots often have a handle on the side, and may have a spout for pouring out liquid.", "Hot pots may have a visible heating element, such as a coil or burner, which can be used to distinguish them from other objects."], "trifle": ["Trifles are usually topped with a layer of custard, cream, or jelly, and decorated with fruits, nuts, or other sweet treats.", "Trifles often have a layer of whipped cream or meringue on top, giving them a distinct, fluffy appearance."], "ice cream": ["Ice cream is often served in a cone or cup, with a spoon or other utensil for scooping.", "Ice cream is often topped with sprinkles, nuts, or other toppings, which can help distinguish it from other desserts."], "popsicle": ["The popsicle is usually brightly colored, often with stripes or swirls, and may have a glossy sheen.", "The popsicle may be partially melted, with drips of liquid running down the sides."], "baguette": ["Baguettes are typically uniform in shape, with a tapered end and a slightly curved top.", "Baguettes are often scored with a series of diagonal lines, creating a distinctive pattern on the crust."], "bagel": ["Bagels are often topped with sesame, poppy, or other seeds, which can help distinguish them from other breads.", "Bagels are usually boiled before baking, giving them a glossy, golden-brown exterior."], "pretzel": ["Pretzels are often covered in coarse salt, which can be seen as a white or light-colored coating.", "Pretzels are usually a golden-brown color, with a slightly crisp texture."], "cheeseburger": ["The patty is usually surrounded by lettuce, tomato, onion, and pickles, and may be accompanied by condiments like ketchup, mustard, and mayonnaise.", "The burger is often served with a side of fries, adding to its distinctiveness."], "hot dog": ["Hot dogs are often brightly colored, with yellow or orange being the most common.", "Hot dogs are often topped with condiments such as ketchup, mustard, relish, or onions, which can help to distinguish them from other foods."], "mashed potatoes": ["The color of mashed potatoes can vary, but is usually a light yellow or white.", "Mashed potatoes are often served with a dollop of butter or cream, which can be used to distinguish them from other dishes."], "cabbage": ["The leaves are typically green, but can also be purple or red, and often have a waxy texture.", "Cabbages have a short stem, often with a few leaves at the base, and a distinct, white core."], "broccoli": ["The florets are tightly packed and have a slightly yellowish hue.", "Broccoli has thick, fibrous stalks with a rough texture and a slightly bitter taste."], "cauliflower": ["The florets are attached to a thick, fibrous stem, often with a few leaves still attached.", "Cauliflower has a mild, slightly sweet flavor, and a crunchy texture when raw."], "zucchini": ["Zucchinis have a smooth, glossy skin, often with light stripes or bumps.", "Zucchinis have a distinct flower at the end, which can be yellow or white."], "spaghetti squash": ["The skin of a spaghetti squash is usually bumpy and hard to the touch.", "When cut open, spaghetti squash reveals a fibrous, stringy interior, which can be easily pulled apart with a fork."], "acorn squash": ["The stem of the squash is usually long and curved, and the blossom end of the squash is typically pointed.", "The flesh of the squash is usually yellow-orange in color and has a sweet, nutty flavor."], "butternut squash": ["The skin of a butternut squash is typically a light tan color with darker stripes or spots.", "The flesh of a butternut squash is usually a bright orange color, which can be seen when cut open."], "cucumber": ["Cucumbers are typically a bright green color, although some varieties may be yellow or white.", "Cucumbers have a distinct, mild aroma, and may have small, white flowers at the end."], "artichoke": ["The leaves of an artichoke are thick and pointed, often with a light green or purple hue.", "Artichokes have a distinct, sweet, nutty flavor, which can be used to distinguish them from other vegetables."], "bell pepper": ["Bell peppers come in a variety of colors, ranging from green to yellow, orange, red, and even purple.", "Bell peppers have a glossy, smooth skin, and are often slightly ribbed or wrinkled."], "cardoon": ["The stems of cardoons are thick and fleshy, often with a purplish hue.", "Cardoons produce large, thistle-like flower heads that are usually purple or white in color."], "mushroom": ["The cap of a mushroom can be smooth or covered in scales, ridges, or gills, which are often visible when viewed from the side.", "The color of the mushroom can vary, ranging from white to brown, yellow, or even blue."], "Granny Smith apple": ["The apples are typically round and firm, with a distinctively tart flavor.", "Granny Smith apples have a unique star-shaped core, with five points radiating from the center."], "strawberry": ["The bright red color of the fruit is a key identifier, as well as the presence of small yellow seeds on the surface.", "The leaves of the strawberry plant are also distinctive, with three pointed lobes and a toothed edge."], "orange": ["Oranges have a distinct citrus aroma, which can be detected in close proximity.", "Oranges have a distinct texture, with a juicy interior and a thin, edible peel."], "lemon": ["Lemons have a distinct, sour aroma, which can be detected in close proximity.", "Lemons have a bumpy texture, with small dimples and ridges, and a slightly rough surface."], "fig": ["Figs have a unique texture, with a soft, fleshy interior and small, crunchy seeds.", "Figs often grow in clusters, with multiple fruits growing from a single stem."], "pineapple": ["The pineapple's shape is typically cylindrical, with a slightly curved base and a pointed top.", "The pineapple's flesh is yellow-orange in color and has a sweet, juicy flavor."], "banana": ["Bananas have a distinct texture, with small ridges running along the length of the fruit.", "Bananas have a distinct aroma, which can be detected even in a photo."], "jackfruit": ["Jackfruits are large, round fruits with a thick, bumpy rind and a sweet, yellow flesh.", "Jackfruits have a distinct, pungent smell, which can be used to identify them."], "cherimoya (custard apple)": ["The fruit has a white, creamy flesh with black seeds, which can be seen when cut open.", "The fruit has a sweet, fragrant aroma, which can be detected in the photo."], "pomegranate": ["The skin is often marked with a star-shaped pattern, and when cut open, reveals a cluster of edible seeds.", "Pomegranates are often larger than other fruits, and their size and shape can help distinguish them from other objects."], "hay": ["Hay is often found in large bales, either round or rectangular, with visible strings or twine used to bind them.", "Hay may also be found in loose piles, often with visible stems and leaves, or in stacks of smaller bales."], "carbonara": ["The pasta is usually a long, thin noodle, such as spaghetti or fettuccine, and is often topped with a sprinkle of black pepper.", "The dish is usually served in a bowl, with the creamy sauce coating the noodles and the bacon pieces visible on top."], "chocolate syrup": ["It is usually found in a bottle or container with a nozzle or spout, allowing for easy pouring.", "Chocolate syrup is often found in a pool or puddle, with a distinct, smooth texture."], "dough": ["Dough can be seen in various shapes, such as circles, rectangles, or other forms, depending on its intended use.", "Dough may also display various textures, such as ridges or indentations, depending on the type of dough and how it is handled."], "meatloaf": ["The texture of the meatloaf is usually dense and uniform, with visible pieces of vegetables or other ingredients.", "The color of the meatloaf is usually a deep brown, with variations depending on the ingredients used."], "pizza": ["The crust is often golden-brown in color, with a variety of sauces, cheeses, and meats arranged in a circular pattern.", "The edges of the pizza are often slightly raised, with a distinct texture and flavor."], "pot pie": ["The filling of a pot pie is usually savory, with a mix of vegetables, proteins, and gravy.", "Pot pies are often served in individual dishes, such as ramekins or pie plates, which can help distinguish them from other dishes."], "burrito": ["Burritos are often filled with a variety of ingredients, such as beans, rice, cheese, and vegetables, which can be seen through the tortilla.", "Burritos are often served with a variety of condiments, such as salsa, sour cream, and guacamole, which can be seen in the photo."], "red wine": ["Red wines often have a fruity aroma, such as cherry, raspberry, or blackberry.", "Red wines often have a full-bodied flavor, with notes of oak, tannins, and spices."], "espresso": ["Espresso is usually darker in color than other coffee drinks, and has a distinctively strong aroma.", "Espresso is often served with a small spoon, which can be used to stir the drink and add sugar or other flavorings."], "tea cup": ["Tea cups often have a distinct pattern or design, such as a floral motif or a geometric pattern, which can help to identify them.", "Tea cups are often made of porcelain or ceramic, and may have a glossy or matte finish, which can help to distinguish them from other objects."], "eggnog": ["Eggnog is often served in a glass or mug, with a dollop of whipped cream and a sprinkle of nutmeg or cinnamon on top.", "Eggnog is often served with a spoon, which can be used to stir the beverage and mix in additional ingredients."], "mountain": ["Mountains often have distinct ridges and valleys, with a variety of vegetation and rock formations.", "Mountains are often surrounded by other landforms, such as hills, valleys, and plains, which can help to identify them."], "bubble": ["Bubbles often appear in clusters, with multiple bubbles of varying sizes and shapes.", "Bubbles are often seen with a thin film of water on the surface, creating a glossy, reflective effect."], "cliff": ["Cliffs often have a distinct coloration, often lighter than the surrounding terrain, due to the presence of exposed rock.", "Cliffs may also have visible vegetation, such as shrubs or trees, growing from their faces, further distinguishing them from other landforms."], "coral reef": ["Coral reefs often have a distinct topography, with a variety of shapes and sizes of coral formations, as well as other structures like sandbars and lagoons.", "Reefs are often populated by a variety of fish, sea turtles, and other marine life, which can be seen swimming around the reef."], "geyser": ["Geysers often have a distinct cone-shaped mound of earth or rock around the base of the eruption, which can be seen in the photo.", "Geysers may also have a pool of water nearby, which can be seen in the photo."], "lakeshore": ["Lakeshores often have a variety of vegetation, such as grasses, shrubs, and trees, growing near the water's edge.", "Lakeshores may also feature rocks, sand, or other sedimentary deposits, as well as docks, piers, or other structures."], "promontory": ["Promontories often have a distinct shape, such as a point or a curved arc, and may be surrounded by rocky shorelines.", "Promontories may also be identified by the presence of vegetation, such as trees or shrubs, growing on the cliff face."], "sandbar": ["Sandbars often have a distinct color, often lighter than the surrounding water, due to the presence of lighter-colored sediment.", "Sandbars may also be visible as a line of vegetation, such as seagrass or mangroves, growing along the edge of the bar."], "beach": ["Waves crashing onto the shoreline are a common feature, as are seashells and other beach debris.", "Beaches often have distinct vegetation, such as palm trees, sea grasses, and other coastal plants."], "valley": ["Valleys often have a river or stream running through them, which can be seen in the photo.", "Valleys are often surrounded by hills or mountains, which can be seen in the background of the photo."], "volcano": ["Volcanoes often display a plume of smoke or ash, indicating an active eruption.", "Volcanoes may also have lava flows or other evidence of past eruptions, such as cooled lava flows or ash deposits."], "baseball player": ["Baseball players often carry a bat, glove, or other equipment, which can be used to identify them.", "Baseball players often have a distinct stance, with their feet spread apart and their arms in a ready position, which can help distinguish them from other athletes."], "bridegroom": ["Bridegrooms often have a boutonniere pinned to their lapel, which can be a helpful visual cue.", "Bridegrooms may also be wearing a wedding ring, which can be a useful visual feature for identification."], "scuba diver": ["They carry a large air tank on their back, connected to a regulator and mouthpiece, allowing them to breathe underwater.", "Scuba divers often carry additional equipment, such as a knife, compass, and flashlight, which can be used to identify them."], "rapeseed": ["The leaves of the rapeseed plant are long and thin, with a jagged edge and a glossy sheen.", "The seed pods of the rapeseed plant are small and round, with a hard outer shell and a soft inner core."], "daisy": ["The leaves of a daisy are typically long and narrow, with a toothed or lobed edge.", "Daisies often grow in clusters, with multiple flowers on a single stem."], "yellow lady's slipper": ["The pouch is often marked with a deep purple or maroon color, and the petals are typically a lighter yellow or white.", "The plant has a single stem with two or three leaves, and the flower is typically found in clusters of two or three."], "corn": ["The ears of corn are easily identifiable, with a husk of overlapping leaves surrounding the yellow or white kernels.", "The kernels of corn are arranged in rows, often with a tassel at the top of the ear."], "acorn": ["The cap is often ridged or scaly, and can be a different color than the nut itself.", "Acorns are typically dark brown or black in color, and have a smooth, glossy surface."], "rose hip": ["Rose hips are typically larger than the petals of the rose flower, and have a distinct shape with a pointed end.", "The skin of the rose hip is often wrinkled or dimpled, and may have a slight fuzz or hairs."], "horse chestnut seed": ["The husk is usually green or brown in color, and can be easily peeled away to reveal the glossy, dark brown seed inside.", "The seed itself is often marked with a white star-shaped pattern, making it easy to identify."], "coral fungus": ["The branches of coral fungi are often covered in small, spiny protrusions, giving them a fuzzy or velvety texture.", "The base of the coral fungus is typically a single, thick stem, often with a bulbous or cup-like shape."], "agaric": ["Agarics possess a distinct stem, often with a bulbous base and a ring near the top.", "Agarics often have gills on the underside of the cap, which can be white, yellow, or brown."], "gyromitra": ["The cap is typically yellowish-brown to reddish-brown in color, with a smooth or slightly scaly surface.", "The stem is usually short and thick, often with a bulbous base, and may be covered in small scales or hairs."], "stinkhorn mushroom": ["The mushroom's surface is covered in a slimy, smelly coating, which can be a variety of colors, including yellow, orange, or pink.", "The mushroom's stem is typically white and covered in small, spore-bearing scales."], "earth star fungus": ["The arms of the earth star are typically covered in a thin, papery skin, which can be peeled back to reveal the spore-bearing disc.", "Earth star fungi are often found in clusters, with multiple stars growing from the same base."], "hen of the woods mushroom": ["The mushroom's underside is covered in small, white pores, rather than gills, which are used to release spores.", "Hen of the woods mushrooms often grow in clusters at the base of trees, often near oaks, and can be identified by their unique shape and color."], "bolete": ["The cap is typically a reddish-brown color, with a lighter margin, and may have a velvety texture.", "The stem is typically thick and white, with a spongy texture, and may have a ring near the top. The underside of the cap has a spore-bearing surface with pores or tubes."], "corn cob": ["The kernels are arranged in a spiral pattern, with a pointed end and a rounded end.", "The husks of the corn cob are often visible, with a green or brown color and a fibrous texture."], "toilet paper": ["It is usually white or off-white in color, and may have a pattern or logo printed on it.", "Toilet paper is often found in a roll, with the paper unrolling from the center."]}